const PlayMenu = {
  playId: {
    // Thai
    2056: '直選', // 直选
    2058: '組選', // 组选
    2061: '直選', // 直选
    2063: '組選', // 组选
    2065: '直選加開', // 直选加开
    2068: '後三不定位', // 后三不定位
    2055: '三數', // 三数
    2057: '上正三位數', // 上正三位数
    2059: '上反三位數', // 上反三位数
    2060: '二數', // 二数
    2062: '上正二位數', // 上正二位数
    2064: '上反二位數', // 上反二位数
    2066: '下正二位數', // 下正二位数
    2067: '跑數', // 跑数
    2069: '上跑三位數', // 上跑三位数
    2297: '魚蝦蟹', // 魚蝦蟹
    2298: '魚蝦蟹', // 魚蝦蟹
    2299: '魚蝦蟹', // 魚蝦蟹
    2497: '番攤', //番摊
    2498: '番',
    2499: '番',
    2500: '角',
    2501: '角',
    2502: '念',
    2503: '念',
    2504: '大小單雙',
    2505: '大小單雙',

    2480: '下正二位數（包注）',
    2481: '下正二位數（輸入）',
    2482: '上反二位數（包注）',
    2483: '上正二位數（包注）',
    2484: '上正二位數（輸入）',
    2485: '上正三位數（包注）',
    2486: '上正三位數（輸入）',
    2487: '上反三位數（包注）',

    // vnc 越南彩
    2090: '四數', // 四数
    2095: '三數', // 三数
    2100: '二數', // 二数
    2105: '跑數', // 跑数

    2092: '上正四位數', // 上正四位数 Last_4_Straight_1st_VNC
    2094: '上反四位數', // 上反四位数 Last_4_Combine_1st_VNC
    2097: '上正三位數', // 上正三位数 Last_3_Straight_1st_VNC
    2099: '上反三位數', // 上反三位数 Last_3_Combine_1st_VNC
    2102: '上正二位數', // 上正二位数 Last_2_Straight_1st_VNC
    2104: '下正二位數', // 下正二位数 Last_2_Straight_2nd_VNC
    2107: '上跑兩位數', // 上跑两位数 Last_2_Any_1st_VNC
    2109: '下跑兩位數', // 下跑两位数 Last_2_Any_2nd_VNC

    2286: '上正四位數（包注）', // Last_4_Straight_1st_VNC_Multi
    2287: '上正四位數（輸入）', // Last_4_Straight_1st_VNC_Single
    2285: '上正三位數（輸入）', // Last_3_Straight_1st_VNC_Single
    2284: '上正三位數（包注）', // Last_3_Straight_1st_VNC_Multi
    2283: '上反三位數（包注）', // Last_3_Combine_1st_VNC_Multi
    2280: '上正二位數（輸入）', // Last_2_Straight_1st_VNC_Single
    2279: '上正二位數（包注）', // Last_2_Straight_1st_VNC_Multi
    2282: '下正二位數（輸入）', // Last_2_Straight_2nd_VNC_Single
    2281: '下正二位數（包注）', // Last_2_Straight_2nd_VNC_Multi

    2300: '魚蝦蟹', // 魚蝦蟹
    2301: '魚蝦蟹', // 魚蝦蟹
    2302: '魚蝦蟹', // 魚蝦蟹
    2488: '番攤', //番摊
    2489: '番',
    2490: '番',
    2491: '角',
    2492: '角',
    2493: '念',
    2494: '念',
    2495: '大小單雙',
    2496: '大小單雙',

    // LAO 老挝彩
    2127: '四數', // 四数
    2132: '三數', // 三数
    2137: '二數', // 二数
    2142: '跑數', // 跑数

    2129: '上正四位數', // 上正四位数 Last_4_Straight_LAO
    2131: '上反四位數', // 上反四位数 Last_4_Combine_LAO
    2134: '上正三位數', // 上正三位数 Last_3_Straight_LAO
    2136: '上反三位數', // 上反三位数 Last_3_Combine_LAO
    2139: '上正二位數', // 上正二位数 Last_2_Straight_LAO
    2141: '下正二位數', // 下正二位数 First_2_Straight_LAO
    2144: '上跑兩位數', // 上跑两位数 Last_2_Any_LAO
    2146: '下跑兩位數', // 下跑两位数 First_2_Any_LAO

    2288: '上正二位数（包注）', // Last_2_Straight_LAO_Multi
    2289: '上正二位数（輸入）', // Last_2_Straight_LAO_Single
    2290: '下正二位数（包注）', // First_2_Straight_LAO_Multi
    2291: '下正二位数（輸入）', // First_2_Straight_LAO_Single
    2292: '上反三位数（包注）', // Last_3_Combine_LAO_Multi
    2293: '上正三位数（包注）', // Last_3_Straight_LAO_Multi
    2294: '上正三位数（輸入）', // Last_3_Straight_LAO_Single
    2295: '上正四位数（包注）', // Last_4_Straight_LAO_Multi
    2296: '上正四位数（輸入）', // Last_4_Straight_LAO_Single

    2303: '魚蝦蟹', // 魚蝦蟹
    2304: '魚蝦蟹', // 魚蝦蟹
    2305: '魚蝦蟹', // 魚蝦蟹
    2506: '番攤', //番摊
    2507: '番',
    2508: '番',
    2509: '角',
    2510: '角',
    2511: '念',
    2512: '念',
    2513: '大小單雙',
    2514: '大小單雙',
  },
};

export default PlayMenu;
