const PlayMenu = {
  playId: {
    // Thai
    2056: '上正', // 直选
    2058: '上反', // 组选
    2061: '上正', // 直选
    2063: '上反', // 组选

    2065: '直選加開', // 直选加开
    2068: '後三不定位', // 后三不定位
    2055: '三數', // 三数
    2057: '上正三位數', // 上正三位数
    2059: '上反三位數', // 上反三位数
    2643: '二等', // 三数 二等
    2644: '二特', // 三数 二特
    2645: '二等三位數', // 二等三位数
    2646: '二特三位數', // 二特三位数
    // VTX
    2675: '越式大小',
    2676: '大小',

    2060: '二數', // 二数
    2062: '上正二位數', // 上正二位数
    2064: '上反二位數', // 上反二位数
    2066: '下正二位數', // 下正二位数
    2067: '跑數', // 跑数
    2069: '上跑三位數', // 上跑三位数
    2297: '魚蝦蟹', // 魚蝦蟹
    2298: '魚蝦蟹', // 魚蝦蟹
    2299: '魚蝦蟹', // 魚蝦蟹
    2497: '番攤', // 番摊
    2498: '番',
    2499: '番',
    2500: '角',
    2501: '角',
    2502: '念',
    2503: '念',
    2504: '大小單雙',
    2505: '大小單雙',

    2480: '下正二位數（包注）',
    2481: '下正二位數（輸入）',
    2482: '上反二位數（包注）',
    2483: '上正二位數（包注）',
    2484: '上正二位數（輸入）',
    2485: '上正三位數（包注）',
    2486: '上正三位數（輸入）',
    2487: '上反三位數（包注）',

    // vnc 越南彩

    // 一級選單

    2090: '四數', // 四数
    2095: '三數', // 三数
    2100: '二數', // 二数
    2105: '跑數', // 跑数

    2515: '包膽', // 包膽 北部
    2528: '包膽', // 包膽 中南部

    2550: '自選不中', // 北部 逆向 - 一級選單
    2560: '自選不中', // 中南部 逆向 - 一級選單

    2598: '過關', // 北部 串组 - 一級選單
    2608: '過關', // 中南部 串组 - 一級選單

    2300: '魚蝦蟹', // 魚蝦蟹
    2488: '番攤', // 番摊

    2618: '骰寶快三', // 骰寶快三

    2624: '第1-10名排名', // 极速PK10 - 第1-10名排名
    2627: '冠亞和值', // 极速PK10 - 冠亚和值
    2630: '龍虎鬥', // 极速PK10 - 龙虎斗

    // 二級選單

    2091: '上正', // 四数 上正
    2093: '上反', // 四数 上反
    2096: '上正', // 三数 上正
    2098: '上反', // 三数 上反
    2101: '上正', // 二数 上正
    2103: '下正', // 二数 下正

    2301: '鱼虾蟹', // 魚蝦蟹

    2489: '番', // 番
    2491: '角', // 角
    2493: '念', // 念
    2495: '大小單雙', // 大小单双

    2619: '單骰', // 骰寶快三 - 单骰
    2620: '和值', // 骰寶快三 - 和值
    2621: '圍骰', // 骰寶快三 - 围骰
    2622: '全圍', // 骰寶快三 - 全围
    2623: '大小單雙', // 骰寶快三 - 大小单双

    2625: '第1-10名排名', // 极速PK10 - 第1-10名排名-二級選單
    2626: '第1-10名大小單雙', // 极速PK10 - 第1-10名-大小单双
    2628: '冠亞和值', // 极速PK10 - 冠亚和值-二級選單
    2629: '冠亞和大小單雙', // 极速PK10 - 冠亚和值-大小单双
    2631: '龍虎鬥', // 极速PK10 - 龙虎斗-二級選單

    2516: '后二包膽', // 北部 后二包胆
    2520: '后三包膽', // 北部 后三包胆
    2524: '后四包膽', // 北部 后四包胆

    2551: '四位不中', // 北部 - 四不中 - 二級選單
    2554: '八位不中', // 北部 - 八不中 - 二級選單
    2557: '十位不中', // 北部 - 十不中 - 二級選單

    2599: '過2關', // 北部 - 串2组 - 二級選單
    2602: '過3關', // 北部 - 串3组 - 二級選單
    2605: '過4關', // 北部 - 串4组 - 二級選單

    2584: '二數頭尾', // 北部 - 二数头尾 - 二級選單

    2529: '后二包膽', // 中南部 后二包胆
    2533: '后三包膽', // 中南部 后三包胆
    2537: '后四包膽', // 中南部 后四包胆

    2561: '四位不中', // 中南部 - 四不中 - 二級選單
    2564: '八位不中', // 中南部 - 八不中 - 二級選單
    2567: '十位不中', // 中南部 - 十不中 - 二級選單

    2609: '過2關', // 中南部 - 串2组 - 二級選單
    2612: '過3關', // 中南部 - 串3组 - 二級選單
    2615: '過4關', // 中南部 - 串4组 - 二級選單

    2591: '二數頭尾', // 中南部 - 二数头尾 - 二級選單

    // 跑數二級選單目前不會使用到
    2106: '一等二星不定位', // 跑數二級選單
    2108: '二等二星不定位', // 跑數二級選單

    2579: '特等二星不定位', // 特等一等 - 十位個位 - 跑數 - 二級選單

    // 以下在東南亞彩是屬於三級選單直選，在越南彩才是屬於二級選單
    2517: '後二包膽', // 北部 后二包胆
    2521: '後三包膽', // 北部 后三包胆
    2525: '後四包膽', // 北部 后四包胆
    2530: '後二包膽', // 中南部 后二包胆
    2534: '後三包膽', // 中南部 后三包胆
    2538: '後四包膽', // 中南部 后四包胆

    2641: '後二包膽1K', // 北部 后二包胆 1K
    2642: '後二包膽1K', // 中南部 后二包胆 1K

    2092: '上正四位數', // 上正四位数 Last_4_Straight_1st_VNC
    2094: '上反四位數', // 上反四位数 Last_4_Combine_1st_VNC
    2097: '上正三位數', // 上正三位数 Last_3_Straight_1st_VNC
    2099: '上反三位數', // 上反三位数 Last_3_Combine_1st_VNC
    2102: '上正二位數', // 上正二位数 Last_2_Straight_1st_VNC
    2104: '下正二位數', // 下正二位数 Last_2_Straight_2nd_VNC
    2107: '上跑兩位數', // 上跑两位数 Last_2_Any_1st_VNC
    2109: '下跑兩位數', // 下跑两位数 Last_2_Any_2nd_VNC

    2601: '過2關', // 北部 串2组 Bunch_2_North_VNC
    2604: '過3關', // 北部 串3组 Bunch_3_North_VNC
    2607: '過4關', // 北部 串4组 Bunch_4_North_VNC
    2611: '過2關', // 中南部 串2组 Bunch_2_South_VNC
    2614: '過3關', // 中南部 串3组 Bunch_3_South_VNC
    2617: '過4關', // 中南部 串4组 Bunch_4_South_VNC

    2552: '任四不中 ', // 北部 - 四不中
    2555: '任八不中 ', // 北部 - 八不中
    2558: '任十不中 ', // 北部 - 十不中
    2562: '任四不中', // 中南部 - 四不中
    2565: '任八不中', // 中南部 - 八不中
    2568: '任十不中', // 中南部 - 十不中

    2586: '二數頭尾', // 北部 二数头尾 Last_2_1st_7th_North_VNC
    2589: '二數頭', // 北部 二数头 Last_2_7th_North_VNC
    2593: '二數頭尾', // 中南部 二数头尾 Last_2_1st_8th_South_VNC
    2596: '二數頭', // 中南部 二数头 Last_2_8th_South_VNC

    2580: '特等十位', // 特等十位 Ten_Digit_1st_VNC
    2581: '特等個位', // 特等个位 Unit_Digit_1st_VNC
    2582: '一等十位', // 一等十位 Ten_Digit_2nd_VNC
    2583: '一等個位', // 一等个位 Unit_Digit_2nd_VNC

    2302: '魚蝦蟹', // 魚蝦蟹

    2490: '番', // 番
    2492: '角', // 角
    2494: '念', // 念
    2496: '大小單雙', // 大小单双

    // 三級選單

    // 北部
    2518: '後二包膽(包注)', // 北部 后二包胆(复式)
    2519: '後二包膽(輸入)', // 北部 后二包胆(单式)
    2522: '後三包膽(包注)', // 北部 后三包胆（复式）
    2523: '後三包膽(輸入)', // 北部 后三包胆（单式）
    2526: '後四包膽(包注)', // 北部 后四包胆（复式）
    2527: '後四包膽(輸入)', // 北部 后四包胆（单式)

    2553: '任四不中（輸入）', // 北部 - 四不中(单式) - 三級選單
    2556: '任八不中（輸入）', // 北部 - 八不中(单式) - 三級選單
    2559: '任十不中（輸入）', // 北部 - 十不中(单式) - 三級選單

    2587: '二數頭尾（包注）', // 北部 二数头尾（复式) Last_2_1st_7th_North_VNC_Multi
    2590: '二數頭（包注）', // 北部 二数头（复式) Last_2_7th_North_VNC_Multi

    // 中南部
    2531: '後二包膽(包注)', // 中南部 后二包胆(复式)
    2532: '後二包膽(輸入)', // 中南部 后二包胆(单式)
    2535: '後三包膽(包注)', // 中南部 后三包胆（复式）
    2536: '後三包膽(輸入)', // 中南部 后三包胆（单式）
    2539: '後四包膽(包注)', // 中南部 后四包胆（复式）
    2540: '後四包膽(輸入)', // 中南部 后四包胆（单式)

    2563: '任四不中（輸入)', // 中南部 - 四不中(单式) - 三級選單
    2566: '任八不中（輸入)', // 中南部 - 八不中(单式) - 三級選單
    2569: '任十不中（輸入)', // 中南部 - 十不中(单式) - 三級選單

    2594: '二數頭尾（包注）', // 中南部 二数头尾（复式) Last_2_1st_8th_South_VNC_Multi
    2597: '二數頭（包注）', // 中南部 二数头(复式) Last_2_8th_South_VNC_Multi

    // 以下不分南北部
    2286: '上正四位數（包注）', // 上正四位数（复式）Last_4_Straight_1st_VNC_Multi
    2287: '上正四位數（輸入）', // 上正四位数（单式）Last_4_Straight_1st_VNC_Single

    2284: '上正三位數（包注）', // 上正三位数（复式）Last_3_Straight_1st_VNC_Multi
    2285: '上正三位數（輸入）', // 上正三位数（单式）Last_3_Straight_1st_VNC_Single
    2283: '上反三位數（包注）', // 上反三位数（复式）Last_3_Combine_1st_VNC_Multi

    2279: '上正二位數（包注）', // 上正二位数(复式) Last_2_Straight_1st_VNC_Multi
    2280: '上正二位數（輸入）', // 上正二位数（单式）Last_2_Straight_1st_VNC_Single
    2281: '下正二位數（包注）', // 下正二位数（复式）Last_2_Straight_2nd_VNC_Multi
    2282: '下正二位數（輸入）', // 下正二位数（单式）Last_2_Straight_2nd_VNC_Single

    // LAO 老挝彩
    2127: '四數', // 四数
    2132: '三數', // 三数
    2137: '二數', // 二数
    2142: '跑數', // 跑数

    2128: '上正', // 上正
    2130: '上反', // 上反
    2133: '上正', // 上正
    2135: '上反', // 上反
    2138: '上正', // 上正
    2140: '下正', // 下正

    2129: '上正四位數', // 上正四位数 Last_4_Straight_LAO
    2131: '上反四位數', // 上反四位数 Last_4_Combine_LAO
    2134: '上正三位數', // 上正三位数 Last_3_Straight_LAO
    2136: '上反三位數', // 上反三位数 Last_3_Combine_LAO
    2139: '上正二位數', // 上正二位数 Last_2_Straight_LAO
    2141: '下正二位數', // 下正二位数 First_2_Straight_LAO
    2144: '上跑兩位數', // 上跑两位数 Last_2_Any_LAO
    2146: '下跑兩位數', // 下跑两位数 First_2_Any_LAO

    2632: '一數', // SEA 4D 一数 Fixed_Place_4D
    2633: '一數 (個位)', // SEA 4D 一数 (個位) Fixed_Place_4D_Unit
    2634: '一數 (十位)', // SEA 4D 一数 (十位) Fixed_Place_4D_Ten
    2635: '一數 (百位)', // SEA 4D 一数 (百位) Fixed_Place_4D_hundred
    2636: '一數 (千位)', // SEA 4D 一数 (千位) Fixed_Place_4D_Thousand

    263700: '一數', // VNC 4D 一数 Fixed_Place_4D_VNC
    2637: '一數 (個位)', // VNC 4D 一数 (個位) Fixed_Place_4D_Unit_VNC
    2638: '一數 (十位)', // VNC 4D 一数 (十位) Fixed_Place_4D_Ten_VNC
    2639: '一數 (百位)', // VNC 4D 一数 (百位) Fixed_Place_4D_hundred_VNC
    2640: '一數 (千位)', // VNC 4D 一数 (千位) Fixed_Place_4D_Thousand_VNC

    2288: '上正二位数（包注）', // Last_2_Straight_LAO_Multi
    2289: '上正二位数（輸入）', // Last_2_Straight_LAO_Single
    2290: '下正二位数（包注）', // First_2_Straight_LAO_Multi
    2291: '下正二位数（輸入）', // First_2_Straight_LAO_Single
    2292: '上反三位数（包注）', // Last_3_Combine_LAO_Multi
    2293: '上正三位数（包注）', // Last_3_Straight_LAO_Multi
    2294: '上正三位数（輸入）', // Last_3_Straight_LAO_Single
    2295: '上正四位数（包注）', // Last_4_Straight_LAO_Multi
    2296: '上正四位数（輸入）', // Last_4_Straight_LAO_Single

    2303: '魚蝦蟹', // 魚蝦蟹
    2304: '魚蝦蟹', // 魚蝦蟹
    2305: '魚蝦蟹', // 魚蝦蟹
    2506: '番攤', // 番摊
    2507: '番',
    2508: '番',
    2509: '角',
    2510: '角',
    2511: '念',
    2512: '念',
    2513: '大小單雙',
    2514: '大小單雙',

    // Keno

    // 一級選單

    2647: '任選', // 任選 - 一級選單 Any_KENO 
    2656: '趣味', // 趣味 - 一級選單 Fun_KENO

    // 二級選單

    2648: '任選', // 任選 - 二級選單 Any_L2_KENO
    2657: '總和大小', // 趣味 - 總和大小 Total_Sum_BST_KENO
    2658: '總和單雙', // 趣味 - 總和單雙 Total_Sum_OE_KENO
    2659: '總和過關', // 趣味 - 總和過關 Total_Sum_PASS_KENO
    2660: '上下盤', // 趣味 - 上下盤 UpDown_KENO
    2661: '奇偶盤', // 趣味 - 奇偶盤 OddEven_KENO
    2662: '五行', // 趣味 - 五行 WuXing_KENO

    // 三級選單

    2649: '任選一', // 任選一 Any1_KENO
    2650: '任選二', // 任選二 Any2_KENO
    2651: '任選三', // 任選三 Any3_KENO
    2652: '任選四', // 任選四 Any4_KENO
    2653: '任選五', // 任選五 Any5_KENO
    2654: '任選六', // 任選六 Any6_KENO
    2655: '任選七', // 任選七 Any7_KENO
  },
};

export default PlayMenu;
