import entertainmentPlayMenu from './play-ent';
import { lhcPlayId, lhcBothSideRank, lhcPlayKey } from './play-lhc';
import { sscBothSideRank } from './play-ssc';
import { pcbBothSideRank } from './play-pcb';
import { k3BothSideRank } from './play-k3';
import playRemark from './playRemark';

const PlayMenu = {
  playId: {
    1: '定位膽',
    2: '後二',
    3: '後三',
    4: '後四',
    5: '五星',
    6: '前二',
    7: '前三',
    8: '前四',
    9: '中三',
    10: '任選',
    11: '趣味',
    12: '不定位',
    13: '一星直選',
    14: '定位膽 ',
    15: '後二直選',
    16: '後二組選',
    17: '後二分位',
    18: '後二包點',
    19: '後二連選',
    20: '後二和值',
    21: '後三直選',
    22: '後三包點',
    23: '後三組三',
    24: '後三組六',
    25: '後三混合組選',
    26: '後三連選',
    27: '後三直選組合',
    28: '後三和值',
    29: '後四直選',
    30: '後四連選',
    31: '五星直選',
    32: '五星通選',
    33: '五星連選',
    34: '前二直選',
    35: '前二組選',
    36: '前二分位',
    37: '前二包點',
    38: '前二連選',
    39: '前二和值',
    40: '前三直選',
    41: '前三包點',
    42: '前三組三',
    43: '前三組六',
    44: '前三混合組選',
    45: '前三連選',
    46: '前三直選組合',
    47: '前三和值',
    48: '前四直選',
    49: '前四連選',
    50: '中三直選',
    51: '中三包點',
    52: '中三組三',
    53: '中三組六',
    54: '中三混合組選',
    55: '中三連選',
    56: '中三直選組合',
    57: '中三和值',
    58: '任一直選',
    59: '任二直選',
    60: '任三直選',
    61: '任四直選',
    62: '前二大小單雙',
    63: '後二大小單雙',
    64: '不定位前二組選',
    65: '不定位前二直選',
    66: '不定位前三組選一膽',
    67: '不定位前三組選二碼',
    68: '不定位前三直選一碼',
    69: '不定位前三直選二碼',
    70: '不定位後二組選',
    71: '不定位後二直選',
    72: '不定位後三組選一膽',
    73: '不定位後三組選二碼',
    74: '不定位後三直選一碼',
    75: '不定位後三直選二碼',
    76: '不定位中三組選一膽',
    77: '不定位中三組選二碼',
    78: '不定位中三直選一碼',
    79: '不定位中三直選二碼',
    80: '五星直選（單式）',
    81: '五星通選（單式）',
    82: '五星連選（單式）',
    83: '前四直選（單式）',
    84: '前四連選（單式）',
    85: '後四直選（單式）',
    86: '後四連選（單式）',
    87: '前三直選（單式）',
    88: '前三連選（單式）',
    89: '中三直選（單式）',
    90: '中三連選（單式）',
    91: '後三直選（單式）',
    92: '後三連選（單式）',
    93: '前二直選（單式）',
    94: '前二連選（單式）',
    95: '後二直選（單式）',
    96: '後二連選（單式）',
    97: '任二直選（單式）',
    98: '任三直選（單式）',
    99: '任四直選（單式）',
    100: '任二直選（單式）',
    101: '任三直選（單式）',
    102: '任四直選（單式）',
    103: '任五直選（單式）',
    104: '任六直選（單式）',
    105: '任七直選（單式）',
    106: '任八直選（單式）',
    107: '前三直選（單式）',
    108: '前三組選（單式）',
    109: '前二直選（單式）',
    110: '前二組選（單式）',
    111: '三星直選（單式）',
    112: '前二直選（單式）',
    113: '後二直選（單式）',
    114: 'P3直選（單式）',
    115: '前二直選（單式）',
    116: 'P3後二直選（單式）',
    117: '直選',
    118: '組選',
    119: '直選',
    120: '組選',
    121: '直選',
    122: '組選',
    123: '直選',
    124: '組選',
    125: '直選',
    126: '組選',
    127: '直選',
    128: '組選',
    129: '直選',
    130: '組選',
    131: '直選',
    132: '組選',
    133: '定位膽',
    134: '直選',
    135: '組選',
    136: '大小單雙',
    137: '直選',
    138: '複式',
    139: '單式',
    140: '定單雙',
    141: '猜中位',
    142: '直選',
    143: '組選',
    144: '直選',
    145: '組選',
    146: '不定位膽',
    147: '定位膽',
    148: '三星',
    149: '組選',
    150: '直選',
    151: '組選',
    152: '直選',
    153: '組選',
    154: '不定位膽',
    155: '大小單雙',
    156: '定位膽',
    157: '直選',
    158: '組選',
    159: '不定位膽',
    160: '直選',
    161: '組選',
    162: '直選',
    163: '組選',
    164: '大小單雙',
    165: '定位膽',
    166: 'P5後二直選（單式）',
    168: '特殊',
    169: '一帆風順',
    170: '好事成雙',
    171: '三星報喜',
    172: '四季發財',
    173: '組選',
    174: '任四組選24',
    175: '任四組選12',
    176: '任四組選6',
    177: '任四組選4',
    178: '任三組选和值',
    179: '任三組三',
    180: '任三組六',
    181: '任三混合組選',
    182: '任二組选和值',
    183: '任二組選',
    184: '任二組選（單式）',
    901: '任選',
    902: '定單雙',
    903: '猜中位',
    904: '前三',
    905: '前二',
    906: '不定位',
    907: '定位膽',
    908: '任一直選',
    909: '任二直選',
    910: '任三直選',
    911: '任四直選',
    912: '任五直選',
    913: '任六直選',
    914: '任七直選',
    915: '任八直選',
    916: '定單雙',
    917: '猜中位',
    918: '前三直選',
    919: '前三組選',
    920: '前二直選',
    921: '前二組選',
    922: '前三不定位',
    923: '定位膽',
    1401: '直選',
    1403: '不定位',
    1404: '前二',
    1405: '後二',
    1406: '大小單雙',
    1407: '定位膽',
    1408: '三星直選',
    1409: '三星直选和值',
    1410: '三星組三',
    1411: '三星組六',
    1412: '三星混合組選',
    1413: '三星組选和值',
    1414: '一碼不定位',
    1415: '二碼不定位',
    1416: '前二直選',
    1417: '前二組選',
    1418: '後二直選',
    1419: '後二組選',
    1420: '前二大小單雙',
    1421: '後二大小單雙',
    1422: '定位膽',
    1423: '前三',
    1425: '前三不定位',
    1426: '前二',
    1427: '後二',
    1428: '大小單雙',
    1429: '定位膽',
    1430: 'P3直選',
    1431: 'P3直选和值',
    1432: 'P3組三',
    1433: 'P3組六',
    1434: 'P3混合組選',
    1435: 'P3組选和值',
    1436: 'P3一碼不定位',
    1437: 'P3二碼不定位',
    1438: '前二直選',
    1439: '前二組選',
    1440: 'P3後二直選',
    1441: 'P3後二組選',
    1442: 'P5後二直選',
    1443: 'P5後二組選',
    1444: '前二大小單雙',
    1445: 'P3後二大小單雙',
    1446: 'P5後二大小單雙',
    1447: '定位膽',
    1448: '猜前一',
    1449: '猜前二',
    1450: '猜前三',
    1451: '猜前四',
    1452: '猜前五',
    1453: '定位膽',
    1454: '猜和值',
    1455: '大小單雙',
    1456: '龍虎鬥',
    1457: '猜前一',
    1458: '猜前二',
    1459: '猜前三',
    1460: '猜前四',
    1461: '猜前五',
    1462: '前五定位膽',
    1463: '後五定位膽',
    1464: '冠亞和值',
    1465: '冠亞季和值',
    1466: '首尾和值',
    1467: '前五大小單雙',
    1468: '後五大小單雙',
    1469: '冠亞和大小單雙',
    1470: '第一名VS第十名',
    1471: '第二名VS第九名',
    1472: '第三名VS第八名',
    1473: '第四名VS第七名',
    1474: '第五名VS第六名',
    1601: '五星組選120',
    1602: '五星組選60',
    1603: '五星組選30',
    1604: '五星組選20',
    1605: '五星組選10',
    1606: '五星組選5',
    1607: '前四組選24',
    1608: '前四組選12',
    1609: '前四組選6',
    1610: '前四組選4',
    1611: '後四組選24',
    1612: '後四組選12',
    1613: '後四組選6',
    1614: '後四組選4',

    // 20170522 add by G
    1732: '猜前二（單式）',
    1733: '猜前三（單式）',
    1734: '猜前四（單式）',
    1735: '猜前五（單式）',

    1736: '龍虎和',
    1737: '趣味',
    1738: '龍虎和-萬千',
    1739: '龍虎和-萬百',
    1740: '龍虎和-萬十',
    1741: '龍虎和-萬個',
    1742: '龍虎和-千百',
    1743: '龍虎和-千十',
    1744: '龍虎和-千個',
    1745: '龍虎和-百十',
    1746: '龍虎和-百個',
    1747: '龍虎和-十個',

    2663: '新龍虎',
    2664: '趣味',
    2665: '新龍虎-萬千',
    2666: '新龍虎-萬百',
    2667: '新龍虎-萬十',
    2668: '新龍虎-萬個',
    2669: '新龍虎-千百',
    2670: '新龍虎-千十',
    2671: '新龍虎-千個',
    2672: '新龍虎-百十',
    2673: '新龍虎-百個',
    2674: '新龍虎-十個',

    // 20170607 不定位新增玩法
    1748: '不定位後四直選一碼',
    1749: '不定位後四直選二碼',
    1750: '不定位五星直選一碼',
    1751: '不定位五星直選二碼',
    1752: '不定位五星直選三碼',

    // 20180904 不定位新增組選玩法
    2029: '不定位五星組選二膽',
    2030: '不定位五星組選三膽',

    // 20230309 體彩P3P5新增 五星 前四 後四玩法
    2877: '五星',
    2878: '直選',
    2879: '五星直選',
    2880: '五星直選(單式)',
    2881: '前四',
    2882: '直選',
    2883: 'P5前四直選',
    2884: 'P5前四直選(單式)',
    2885: '後四',
    2886: '直選',
    2887: 'P5後四直選',
    2888: 'P5後四直選(單式)',

    // 娛樂城 快捷
    99999: '快捷',

    // 娛樂城 Menu
    1753: '整合',
    1754: '第一球',
    1764: '第二球',
    1774: '第三球',
    1784: '第四球',
    1794: '第五球',
    1828: '兩面盤',
    1841: '龍虎鬥',
    1853: '全五中一',

    // 娛樂城 play
    // 娛樂城整合
    1805: '第一球:直選',
    1806: '第一球:大小單雙',
    1808: '第二球:直選',
    1809: '第二球:大小單雙',
    1811: '第三球:直選',
    1812: '第三球:大小單雙',
    1814: '第四球:直選',
    1815: '第四球:大小單雙',
    1817: '第五球:直選',
    1818: '第五球:大小單雙',
    1826: '總大小單雙',
    1820: '前三',
    1822: '中三',
    1824: '後三',


    1843: '第一球vs第二球',
    1844: '第一球vs第三球',
    1845: '第一球vs第四球',
    1827: '第一球vs第五球',
    1847: '第二球vs第三球',
    1848: '第二球vs第四球',
    1849: '第二球vs第五球',
    1850: '第三球vs第四球',
    1851: '第三球vs第五球',
    1852: '第四球vs第五球',
    1855: '全五中一:直選',


    // 娛樂城 PK10 menu
    1856: '兩面',
    1884: '猜和值',
    1885: '冠亞和值',
    1886: '冠亞季和值',
    1887: '首尾和值',
    1888: '第1-10名',
    1899: '龍虎鬥',

    // 娛樂城 PK10 玩法
    1858: '冠亞和:大小單雙',
    1860: '冠軍:大小單雙',
    1861: '冠軍vs第十名',
    1863: '亞軍:大小單雙',
    1864: '亞軍vs第九名',
    1866: '季軍:大小單雙',
    1867: '季軍vs第八名',
    1869: '第四名:大小單雙',
    1870: '第四名vs第七名',
    1872: '第五名:大小單雙',
    1873: '第五名vs第六名',
    1875: '第六名:大小單雙',
    1877: '第七名:大小單雙',
    1879: '第八名:大小單雙',
    1881: '第九名:大小單雙',
    1883: '第十名:大小單雙',

    1889: '冠軍',
    1890: '亞軍',
    1891: '季軍',
    1892: '第四名',
    1893: '第五名',
    1894: '第六名',
    1895: '第七名',
    1896: '第八名',
    1897: '第九名',
    1898: '第十名',
    9999: '第六-十名',
    1905: '整合',
    1906: '和值',
    1907: '和值',
    1908: '兩面',
    1909: '大小單雙',
    1910: '組合大小單雙',
    2163: '大小單雙',
    2164: '組合大小單雙',
    2165: '大小單雙',
    2166: '組合大小單雙',
    2167: '大小單雙',
    2168: '組合大小單雙',
    1911: '極值',
    1912: '趣味',
    1913: '色波',
    1914: '豹子',
    1915: '特碼包三',

    1916: '和值',
    1917: '和值',
    1918: '三同號',
    1919: '三同號單選',
    1920: '三同號通選',
    1921: '三不同號',
    1922: '三不同號',
    1923: '三連號',
    1924: '三連號通選',
    1925: '二同號',
    1926: '二同號單選',
    1927: '二同號複選',
    1928: '二不同號',
    1929: '二不同號',
    1930: '趣味',
    1931: '和值大小單雙',
    2236: '和值組合大小單雙',
    2239: '單挑一骰',
    2271: '梭哈',
    2272: '豹子',
    2273: '全順',
    2274: '對子',
    2275: '半順',
    2276: '雜三',
    2277: '二同號通選',
    2278: '三不同號通選',

    1932: '整合',
    1933: '和值',
    1934: '和值',
    1935: '和值大小單雙',
    1936: '和值大小單雙',
    2237: '和值組合大小單雙',
    2238: '和值組合大小單雙',
    2240: '猜必出',
    2241: '猜必不出',
    1937: '兩連',
    1938: '兩連',
    1939: '獨膽',
    1940: '獨膽',
    1941: '豹子',
    1942: '豹子',
    1943: '豹子',
    1944: '對子',
    1945: '對子',
    2242: '不出膽',
    2243: '不出膽',

    // 娛樂城 PK10 番攤
    2541: '番攤',
    2542: '番',
    2543: '番攤-番',
    2544: '角',
    2545: '番攤-角',
    2546: '念',
    2547: '番攤-念',
    2548: '大小單雙',
    2549: '番攤-大小單雙',

    // 11x5 ENT
    1946: '兩面',
    1948: '總和',
    1950: '第一球:大小單雙',
    1952: '第二球:大小單雙',
    1954: '第三球:大小單雙',
    1956: '第四球:大小單雙',
    1958: '第五球:大小單雙',
    1959: '第一球',
    1961: '第一球',
    1964: '第二球',
    1966: '第二球',
    1969: '第三球',
    1971: '第三球',
    1974: '第四球',
    1976: '第四球',
    1979: '第五球',
    1981: '第五球',
    1984: '任選',
    1986: '一中一',
    1987: '二中二',
    1988: '三中三',
    1989: '四中四',
    1990: '五中五',
    1991: '六中五',
    1992: '七中五',
    1993: '八中五',
    1994: '組選',
    1996: '前二組選 (娛樂)',
    1997: '前三組選 (娛樂)',
    1998: '直選',
    2000: '前二直選 (娛樂)',
    2001: '前三直選 (娛樂)',
    2002: '龍虎鬥',
    2004: '第一球vs第二球',
    2005: '第一球vs第三球',
    2006: '第一球vs第四球',
    2007: '第一球vs第五球',
    2008: '第二球vs第三球',
    2009: '第二球vs第四球',
    2010: '第二球vs第五球',
    2011: '第三球vs第四球',
    2012: '第三球vs第五球',
    2013: '第四球vs第五球',
    ...lhcPlayId,

    2014: '定位膽',
    2015: '定位膽', // （千百十個）
    2016: '定位膽', // （百十個）
    2017: '定位膽', // （十個）
    2018: '定位膽', // （個）

    2019: '牛牛',
    2021: '牛牛牌型',
    2023: '牛牛有牛無牛',
    2025: '牛牛大小單雙',
    2026: '梭哈',
    2028: '梭哈牌型',

    // 五星 和值大小單雙
    2070: '和值',
    2071: '和值大小單雙',
    2072: '和值組合大小單雙',

    // ENT K3 豹子通殺特仕版
    // 前台不會把豹子通殺秀出來, 看起來跟原本的玩法只有賠率差異
    2053: '和值',
    2054: '和值-大小單雙',

    // VTX
    2675: '越式大小',
    2676: '大小',

    // VXD
    2677: '色碟',
    2678: '大小',
    2679: '單雙',
    2680: '全紅',
    2681: '全白',
    2682: '3白+1紅',
    2683: '3紅+1白',

    // VBC 魚蝦蟹
    2733: '魚蝦蟹',
    2734: '魚蝦蟹',

    // CLR
    3058: 'Color',
    3059: 'Color',

    // SEA SEA V2 TL(天龍)

    // 一級選單

    // TL2D
    2735: '一星', // SEA TL2D 一星
    2741: '二星', // SEA TL2D 二星
    2746: '趣味', // SEA TL2D 趣味

    // TL3D

    2684: '二星', // SEA TL3D 二数
    2689: '三星', // SEA TL3D 三数
    2694: '一星', // SEA TL3D 跑数
    2750: '趣味', // SEA TL3D 趣味

    // TL4D

    2697: '二星', // SEA TL4D 二数
    2702: '三星', // SEA TL4D 三数
    2707: '四星', // SEA TL4D 四数
    2712: '一星', // SEA TL4D 跑数
    2755: '趣味', // SEA TL4D 趣味

    // TL6D

    2715: '二星', // SEA TL6D 二数
    2720: '三星', // SEA TL6D 三数
    2725: '四星', // SEA TL6D 四数
    2730: '一星', // SEA TL6D 跑数
    2761: '趣味', // SEA TL6D 趣味

    // TL642

    2894: '3 Digits', // SEA TL642 Lucky Pick
    2901: '2 Digits', // SEA TL642 3D
    2908: '1 Digit', // SEA TL642 2D
    3034: '幸運', // SEA TL642 1D

    // TL645

    2918: '幸運', // SEA TL645 Lucky Pick
    2923: '3 Digits', // SEA TL645 3D
    2930: '2 Digits', // SEA TL645 2D
    2937: '1 Digit', // SEA TL645 1D

    // TL649

    2947: '幸運', // SEA TL649 Lucky Pick
    2952: '3 Digits', // SEA TL649 3D
    2959: '2 Digits', // SEA TL649 2D
    2966: '1 Digit', // SEA TL649 1D

    // TL655

    2976: '幸運', // SEA TL655 Lucky Pick
    2981: '3 Digits', // SEA TL655 3D
    2988: '2 Digits', // SEA TL655 2D
    2995: '1 Digit', // SEA TL655 1D

    // TL658

    3005: '幸運', // SEA TL658 Lucky Pick
    3010: '3 Digits', // SEA TL658 3D
    3017: '2 Digits', // SEA TL658 2D
    3024: '1 Digit', // SEA TL658 1D

    // TL2D37

    3039: '一星', // SEA TL2D37 一星
    3045: '二星', // SEA TL2D37 二星
    3050: '趣味', // SEA TL2D37 趣味

    // 二級選單

    // TL2D

    2736: '一數', // SEA TL2D 定位胆
    2739: '任選', // SEA TL2D 任选
    2742: '直選', // SEA TL2D 二星直选
    2744: '組選', // SEA TL2D 二星组选
    2747: '兩面', // SEA TL2D 大小单双

    // TL3D

    2685: '直選', // SEA TL3D 后二直选
    2687: '組選', // SEA TL3D 后二组选
    2690: '直選', // SEA TL3D 后三直选
    2692: '組選', // SEA TL3D 后三组选
    2695: '後二不定位一碼', // SEA TL3D 后二不定位
    2751: '兩面', // SEA TL3D 大小单双
    2776: '一數', // SEA TL3D 定位胆

    // TL4D

    2698: '直選', // SEA TL4D 后二直选
    2700: '組選', // SEA TL4D 后二组选
    2703: '直選', // SEA TL4D 后三直选
    2705: '組選', // SEA TL4D 后三组选
    2708: '直選', // SEA TL4D 后四直选
    2710: '組選', // SEA TL4D 后四组选
    2713: '後二不定位一碼', // SEA TL4D 后二不定位
    2756: '兩面', // SEA TL4D 大小单双
    2780: '一數', // SEA TL4D 定位胆

    // TL6D

    2716: '直選', // SEA TL6D 后二直选
    2718: '組選', // SEA TL6D 后二组选
    2721: '直選', // SEA TL6D 后三直选
    2723: '組選', // SEA TL6D 后三组选
    2726: '直選', // SEA TL6D 后四直选
    2728: '組選', // SEA TL6D 后四组选
    2731: '後二不定位一碼', // SEA TL6D 后二不定位
    2762: '兩面', // SEA TL6D 大小单双
    2785: '一數', // SEA TL6D 定位胆

    // TL642

    2895: '直選', // SEA TL642 Lucky Pick 3
    2898: '組選', // SEA TL642 Lucky Pick 12
    2902: '直選', // SEA TL642 Straight
    2905: '組選', // SEA TL642 Any
    2909: '定位膽', // SEA TL642 Straight
    2916: '任選', // SEA TL642 Any
    3035: '幸運3', // SEA TL642 Fixed Position
    3037: '幸運12', // SEA TL642 Any

    // TL645

    2919: '幸運3', // SEA TL645 Lucky Pick 3
    2921: '幸運12', // SEA TL645 Lucky Pick 12
    2924: '直選', // SEA TL645 Straight
    2927: '組選', // SEA TL645 Any
    2931: '直選', // SEA TL645 Straight
    2934: '組選', // SEA TL645 Any
    2938: '定位膽', // SEA TL645 Fixed Position
    2945: '任選', // SEA TL645 Any

    // TL649

    2948: '幸運3', // SEA TL649 Lucky Pick 3
    2950: '幸運12', // SEA TL649 Lucky Pick 12
    2953: '直選', // SEA TL649 Straight
    2956: '組選', // SEA TL649 Any
    2960: '直選', // SEA TL649 Straight
    2963: '組選', // SEA TL649 Any
    2967: '定位膽', // SEA TL649 Fixed Position
    2974: '任選', // SEA TL649 Any

    // TL655

    2977: '幸運3', // SEA TL655 Lucky Pick 3
    2979: '幸運12', // SEA TL655 Lucky Pick 12
    2982: '直選', // SEA TL655 Straight
    2985: '組選', // SEA TL655 Any
    2989: '直選', // SEA TL655 Straight
    2992: '組選', // SEA TL655 Any
    2996: '定位膽', // SEA TL655 Fixed Position
    3003: '任選', // SEA TL655 Any

    // TL658

    3006: '幸運3', // SEA TL658 Lucky Pick 3
    3008: '幸運12', // SEA TL658 Lucky Pick 12
    3011: '直選', // SEA TL658 Straight
    3014: '組選', // SEA TL658 Any
    3018: '直選', // SEA TL658 Straight
    3021: '組選', // SEA TL658 Any
    3025: '定位膽', // SEA TL658 Fixed Position
    3032: '任選', // SEA TL658 Any

    // TL2D37

    3040: '一數', // SEA TL2D37 定位胆
    3043: '任選', // SEA TL2D37 任选
    3046: '直選', // SEA TL2D37 二星直选
    3048: '組選', // SEA TL2D37 二星组选
    3051: '兩面', // SEA TL2D37 大小单双

    // 三級選單

    // TL2D

    2737: '一數 1st', // SEA TL2D 第一球
    2738: '一數 2nd', // SEA TL2D 第二球
    2740: '任選', // SEA TL2D 任选一
    2743: '二星直選', // SEA TL2D 二星直选
    2745: '二星組選', // SEA TL2D 二星组选
    2748: '兩面 1st', // SEA TL2D 第一球
    2749: '兩面 2nd', // SEA TL2D 第二球

    // TL3D

    2686: '後二直選', // SEA TL3D 上正二位数
    2688: '後二組選', // SEA TL3D 上反二位数
    2691: '三星直選', // SEA TL3D 上正三位数
    2693: '三星組選', // SEA TL3D 上反三位数
    2696: '後二不定位一碼', // SEA TL3D 上跑两位数
    2752: '兩面 1st', // SEA TL3D 第一球
    2753: '兩面 2nd', // SEA TL3D 第二球
    2754: '兩面 3rd', // SEA TL3D 第三球
    2777: '一數 1st', // SEA TL3D 第一位
    2778: '一數 2nd', // SEA TL3D 第二位
    2779: '一數 3rd', // SEA TL3D 第三位
    2863: '三星组三', // SEA TL3D 三星組3
    2864: '三星组六', // SEA TL3D 三星組6

    // TL4D

    2699: '後二直選', // SEA TL4D 上正二位数
    2701: '後二組選', // SEA TL4D 上反二位数
    2704: '後三直選', // SEA TL4D 上正三位数
    2706: '後三組選', // SEA TL4D 上反三位数
    2709: '四星直選', // SEA TL4D 上正四位数
    2711: '四星組選', // SEA TL4D 上反四位数
    2714: '後二不定位一碼', // SEA TL4D 上跑两位数
    2757: '兩面 1st', // SEA TL4D 第一球
    2758: '兩面 2nd', // SEA TL4D 第二球
    2759: '兩面 3rd', // SEA TL4D 第三球
    2760: '兩面 4th', // SEA TL4D 第四球
    2781: '一數 1st', // SEA TL4D 第一位
    2782: '一數 2nd', // SEA TL4D 第二位
    2783: '一數 3rd', // SEA TL4D 第三位
    2784: '一數 4th', // SEA TL4D 第四位
    2865: '後三组三', // SEA TL4D 三星組3
    2866: '後三组六', // SEA TL4D 三星組6
    2869: '四星組選4', // SEA TL4D 四星組選4
    2870: '四星組選6', // SEA TL4D 四星組選6
    2871: '四星組選12', // SEA TL4D 四星組選12
    2872: '四星組選24', // SEA TL4D 四星組選24

    // TL6D

    2717: '後二直選', // SEA TL6D 上正二位数
    2719: '後二組選', // SEA TL6D 上反二位数
    2722: '後三直選', // SEA TL6D 上正三位数
    2724: '後三組選', // SEA TL6D 上反三位数
    2727: '後四直選', // SEA TL6D 上正四位数
    2729: '後四組選', // SEA TL6D 上反四位数
    2732: '後二不定位一碼', // SEA TL6D 上跑两位数
    2763: '兩面 1st', // SEA TL6D 第一球
    2764: '兩面 2nd', // SEA TL6D 第二球
    2765: '兩面 3rd', // SEA TL6D 第三球
    2766: '兩面 4th', // SEA TL6D 第四球
    2767: '兩面 5th', // SEA TL6D 第五球
    2768: '兩面 6th', // SEA TL6D 第六球
    2786: '一數 1st', // SEA TL6D 第一位
    2787: '一數 2nd', // SEA TL6D 第二位
    2788: '一數 3rd', // SEA TL6D 第三位
    2789: '一數 4th', // SEA TL6D 第四位
    2790: '一數 5th', // SEA TL6D 第五位
    2791: '一數 6th', // SEA TL6D 第六位
    2867: '後三组三', // SEA TL6D 三星組3
    2868: '後三组六', // SEA TL6D 三星組6
    2873: '後四組選4', // SEA TL6D 四星組選4
    2874: '後四組選6', // SEA TL6D 四星組選6
    2875: '後四組選12', // SEA TL6D 四星組選12
    2876: '後四組選24', // SEA TL6D 四星組選24

    // TL642

    2896: '前三直選', // SEA TL642 Lucky Pick 3
    2897: '後三直選', // SEA TL642 Lucky Pick 12
    2899: '前三組選', // SEA TL642 First 3 Straight
    2900: '後三組選', // SEA TL642 Last 3 Straight
    2903: '前二直選', // SEA TL642 First 3 Any
    2904: '後二直選', // SEA TL642 Last 3 Any
    2906: '前二組選', // SEA TL642 First 2 Straight
    2907: '後二組選', // SEA TL642 Last 2 Straight
    2910: '定位膽 1st', // SEA TL642 First 2 Any
    2911: '定位膽 2nd', // SEA TL642 Last 2 Any
    2912: '定位膽 3rd', // SEA TL642 1st
    2913: '定位膽 4th', // SEA TL642 2nd
    2914: '定位膽 5th', // SEA TL642 3rd
    2915: '定位膽 6th', // SEA TL642 4th
    2917: '任選', // SEA TL642 5th
    3036: '幸運3', // SEA TL642 6th
    3038: '幸運12', // SEA TL642 Any

    // TL645

    2920: '幸運3', // SEA TL645 Lucky Pick 3
    2922: '幸運12', // SEA TL645 Lucky Pick 12
    2925: '前三直選', // SEA TL645 First 3 Straight
    2926: '後三直選', // SEA TL645 Last 3 Straight
    2928: '前三組選', // SEA TL645 First 3 Any
    2929: '後三組選', // SEA TL645 Last 3 Any
    2932: '前二直選', // SEA TL645 First 2 Straight
    2933: '後二直選', // SEA TL645 Last 2 Straight
    2935: '前二組選', // SEA TL645 First 2 Any
    2936: '後二組選', // SEA TL645 Last 2 Any
    2939: '定位膽 1st', // SEA TL645 1st
    2940: '定位膽 2nd', // SEA TL645 2nd
    2941: '定位膽 3rd', // SEA TL645 3rd
    2942: '定位膽 4th', // SEA TL645 4th
    2943: '定位膽 5th', // SEA TL645 5th
    2944: '定位膽 6th', // SEA TL645 6th
    2946: '任選', // SEA TL645 Any

    // TL649

    2949: '幸運3', // SEA TL649 Lucky Pick 3
    2951: '幸運12', // SEA TL649 Lucky Pick 12
    2954: '前三直選', // SEA TL649 First 3 Straight
    2955: '後三直選', // SEA TL649 Last 3 Straight
    2957: '前三組選', // SEA TL649 First 3 Any
    2958: '後三組選', // SEA TL649 Last 3 Any
    2961: '前二直選', // SEA TL649 First 2 Straight
    2962: '後二直選', // SEA TL649 Last 2 Straight
    2964: '前二組選', // SEA TL649 First 2 Any
    2965: '後二組選', // SEA TL649 Last 2 Any
    2968: '定位膽 1st', // SEA TL649 1st
    2969: '定位膽 2nd', // SEA TL649 2nd
    2970: '定位膽 3rd', // SEA TL649 3rd
    2971: '定位膽 4th', // SEA TL649 4th
    2972: '定位膽 5th', // SEA TL649 5th
    2973: '定位膽 6th', // SEA TL649 6th
    2975: '任選', // SEA TL649 Any

    // TL655

    2978: '幸運3', // SEA TL655 Lucky Pick 3
    2980: '幸運12', // SEA TL655 Lucky Pick 12
    2983: '前三直選', // SEA TL655 First 3 Straight
    2984: '後三直選', // SEA TL655 Last 3 Straight
    2986: '前三組選', // SEA TL655 First 3 Any
    2987: '後三組選', // SEA TL655 Last 3 Any
    2990: '前二直選', // SEA TL655 First 2 Straight
    2991: '後二直選', // SEA TL655 Last 2 Straight
    2993: '前二組選', // SEA TL655 First 2 Any
    2994: '後二組選', // SEA TL655 Last 2 Any
    2997: '定位膽 1st', // SEA TL655 1st
    2998: '定位膽 2nd', // SEA TL655 2nd
    2999: '定位膽 3rd', // SEA TL655 3rd
    3000: '定位膽 4th', // SEA TL655 4th
    3001: '定位膽 5th', // SEA TL655 5th
    3002: '定位膽 6th', // SEA TL655 6th
    3004: '任選', // SEA TL655 Any

    // TL658

    3007: '幸運3', // SEA TL658 Lucky Pick 3
    3009: '幸運12', // SEA TL658 Lucky Pick 12
    3012: '前三直選', // SEA TL658 First 3 Straight
    3013: '後三直選', // SEA TL658 Last 3 Straight
    3015: '前三組選', // SEA TL658 First 3 Any
    3016: '後三組選', // SEA TL658 Last 3 Any
    3019: '前二直選', // SEA TL658 First 2 Straight
    3020: '後二直選', // SEA TL658 Last 2 Straight
    3022: '前二組選', // SEA TL658 First 2 Any
    3023: '後二組選', // SEA TL658 Last 2 Any
    3026: '定位膽 1st', // SEA TL658 1st
    3027: '定位膽 2nd', // SEA TL658 2nd
    3028: '定位膽 3rd', // SEA TL658 3rd
    3029: '定位膽 4th', // SEA TL658 4th
    3030: '定位膽 5th', // SEA TL658 5th
    3031: '定位膽 6th', // SEA TL658 6th
    3033: '任選', // SEA TL658 Any

    // TL2D37

    3041: '一數 1st', // SEA TL2D37 第一球
    3042: '一數 2nd', // SEA TL2D37 第二球
    3044: '任選', // SEA TL2D37 任选一
    3047: '二星直選', // SEA TL2D37 二星直选
    3049: '二星組選', // SEA TL2D37 二星组选
    3052: '兩面 1st', // SEA TL2D37 第一球
    3053: '兩面 2nd', // SEA TL2D37 第二球

    // Thai

    // 一級選單

    2060: '二數',
    2055: '三數',
    2067: '跑數',
    2297: '魚蝦蟹', // 魚蝦蟹
    2497: '番攤', // 番攤

    // 二級選單

    2056: '上正',
    2058: '上反',
    2061: '上正',
    2063: '上反',
    2643: '二等', // 三數 二等
    2644: '二特', // 三數 二特
    2065: '直選加開',
    2068: '後三不定位',

    2298: '魚蝦蟹', // 魚蝦蟹

    2498: '番',
    2500: '角',
    2502: '念',
    2504: '大小單雙',
    // 三級選單

    2062: '上正二位數',
    2064: '上反二位數',
    2066: '下正二位數',
    2480: '下正二位數（複式）',
    2481: '下正二位數（單式）',
    2482: '上反二位數（複式）',
    2483: '上正二位數（複式）',
    2484: '上正二位數（單式）',

    2057: '上正三位數',
    2059: '上反三位數',
    2645: '二等三位數',
    2646: '二特三位數',
    2069: '上跑三位數',
    2485: '上正三位數（複式）',
    2486: '上正三位數（單式）',
    2487: '上反三位數（複式）',

    2299: '魚蝦蟹', // 魚蝦蟹

    2499: '番',
    2501: '角',
    2503: '念',
    2505: '大小單雙',

    // vnc 越南彩

    // 一級選單

    2090: '四數', // 四數
    2095: '三數', // 三數
    2100: '二數', // 二數
    2105: '跑數', // 跑數

    2515: '包膽', // 包膽 北部
    2528: '包膽', // 包膽 中南部

    2550: '逆向', // 北部 逆向 - 一級選單
    2560: '逆向', // 中南部 逆向 - 一級選單

    2598: '串組', // 北部 串組 - 一級選單
    2608: '串組', // 中南部 串組 - 一級選單

    2300: '魚蝦蟹', // 魚蝦蟹
    2488: '番攤', // 番攤

    2618: '骰寶快三', // 骰寶快三

    2624: '第1-10名排名', // 極速PK10-第1-10名排名
    2627: '冠亞和值', // 極速PK10-冠亞和值
    2630: '龍虎鬥', // 極速PK10-龍虎鬥

    // 二級選單

    2091: '上正', // 四數 上正
    2093: '上反', // 四數 上反
    2096: '上正', // 三數 上正
    2098: '上反', // 三數 上反
    2101: '上正', // 二數 上正
    2103: '下正', // 二數 下正

    2301: '魚蝦蟹', // 魚蝦蟹

    2489: '番', // 番
    2491: '角', // 角
    2493: '念', // 念
    2495: '大小單雙', // 大小單雙

    2619: '單骰', // 骰寶快三 - 單骰
    2620: '和值', // 骰寶快三 - 和值
    2621: '圍骰', // 骰寶快三 - 圍骰
    2622: '全圍', // 骰寶快三 - 全圍
    2623: '大小單雙', // 骰寶快三 - 大小單雙

    2625: '第1-10名排名', // 極速PK10 - 第1-10名排名 - 二級選單
    2626: '第1-10名大小單雙', // 極速PK10 - 第1-10名 - 大小單雙
    2628: '冠亞和值', // 極速PK10 - 冠亞和值 - 二級選單
    2629: '冠亞和大小單雙', // 極速PK10 - 冠亞和值 - 大小單雙
    2631: '龍虎鬥', // 極速PK10 - 龍虎鬥 - 二級選單

    2516: '後二包膽', // 北部 後二包膽
    2520: '後三包膽', // 北部 後三包膽
    2524: '後四包膽', // 北部 後四包膽

    3054: '前二包膽', // 北部 - 前二包胆
    3055: '前二包膽 1K', // 北部 - 前二包胆1K

    2551: '四位逆向', // 北部 - 四不中 - 二級選單
    2554: '八位逆向', // 北部 - 八不中 - 二級選單
    2557: '十位逆向', // 北部 - 十不中 - 二級選單

    2599: '串2組', // 北部 - 串2組 - 二級選單
    2602: '串3組', // 北部 - 串3組 - 二級選單
    2605: '串4組', // 北部 - 串4組 - 二級選單

    2584: '二數頭尾', // 北部 - 二數頭尾 - 二級選單

    2529: '後二包膽', // 中南部 後二包膽
    2533: '後三包膽', // 中南部 後三包膽
    2537: '後四包膽', // 中南部 後四包膽

    3056: '前二包膽', // 中南部 - 前二包胆
    3057: '前二包膽 1K', // 中南部 - 前二包胆1K

    2561: '四位逆向', // 中南部 - 四不中 - 二級選單
    2564: '八位逆向', // 中南部 - 八不中 - 二級選單
    2567: '十位逆向', // 中南部 - 十不中 - 二級選單

    2609: '串2組', // 中南部 - 串2組 - 二級選單
    2612: '串3組', // 中南部 - 串3組 - 二級選單
    2615: '串4組', // 中南部 - 串4組 - 二級選單

    2591: '二數頭尾', // 中南部 - 二數頭尾 - 二級選單

    2106: '不定位', // 跑數二級選單
    2108: '不定位', // 跑數二級選單

    2579: '不定位', // 特等一等 - 十位個位 - 跑數 - 二級選單

    // 以下在東南亞彩是屬於三級選單直選，在越南彩才是屬於二級選單
    2092: '上正四位數', // 上正四位數 Last_4_Straight_1st_VNC
    2094: '上反四位數', // 上反四位數 Last_4_Combine_1st_VNC
    2097: '上正三位數', // 上正三位數 Last_3_Straight_1st_VNC
    2099: '上反三位數', // 上反三位數 Last_3_Combine_1st_VNC
    2102: '上正二位數', // 上正二位數 Last_2_Straight_1st_VNC
    2104: '一等獎後二位', // 下正二位數 Last_2_Straight_2nd_VNC
    2107: '上跑兩位數', // 上跑兩位數 Last_2_Any_1st_VNC
    2109: '下跑兩位數', // 下跑兩位數 Last_2_Any_2nd_VNC

    2601: '串2組', // 北部 串2組 Bunch_2_North_VNC
    2604: '串3組', // 北部 串3組 Bunch_3_North_VNC
    2607: '串4組', // 北部 串4組 Bunch_4_North_VNC
    2611: '串2組', // 中南部 串2組 Bunch_2_South_VNC
    2614: '串3組', // 中南部 串3組 Bunch_3_South_VNC
    2617: '串4組', // 中南部 串4組 Bunch_4_South_VNC

    2552: '四不中', // 北部 - 四不中
    2555: '八不中', // 北部 - 八不中
    2558: '十不中', // 北部 - 十不中
    2562: '四不中', // 中南部 - 四不中
    2565: '八不中', // 中南部 - 八不中
    2568: '十不中', // 中南部 - 十不中

    2517: '後二包膽', // 北部 後二包膽
    2521: '後三包膽', // 北部 後三包膽
    2525: '後四包膽', // 北部 後四包膽
    2530: '後二包膽', // 中南部 後二包膽
    2534: '後三包膽', // 中南部 後三包膽
    2538: '後四包膽', // 中南部 後四包膽

    2641: '後二包膽1K', // 北部 後二包膽 1K
    2642: '後二包膽1K', // 中南部 後二包膽 1K

    2586: '二數頭尾', // 北部 二數頭尾 Last_2_1st_7th_North_VNC
    2589: '二數頭', // 北部 二數頭 Last_2_7th_North_VNC
    2593: '二數頭尾', // 中南部 二數頭尾 Last_2_1st_8th_South_VNC
    2596: '二數頭', // 中南部 二數頭 Last_2_8th_South_VNC

    2580: '特等十位', // 特等十位 Ten_Digit_1st_VNC
    2581: '特等個位', // 特等個位 Unit_Digit_1st_VNC
    2582: '一等十位', // 一等十位 Ten_Digit_2nd_VNC
    2583: '一等個位', // 一等個位 Unit_Digit_2nd_VNC

    2302: '魚蝦蟹', // 魚蝦蟹

    2490: '番', // 番
    2492: '角', // 角
    2494: '念', // 念
    2496: '大小單雙', // 大小單雙

    263700: '一數', // VNC 4D 一數 Fixed_Place_4D_VNC

    // 三級選單

    // 北部
    2518: '後二包膽（複式）', // 北部 後二包膽（複式）
    2519: '後二包膽（單式）', // 北部 後二包膽（單式）
    2522: '後三包膽（複式）', // 北部 後三包膽（複式）
    2523: '後三包膽（單式）', // 北部 後三包膽（單式）
    2526: '後四包膽(複式)', // 北部 後四包膽（複式）
    2527: '後四包膽(單式)', // 北部 後四包膽（單式）

    2553: '四不中(單式)', // 北部 - 四不中(單式) - 三級選單
    2556: '八不中(單式)', // 北部 - 八不中(單式) - 三級選單
    2559: '十不中(單式)', // 北部 - 十不中(單式) - 三級選單

    2587: '二數頭尾（複式)', // 北部 二數頭尾（複式) Last_2_1st_7th_North_VNC_Multi
    2590: '二數頭（複式)', // 北部 二數頭（複式) Last_2_7th_North_VNC_Multi

    // 中南部
    2531: '後二包膽（複式）', // 中南部 後二包膽（複式）
    2532: '後二包膽（單式）', // 中南部 後二包膽（單式）
    2535: '後三包膽（複式）', // 中南部 後三包膽（複式）
    2536: '後三包膽（單式）', // 中南部 後三包膽（單式）
    2539: '後四包膽(複式)', // 中南部 後四包膽（複式）
    2540: '後四包膽(單式)', // 中南部 後四包膽（單式）

    2563: '四不中(單式)', // 中南部 - 四不中(單式) - 三級選單
    2566: '八不中(單式)', // 中南部 - 八不中(單式) - 三級選單
    2569: '十不中(單式)', // 中南部 - 十不中(單式) - 三級選單

    2594: '二數頭尾 (複式)', // 中南部 二數頭尾（複式) Last_2_1st_8th_South_VNC_Multi
    2597: '二數頭 (複式)', // 中南部 二數頭(複式) Last_2_8th_South_VNC_Multi

    // 以下不分南北部
    2286: '上正四位數（複式）', // 上正四位數（複式）Last_4_Straight_1st_VNC_Multi
    2287: '上正四位數（單式）', // 上正四位數（單式）Last_4_Straight_1st_VNC_Single

    2284: '上正三位數（複式）', // 上正三位數（複式）Last_3_Straight_1st_VNC_Multi
    2285: '上正三位數（單式）', // 上正三位數（單式）Last_3_Straight_1st_VNC_Single
    2283: '上反三位數（複式）', // 上反三位數（複式）Last_3_Combine_1st_VNC_Multi

    2279: '上正二位數（複式）', // 上正二位數(複式) Last_2_Straight_1st_VNC_Multi
    2280: '上正二位數（單式）', // 上正二位數（單式）Last_2_Straight_1st_VNC_Single
    2281: '一等獎後二位（複式）', // 下正二位數（複式）Last_2_Straight_2nd_VNC_Multi
    2282: '一等獎後二位（單式）', // 下正二位數（單式）Last_2_Straight_2nd_VNC_Single

    // 一數為特例(不算三級又像三級選單)
    2637: '一數 (個位)', // VNC 4D 一數 (個位) Fixed_Place_4D_Unit_VNC
    2638: '一數 (十位)', // VNC 4D 一數 (十位) Fixed_Place_4D_Ten_VNC
    2639: '一數 (百位)', // VNC 4D 一數 (百位) Fixed_Place_4D_hundred_VNC
    2640: '一數 (千位)', // VNC 4D 一數 (千位) Fixed_Place_4D_Thousand_VNC

    2863: '三星組三', // 三星組3
    2864: '三星組六', // 三星組6
    2865: '後三組三', // 三星組3
    2866: '後三組六', // 三星組6
    2867: '後三組三', // 三星組3
    2868: '後三組六', // 三星組6
    // LAO 老撾彩

    // 一級選單

    2127: '四數',
    2132: '三數',
    2137: '二數',
    2142: '跑數',

    2303: '魚蝦蟹', // 魚蝦蟹

    2506: '番攤', // 番攤

    // 二級選單

    2128: '上正',
    2130: '上反',
    2133: '上正',
    2135: '上反',
    2138: '上正',
    2140: '下正',
    2143: '後二不定位',
    2145: '前二不定位',
    2129: '上正四位數', // Last_4_Straight_LAO
    2131: '上反四位數', // Last_4_Combine_LAO
    2134: '上正三位數', // Last_3_Straight_LAO
    2136: '上反三位數', // Last_3_Combine_LAO
    2139: '上正二位數', // Last_2_Straight_LAO
    2141: '下正二位數', // First_2_Straight_LAO
    2144: '上跑兩位數', // Last_2_Any_LAO
    2146: '下跑兩位數', // First_2_Any_LAO

    2304: '魚蝦蟹', // 魚蝦蟹

    2507: '番',
    2509: '角',
    2511: '念',
    2513: '大小單雙',

    2632: '一數', // SEA 4D 一數 Fixed_Place_4D

    // 三級選單

    // 一數為特例(不算三級又像三級選單)
    2633: '一數 (個位)', // SEA 4D 一數 (個位) Fixed_Place_4D_Unit
    2634: '一數 (十位)', // SEA 4D 一數 (十位) Fixed_Place_4D_Ten
    2635: '一數 (百位)', // SEA 4D 一數 (百位) Fixed_Place_4D_hundred
    2636: '一數 (千位)', // SEA 4D 一數 (千位) Fixed_Place_4D_Thousand

    2288: '上正二位數（複式）', // Last_2_Straight_LAO_Multi
    2289: '上正二位數（單式）', // Last_2_Straight_LAO_Single
    2290: '下正二位數（複式）', // First_2_Straight_LAO_Multi
    2291: '下正二位數（單式）', // First_2_Straight_LAO_Single
    2292: '上反三位數（複式）', // Last_3_Combine_LAO_Multi
    2293: '上正三位數（複式）', // Last_3_Straight_LAO_Multi
    2294: '上正三位數（單式）', // Last_3_Straight_LAO_Single
    2295: '上正四位數（複式）', // Last_4_Straight_LAO_Multi
    2296: '上正四位數（單式）', // Last_4_Straight_LAO_Single

    2305: '魚蝦蟹', // 魚蝦蟹

    2508: '番',
    2510: '角',
    2512: '念',
    2514: '大小單雙',

    // 包膽
    2073: '前二包膽',
    2074: '後二包膽',
    2075: '前三包膽',
    2076: '中三包膽',
    2077: '後三包膽',

    // 跨度
    2078: '前二跨度',
    2079: '後二跨度',
    2080: '前三跨度',
    2081: '中三跨度',
    2082: '後三跨度',

    // 不定位
    2083: '不定位前四組選一膽', // First4Choose1Any_SSC
    2084: '不定位前四組選二膽', // First4Choose2Any_SSC
    2085: '不定位後四組選一膽', // Last4Choose1Any_SSC
    2086: '不定位後四組選二膽', // Last4Choose2Any_SSC
    2087: '不定位前三組選二膽', // First3Choose2Any_SSC
    2088: '不定位中三組選二膽', // Mid3Choose2Any_SSC
    2089: '不定位後三組選二膽', // Last3Choose2Any_SSC

    // 特殊號, 跟豹子通殺一樣, 前台名稱不會標註 全跟三的差異
    2110: '趣味',
    2111: '趣味',
    2112: '趣味',
    2113: '前三特殊號', // (全) First3_Special_SSC
    2114: '前三特殊號', // (三) First3_Special_3_SSC
    2115: '中三特殊號', // (全) Middle3_Special_SSC
    2116: '中三特殊號', // (三) Middle3_Special_3_SSC
    2117: '後三特殊號', // (全) Last3_Special_SSC
    2118: '後三特殊號', // (三) Last3_Special_3_SSC

    // bacc
    2119: '百家樂',
    2120: '百家樂',
    2121: '百家樂',
    2122: '百家樂(無對子)',
    2123: '百家樂',
    2125: '百家樂',
    2126: '百家樂(無對子)',
    // LF3D ent
    2169: '一字定位',
    2170: '百定位',
    2171: '百定位',
    2172: '大小單雙(百定位)',
    2173: '質合數(百定位)',
    2174: '十定位',
    2175: '十定位',
    2176: '大小單雙(十定位)',
    2177: '質合數(十定位)',
    2178: '個定位',
    2179: '個定位',
    2180: '大小單雙(個定位)',
    2181: '質合數(個定位)',
    2182: '一字組合',
    2183: '一字組合',
    2184: '一字組合',
    2185: '二字定位',
    2186: '百十定位',
    2187: '百十定位',
    2188: '百個定位',
    2189: '百個定位',
    2190: '十個定位',
    2191: '十個定位',
    2192: '二字組合',
    2193: '二字組合',
    2194: '二字組合',
    2195: '二字和數',
    2196: '百十和數',
    2197: '百十和數',
    2198: '百十和數尾數',
    2199: '百個和數',
    2200: '百個和數',
    2201: '百個和數尾數',
    2202: '十個和數',
    2203: '十個和數',
    2204: '十個和數尾數',
    2205: '三字定位',
    2206: '百十個定位',
    2207: '百十個定位',
    2208: '三字組合',
    2209: '三字組合',
    2210: '三字組合',
    2211: '三字和數',
    2212: '百十個和數',
    2213: '百十個和數',
    2214: '百十個和數尾數',
    2215: '組選三',
    2216: '組選三',
    2217: '組選三',
    2218: '組選六',
    2219: '組選六',
    2220: '組選六',
    2221: '跨度',
    2222: '跨度',
    2223: '百十個跨度',
    2224: '百十跨度',
    2225: '百個跨度',
    2226: '十個跨度',

    // LF4D
    2244: '一字定位',
    2245: '定位膽',
    2246: '定位膽',

    2247: '二字定位',
    2248: '直選',
    2249: '任二直選',
    2250: '任二直選（單式）',

    2251: '三字定位',
    2252: '直選',
    2253: '任三直選',
    2254: '任三直選（單式）',

    2255: '四字定位',
    2256: '直選',
    2257: '任四直選',
    2258: '任四直選（單式）',

    2259: '二字現',
    2260: '不定位',
    2261: '二字現不定位',

    2262: '三字現',
    2263: '不定位',
    2264: '三字現不定位',

    // K3紅黑組合
    2227: '紅黑組合',
    2228: '紅黑碼',
    2229: '紅碼組合',
    2230: '黑碼組合',
    2269: '紅碼大小單雙',
    2270: '黑碼大小單雙',
    // K3 ENT
    2231: '龍虎和',
    2232: '龍虎和',
    2233: '第一球 vs 第二球',
    2234: '第一球 vs 第三球',
    2235: '第二球 vs 第三球',
    // K3 Span
    2265: '跨度',
    2266: '跨度',
    2267: '跨度',
    2268: '跨度',

    // 11x5 膽拖
    2570: '任選膽拖',
    2571: '任選膽拖',
    2572: '任選二中二',
    2573: '任選三中三',
    2574: '任選四中四',
    2575: '任選五中五',
    2576: '任選六中五',
    2577: '任選七中五',
    2578: '任選八中五',

    // Keno

    // 一級選單

    2647: '任選', // Any_KENO
    2656: '趣味', // Fun_KENO

    // 二級選單

    2648: '任選', // Any_L2_KENO
    2657: '總和大小', // Total_Sum_BST_KENO
    2658: '總和單雙', // Total_Sum_OE_KENO
    2659: '總和過關', // Total_Sum_PASS_KENO
    2660: '上下盤', // UpDown_KENO
    2661: '奇偶盤', // OddEven_KENO
    2662: '五行', // WuXing_KENO

    // 三級選單

    2649: '任選一', // Any1_KENO
    2650: '任選二', // Any2_KENO
    2651: '任選三', // Any3_KENO
    2652: '任選四', // Any4_KENO
    2653: '任選五', // Any5_KENO
    2654: '任選六', // Any6_KENO
    2655: '任選七', // Any7_KENO

    // 牛牛百人

    // 一級選單
    2769: '平倍',
    2771: '翻倍',

    // 二級選單
    2770: '平倍',
    2772: '翻倍',

    // BCR
    2889: '百家樂',
    2890: '莊 & 閑 & 和',
    2891: '莊對',
    2892: '閑對',
    2893: '超級六',

    // Wingo-Level:1

    3060: '跑數', // SEA Wingo 跑数

    // Wingo-Level:2

    3061: '猜大小', // SEA Wingo 大小
    3063: '猜數字', // SEA Wingo 数字
    3065: '猜顏色', // SEA Wingo 顔色

    // Wingo-Level:3

    3062: '猜大小', // SEA Wingo 大小
    3064: '猜數字', // SEA Wingo 猜数字
    3066: '猜顏色', // SEA Wingo 猜紅色
    3067: '猜顏色', // SEA Wingo 猜綠色
    3068: '猜顏色', // SEA Wingo 猜紫色

    // 5D-Level:1

    3069: '整合', // SEA 5D 整合
    3077: '跑數', // SEA 5D 跑數

    // 5D-Level:2

    3070: '直選大小單雙', // SEA 5D 大小单双
    3078: '選號', // SEA 5D 直选
    
    // 5D-Level:3
    
    3071: '和值大小單雙', // SEA 5D 和值
    3072: 'A位置大小單雙', // SEA 5D 第一球
    3073: 'B位置大小單雙', // SEA 5D 第二球
    3074: 'C位置大小單雙', // SEA 5D 第三球
    3075: 'D位置大小單雙', // SEA 5D 第四球
    3076: 'E位置大小單雙', // SEA 5D 第五球
    3079: 'A位置選號', // SEA 5D 第一球
    3080: 'B位置選號', // SEA 5D 第二球
    3081: 'C位置選號', // SEA 5D 第三球
    3082: 'D位置選號', // SEA 5D 第四球
    3083: 'E位置選號', // SEA 5D 第五球

    // SEAK3-Level:1

    3084: '整合', // SEA SEAK3 整合

    // SEAK3-Level:2

    3085: 'SUM', // SEA SEAK3 和值
    3088: '2骰子', // SEA SEAK3 2骰子
    3091: '3骰子', // SEA SEAK3 3骰子
    3094: '不同骰', // SEA SEAK3 不同骰

    // SEAK3-Level:3

    3086: '和值', // SEA SEAK3 和值
    3087: '和值大小單雙', // SEA SEAK3 大小單雙
    3089: '2同號單選', // SEA SEAK3 2同号单选
    3090: '2同號複選', // SEA SEAK3 2同号复选
    3092: '3同號單選', // SEA SEAK3 3同号单选
    3093: '3同號通選', // SEA SEAK3 3同号通选
    3095: '全順', // SEA SEAK3 全順
    3096: '3不同', // SEA SEAK3 3不同
    3097: '2不同', // SEA SEAK3 2不同

    null: ' ',
  },
  playKey: {
    ...lhcPlayKey,
    // 下面開始是娛樂城的，總和大小單雙上面有就不新增了
    zero: '0',
    one: '1',
    two: '2',
    three: '3',
    four: '4',
    five: '5',
    six: '6',
    seven: '7',
    eight: '8',
    nine: '9',
    ten: '10',
    eleven: '11',
    zeroZero: '00',
    zeroOne: '01',
    zeroTwo: '02',
    zeroThree: '03',
    zeroFour: '04',
    zeroFive: '05',
    zeroSix: '06',
    zeroSeven: '07',
    zeroEight: '08',
    zeroNine: '09',
    comZeroOne: '01',
    comZeroTwo: '02',
    comZeroThree: '03',
    comZeroFour: '04',
    comZeroFive: '05',
    comZeroSix: '06',
    comZeroSeven: '07',
    comZeroEight: '08',
    comZeroNine: '09',
    comTen: '10',
    comEleven: '11',
    big: '大',
    small: '小',
    odd: '單',
    even: '雙',
    prime: '質數',
    composite: '合數',
    fcprime: '質數',
    fccomposite: '合數',
    baozi: '豹子',
    pair: '對子',
    straight: '順子',
    straightK3: '全順',
    halfStraight: '半順',
    za3: '雜三',
    zu6: '雜六',
    First3: '前三',
    Middle3: '中三',
    Last3: '後三',
    dragon: '龍',
    tiger: '虎',
    sum: '和',
    smallOdd: '小單',
    smallEven: '小雙',
    bigOdd: '大單',
    bigEven: '大雙',
    NNOne: '牛一',
    NNTwo: '牛二',
    NNThree: '牛三',
    NNFour: '牛四',
    NNFive: '牛五',
    NNSix: '牛六',
    NNSeven: '牛七',
    NNEight: '牛八',
    NNNine: '牛九',
    NNNN: '牛牛',
    NNBig: '牛大',
    NNSmall: '牛小',
    NNOdd: '牛單',
    NNEven: '牛雙',
    NNNoHave: '無牛',
    NNHave: '有牛',
    FiveOfAKind: '五條',
    FourOfAKind: '四條',
    FullHouse: '葫蘆',
    Straight: '順子',
    ThreeOfAKind: '三條',
    TwoPairs: '兩對',
    OnePair: '一對',
    HighCard: '高牌',
    Dragon_Tiger_Tie_5_4_ENT: '萬千 第一球vs第二球',
    Dragon_Tiger_Tie_5_3_ENT: '萬百 第一球vs第三球',
    Dragon_Tiger_Tie_5_2_ENT: '萬十 第一球vs第四球',
    Dragon_Tiger_Tie_5_1_ENT: '萬個 第一球vs第五球',
    Dragon_Tiger_Tie_4_3_ENT: '千百 第二球vs第三球',
    Dragon_Tiger_Tie_4_2_ENT: '千十 第二球vs第四球',
    Dragon_Tiger_Tie_4_1_ENT: '千個 第二球vs第五球',
    Dragon_Tiger_Tie_3_2_ENT: '百十 第三球vs第四球',
    Dragon_Tiger_Tie_3_1_ENT: '百個 第三球vs第五球',
    Dragon_Tiger_Tie_2_1_ENT: '十個 第四球vs第五球',
    PK10dragon: '龍',
    PK10tiger: '虎',
    PK10dragon1861: '1v10:龍',
    PK10tiger1861: '1v10:虎',
    PK10dragon1864: '2v9:龍',
    PK10tiger1864: '2v9:虎',
    PK10dragon1867: '3v8:龍',
    PK10tiger1867: '3v8:虎',
    PK10dragon1870: '4v7:龍',
    PK10tiger1870: '4v7:虎',
    PK10dragon1873: '5v6:龍',
    PK10tiger1873: '5v6:虎',
    twoSum3: '3',
    twoSum4: '4',
    twoSum5: '5',
    twoSum6: '6',
    twoSum7: '7',
    twoSum8: '8',
    twoSum9: '9',
    twoSum10: '10',
    twoSum11: '11',
    twoSum12: '12',
    twoSum13: '13',
    twoSum14: '14',
    twoSum15: '15',
    twoSum16: '16',
    twoSum17: '17',
    twoSum18: '18',
    twoSum19: '19',
    threeSum6: '6',
    threeSum7: '7',
    threeSum8: '8',
    threeSum9: '9',
    threeSum10: '10',
    threeSum11: '11',
    threeSum12: '12',
    threeSum13: '13',
    threeSum14: '14',
    threeSum15: '15',
    threeSum16: '16',
    threeSum17: '17',
    threeSum18: '18',
    threeSum19: '19',
    threeSum20: '20',
    threeSum21: '21',
    threeSum22: '22',
    threeSum23: '23',
    threeSum24: '24',
    threeSum25: '25',
    threeSum26: '26',
    threeSum27: '27',
    Dragon_Tiger_1_VS_10_PK10: '冠軍vs第十名',
    Dragon_Tiger_2_VS_9_PK10: '亞軍vs第九名',
    Dragon_Tiger_3_VS_8_PK10: '季軍vs第八名',
    Dragon_Tiger_4_VS_7_PK10: '第四名vs第七名',
    Dragon_Tiger_5_VS_6_PK10: '第五名vs第六名',
    extremumBig: '極大',
    extremumSmall: '極小',
    specialCom3: '特碼包三',

    // k3
    different_2_12: '1,2',
    different_2_13: '1,3',
    different_2_14: '1,4',
    different_2_15: '1,5',
    different_2_16: '1,6',
    different_2_23: '2,3',
    different_2_24: '2,4',
    different_2_25: '2,5',
    different_2_26: '2,6',
    different_2_34: '3,4',
    different_2_35: '3,5',
    different_2_36: '3,6',
    different_2_45: '4,5',
    different_2_46: '4,6',
    different_2_56: '5,6',
    single_same_1: '1',
    single_same_2: '2',
    single_same_3: '3',
    single_same_4: '4',
    single_same_5: '5',
    single_same_6: '6',
    any_code_not_win_1: '1',
    any_code_not_win_2: '2',
    any_code_not_win_3: '3',
    any_code_not_win_4: '4',
    any_code_not_win_5: '5',
    any_code_not_win_6: '6',
    boazi_1: '1,1,1',
    boazi_2: '2,2,2',
    boazi_3: '3,3,3',
    boazi_4: '4,4,4',
    boazi_5: '5,5,5',
    boazi_6: '6,6,6',
    any_baozi: '任意豹子',
    single_same_2_1: '1,1',
    single_same_2_2: '2,2',
    single_same_2_3: '3,3',
    single_same_2_4: '4,4',
    single_same_2_5: '5,5',
    single_same_2_6: '6,6',
    num_combine0: '紅碼',
    num_combine1: '黑碼',
    red_num_bsoe_0: '紅大',
    red_num_bsoe_1: '紅小',
    red_num_bsoe_2: '紅單',
    red_num_bsoe_3: '紅雙',
    black_num_bsoe_0: '黑大',
    black_num_bsoe_1: '黑小',
    black_num_bsoe_2: '黑單',
    black_num_bsoe_3: '黑雙',
    red_num_com_1: '1',
    red_num_com_2: '2',
    red_num_com_3: '3',
    red_num_com_4: '4',
    red_num_com_5: '5',
    red_num_com_6: '6',
    black_num_com_1: '1',
    black_num_com_2: '2',
    black_num_com_3: '3',
    black_num_com_4: '4',
    black_num_com_5: '5',
    black_num_com_6: '6',

    dragon_tiger_1v2_0: '虎',
    dragon_tiger_1v2_1: '龍',
    dragon_tiger_1v2_2: '和',
    dragon_tiger_1v3_0: '虎',
    dragon_tiger_1v3_1: '龍',
    dragon_tiger_1v3_2: '和',
    dragon_tiger_2v3_0: '虎',
    dragon_tiger_2v3_1: '龍',
    dragon_tiger_2v3_2: '和',

    // K3 Span
    span_0: '0',
    span_1: '1',
    span_2: '2',
    span_3: '3',
    span_4: '4',
    span_5: '5',

    // 11X5 ENT
    twoSideSumGroupBig: '和大',
    twoSideSumGroupSmall: '和小',
    twoSideSumGroupOdd: '和單',
    twoSideSumGroupEven: '和雙',
    twoSideSumGroupTailBig: '尾大',
    twoSideSumGroupTailSmall: '尾小',
    nn1: '牛ㄧ',
    nn2: '牛二',
    nn3: '牛三',
    nn4: '牛四',
    nn5: '牛五',
    nn6: '牛六',
    nn7: '牛七',
    nn8: '牛八',
    nn9: '牛九',
    nn10: '牛牛',
    nnHas0: '無牛',
    nnHas1: '有牛',
    fiveOfAKind: '五條',
    fourOfAKind: '四條',
    fullHouse: '葫蘆',
    treeOfAKind: '三條',
    twoPair: '兩對',
    onePair: '一對',
    highCard: '高牌',
    HK5_SSC_ENT: '百家樂',
    banker: '莊',
    player: '閒',
    tie: '和',
    bankerPair: '莊對',
    playerPair: '閒對',
    Banker: '莊',
    Player: '閒',
    Tie: '和',
    BankerPair: '莊對',
    PlayerPair: '閒對',

    // KENO
    keno_big: '大',
    keno_small: '小',
    keno_sumOdd: '單',
    keno_sumEven: '雙',
    keno_sum: '和',
    keno_bigSumOdd: '大單',
    keno_bigSumEven: '大雙',
    keno_smallSumOdd: '小單',
    keno_smallSumEven: '小雙',
    keno_up: '上',
    keno_down: '下',
    keno_middle: '中',
    keno_ballOdd: '奇',
    keno_ballEven: '偶',
    keno_equal: '和',
    keno_gold: '金',
    keno_wood: '木',
    keno_water: '水',
    keno_fire: '火',
    keno_earth: '土',
    keno_big_full: '大(811-1410)',
    keno_sum_full: '和(810)',
    keno_small_full: '小(210-809)',
  },
  playRemark: {
    ...playRemark,
  },
  bothSideRank: {
    ...lhcBothSideRank,
    ...sscBothSideRank,
    ...pcbBothSideRank,
    ...k3BothSideRank,
  },
  // 娛樂城
  entertainmentBetContent: {
    ...entertainmentPlayMenu,
  },
  // 長龍投注特殊玩法名稱
  longDragonSpecialPlayId: {
    1695: '正碼一',
    1665: '正碼一',
    1667: '正碼一',
    1698: '正碼二',
    1669: '正碼二',
    1671: '正碼二',
    1701: '正碼三',
    1673: '正碼三',
    1675: '正碼三',
    1704: '正碼四',
    1677: '正碼四',
    1679: '正碼四',
    1707: '正碼五',
    1681: '正碼五',
    1683: '正碼五',
    1710: '正碼六',
    1685: '正碼六',
    1687: '正碼六',
    1843: '1 vs 2',
    1844: '1 vs 3',
    1845: '1 vs 4',
    1827: '1 vs 5',
    1847: '2 vs 3',
    1848: '2 vs 4',
    1849: '2 vs 5',
    1850: '3 vs 4',
    1851: '3 vs 5',
    1852: '4 vs 5',
    1858: '冠亞和',
    1860: '冠軍',
    1863: '亞軍',
    1866: '季軍',
    1869: '第四名',
    1872: '第五名',
    1875: '第六名',
    1877: '第七名',
    1879: '第八名',
    1881: '第九名',
    1883: '第十名',
    1861: '1 vs 10',
    1864: '2 vs 9',
    1867: '3 vs 8',
    1870: '4 vs 7',
    1873: '5 vs 6',
    2004: '1 vs 2',
    2005: '1 vs 3',
    2006: '1 vs 4',
    2007: '1 vs 5',
    2008: '2 vs 3',
    2009: '2 vs 4',
    2010: '2 vs 5',
    2011: '3 vs 4',
    2012: '3 vs 5',
    2013: '4 vs 5',
  },
};

export default PlayMenu;
