const PlayMenu = {
  playId: {
      // Thai
    2056: 'ストレート', // 直选
    2058: 'ボックス', // 组选
    2061: 'ストレート', // 直选
    2063: 'ボックス', // 组选
    2065: 'ボーナス数字', // 直选加开
    2068: 'ランダム下３桁', // 后三不定位
    2055: 'ナンバーズ３', // 三数
    2057: '上３桁', // 上正三位数
    2059: '下３桁', // 上反三位数
    2060: 'ナンバーズ２', // 二数
    2062: '上２桁', // 上正二位数
    2064: '真中２桁', // 上反二位数
    2066: '下２桁', // 下正二位数
    2067: '追いかけ番号', // 跑数
    2069: 'ランダム上３桁', // 上跑三位数

      // vnc 越南彩
    2090: 'ナンバーズ4', // 四数
    2095: 'ナンバーズ３', // 三数
    2100: 'ナンバーズ２', // 二数
    2105: 'ランダム選択', // 跑数

    2092: '上４桁', // 上正四位数 Last_4_Straight_1st_VNC
    2094: '下４桁', // 上反四位数 Last_4_Combine_1st_VNC
    2097: '上３桁', // 上正三位数 Last_3_Straight_1st_VNC
    2099: '真中３桁', // 上反三位数 Last_3_Combine_1st_VNC
    2102: '上２桁', // 上正二位数 Last_2_Straight_1st_VNC
    2104: '下２桁', // 下正二位数 Last_2_Straight_2nd_VNC
    2107: 'ランダム上２桁', // 上跑两位数 Last_2_Any_1st_VNC
    2109: 'ランダム下２桁', // 下跑两位数 Last_2_Any_2nd_VNC

      // LAO 老挝彩
    2127: 'ナンバーズ4', // 四数
    2132: 'ナンバーズ３', // 三数
    2137: 'ナンバーズ２', // 二数
    2142: 'ランダム選択', // 跑数

    2129: '上４桁', // 上正四位数 Last_4_Straight_LAO
    2131: '下４桁', // 上反四位数 Last_4_Combine_LAO
    2134: '上３桁', // 上正三位数 Last_3_Straight_LAO
    2136: '下３桁', // 上反三位数 Last_3_Combine_LAO
    2139: '上２桁', // 上正二位数 Last_2_Straight_LAO
    2141: '下２桁', // 下正二位数 First_2_Straight_LAO
    2144: 'ランダム上２桁', // 上跑两位数 Last_2_Any_LAO
    2146: 'ランダム下２桁', // 下跑两位数 First_2_Any_LAO
  },
};

export default PlayMenu;
