const PlayMenu = {
  playId: {
    // Thai
    2056: 'บน',
    2058: 'โต้ด',
    2061: 'บน',
    2063: 'โต้ด',
    2065: 'ล่าง',
    2068: 'บน',
    2055: 'สามตัว', // 三数
    2057: 'สามตัวบน',
    2059: 'สามตัวโต้ด',
    2060: 'สองตัว', // 二数
    2062: 'สองตัวบน',
    2064: 'สองตัวบนโต๊ด',
    2066: 'สองตัวล่าง',
    2067: 'เลขวิ่ง', // 跑数
    2069: 'วิ่ง 3 ตัวบน',
    // vnc 越南彩
    2090: 'สี่ตัว', // 四数
    2095: 'สามตัว', // 三数
    2100: 'สองตัว', // 二数
    2105: 'เลขวิ่ง', // 跑数

    2092: ' 4 ตัวบน', // 上正四位数 Last_4_Straight_1st_VNC
    2094: ' 4 ตัวบนโต๊ด', // 上反四位数 Last_4_Combine_1st_VNC
    2097: 'สามตัวบน', // 上正三位数 Last_3_Straight_1st_VNC
    2099: 'สามตัวโต้ด', // 上反三位数 Last_3_Combine_1st_VNC
    2102: 'สองตัวบน', // 上正二位数 Last_2_Straight_1st_VNC
    2104: 'สองตัวล่าง', // 下正二位数 Last_2_Straight_2nd_VNC
    2107: 'วิ่งบน', // 上跑两位数 Last_2_Any_1st_VNC
    2109: 'วิ่งล่าง', // 下跑两位数 Last_2_Any_2nd_VNC
  },
};

export default PlayMenu;
