/* eslint-disable max-len */
// 娛樂城的playMenu拉出去做
import entertainmentPlayMenu from './play-ent';
import { lhcPlayId, lhcBothSideRank, lhcPlayKey } from './play-lhc';
import { sscBothSideRank } from './play-ssc';
import { pcbBothSideRank } from './play-pcb';
import { k3BothSideRank } from './play-k3';
import playRemark from './playRemark';

const PlayMenu = {
  playId: {
    1: '定位胆',
    2: '后二',
    3: '后三',
    4: '后四',
    5: '五星',
    6: '前二',
    7: '前三',
    8: '前四',
    9: '中三',
    10: '任选',
    11: '趣味',
    12: '不定位',
    13: '一星直选',
    14: '定位胆 ',
    15: '后二直选',
    16: '后二组选',
    17: '后二分位',
    18: '后二包点',
    19: '后二连选',
    20: '后二和值',
    21: '后三直选',
    22: '后三包点',
    23: '后三组三',
    24: '后三组六',
    25: '后三混合组选',
    26: '后三连选',
    27: '后三直选组合',
    28: '后三和值',
    29: '后四直选',
    30: '后四连选',
    31: '五星直选',
    32: '五星通选',
    33: '五星连选',
    34: '前二直选',
    35: '前二组选',
    36: '前二分位',
    37: '前二包点',
    38: '前二连选',
    39: '前二和值',
    40: '前三直选',
    41: '前三包点',
    42: '前三组三',
    43: '前三组六',
    44: '前三混合组选',
    45: '前三连选',
    46: '前三直选组合',
    47: '前三和值',
    48: '前四直选',
    49: '前四连选',
    50: '中三直选',
    51: '中三包点',
    52: '中三组三',
    53: '中三组六',
    54: '中三混合组选',
    55: '中三连选',
    56: '中三直选组合',
    57: '中三和值',
    58: '任一直选',
    59: '任二直选',
    60: '任三直选',
    61: '任四直选',
    62: '前二大小单双',
    63: '后二大小单双',
    64: '不定位前二组选',
    65: '不定位前二直选',
    66: '不定位前三组选一胆',
    67: '不定位前三组选二码',
    68: '不定位前三直选一码',
    69: '不定位前三直选二码',
    70: '不定位后二组选',
    71: '不定位后二直选',
    72: '不定位后三组选一胆',
    73: '不定位后三组选二码',
    74: '不定位后三直选一码',
    75: '不定位后三直选二码',
    76: '不定位中三组选一胆',
    77: '不定位中三组选二码',
    78: '不定位中三直选一码',
    79: '不定位中三直选二码',
    80: '五星直选（单式）',
    81: '五星通选（单式）',
    82: '五星连选（单式）',
    83: '前四直选（单式）',
    84: '前四连选（单式）',
    85: '后四直选（单式）',
    86: '后四连选（单式）',
    87: '前三直选（单式）',
    88: '前三连选（单式）',
    89: '中三直选（单式）',
    90: '中三连选（单式）',
    91: '后三直选（单式）',
    92: '后三连选（单式）',
    93: '前二直选（单式）',
    94: '前二连选（单式）',
    95: '后二直选（单式）',
    96: '后二连选（单式）',
    97: '任二直选（单式）',
    98: '任三直选（单式）',
    99: '任四直选（单式）',
    100: '任二直选（单式）',
    101: '任三直选（单式）',
    102: '任四直选（单式）',
    103: '任五直选（单式）',
    104: '任六直选（单式）',
    105: '任七直选（单式）',
    106: '任八直选（单式）',
    107: '前三直选（单式）',
    108: '前三组选（单式）',
    109: '前二直选（单式）',
    110: '前二组选（单式）',
    111: '三星直选（单式）',
    112: '前二直选（单式）',
    113: '后二直选（单式）',
    114: 'P3直选（单式）',
    115: '前二直选（单式）',
    116: 'P3后二直选（单式）',
    117: '直选',
    118: '组选',
    119: '直选',
    120: '组选',
    121: '直选',
    122: '组选',
    123: '直选',
    124: '组选',
    125: '直选',
    126: '组选',
    127: '直选',
    128: '组选',
    129: '直选',
    130: '组选',
    131: '直选',
    132: '组选',
    133: '定位胆',
    134: '直选',
    135: '组选',
    136: '大小单双',
    137: '直选',
    138: '复式',
    139: '单式',
    140: '定单双',
    141: '猜中位',
    142: '直选',
    143: '组选',
    144: '直选',
    145: '组选',
    146: '不定位胆',
    147: '定位胆',
    148: '三星',
    149: '组选',
    150: '直选',
    151: '组选',
    152: '直选',
    153: '组选',
    154: '不定位胆',
    155: '大小单双',
    156: '定位胆',
    157: '直选',
    158: '组选',
    159: '不定位胆',
    160: '直选',
    161: '组选',
    162: '直选',
    163: '组选',
    164: '大小单双',
    165: '定位胆',
    166: 'P5后二直选（单式）',
    168: '特殊',
    169: '一帆风顺',
    170: '好事成双',
    171: '三星报喜',
    172: '四季发财',
    173: '组选',
    174: '任四组选24',
    175: '任四组选12',
    176: '任四组选6',
    177: '任四组选4',
    178: '任三组选和值',
    179: '任三组三',
    180: '任三组六',
    181: '任三混合组选',
    182: '任二组选和值',
    183: '任二组选',
    184: '任二组选（单式）',
    901: '任选',
    902: '定单双',
    903: '猜中位',
    904: '前三',
    905: '前二',
    906: '不定位',
    907: '定位胆',
    908: '任一直选',
    909: '任二直选',
    910: '任三直选',
    911: '任四直选',
    912: '任五直选',
    913: '任六直选',
    914: '任七直选',
    915: '任八直选',
    916: '定单双',
    917: '猜中位',
    918: '前三直选',
    919: '前三组选',
    920: '前二直选',
    921: '前二组选',
    922: '前三不定位',
    923: '定位胆',
    1401: '直选',
    1403: '不定位',
    1404: '前二',
    1405: '后二',
    1406: '大小单双',
    1407: '定位胆',
    1408: '三星直选',
    1409: '三星直选和值',
    1410: '三星组三',
    1411: '三星组六',
    1412: '三星混合组选',
    1413: '三星组选和值',
    1414: '一码不定位',
    1415: '二码不定位',
    1416: '前二直选',
    1417: '前二组选',
    1418: '后二直选',
    1419: '后二组选',
    1420: '前二大小单双',
    1421: '后二大小单双',
    1422: '定位胆',
    1423: '前三',
    1425: '前三不定位',
    1426: '前二',
    1427: '后二',
    1428: '大小单双',
    1429: '定位胆',
    1430: 'P3直选',
    1431: 'P3直选和值',
    1432: 'P3组三',
    1433: 'P3组六',
    1434: 'P3混合组选',
    1435: 'P3组选和值',
    1436: 'P3一码不定位',
    1437: 'P3二码不定位',
    1438: '前二直选',
    1439: '前二组选',
    1440: 'P3后二直选',
    1441: 'P3后二组选',
    1442: 'P5后二直选',
    1443: 'P5后二组选',
    1444: '前二大小单双',
    1445: 'P3后二大小单双',
    1446: 'P5后二大小单双',
    1447: '定位胆',
    1448: '猜前一',
    1449: '猜前二',
    1450: '猜前三',
    1451: '猜前四',
    1452: '猜前五',
    1453: '定位胆',
    1454: '猜和值',
    1455: '大小单双',
    1456: '龙虎斗',
    1457: '猜前一',
    1458: '猜前二',
    1459: '猜前三',
    1460: '猜前四',
    1461: '猜前五',
    1462: '前五定位胆',
    1463: '后五定位胆',
    1464: '冠亚和值',
    1465: '冠亚季和值',
    1466: '首尾和值',
    1467: '前五大小单双',
    1468: '后五大小单双',
    1469: '冠亚和大小单双',
    1470: '第一名VS第十名',
    1471: '第二名VS第九名',
    1472: '第三名VS第八名',
    1473: '第四名VS第七名',
    1474: '第五名VS第六名',
    1601: '五星组选120',
    1602: '五星组选60',
    1603: '五星组选30',
    1604: '五星组选20',
    1605: '五星组选10',
    1606: '五星组选5',
    1607: '前四组选24',
    1608: '前四组选12',
    1609: '前四组选6',
    1610: '前四组选4',
    1611: '后四组选24',
    1612: '后四组选12',
    1613: '后四组选6',
    1614: '后四组选4',

    // 20170522 add by G
    1732: '猜前二（单式）',
    1733: '猜前三（单式）',
    1734: '猜前四（单式）',
    1735: '猜前五（单式）',

    1736: '龙虎和',
    1737: '趣味',
    1738: '龙虎和-万千',
    1739: '龙虎和-万百',
    1740: '龙虎和-万十',
    1741: '龙虎和-万个',
    1742: '龙虎和-千百',
    1743: '龙虎和-千十',
    1744: '龙虎和-千个',
    1745: '龙虎和-百十',
    1746: '龙虎和-百个',
    1747: '龙虎和-十个',

    2663: '新龙虎',
    2664: '趣味',
    2665: '新龙虎-万千',
    2666: '新龙虎-万百',
    2667: '新龙虎-万十',
    2668: '新龙虎-万个',
    2669: '新龙虎-千百',
    2670: '新龙虎-千十',
    2671: '新龙虎-千个',
    2672: '新龙虎-百十',
    2673: '新龙虎-百个',
    2674: '新龙虎-十个',

    // 20170607 不定位新增玩法
    1748: '不定位后四直选一码',
    1749: '不定位后四直选二码',
    1750: '不定位五星直选一码',
    1751: '不定位五星直选二码',
    1752: '不定位五星直选三码',

    // 20180904 不定位新增組選玩法
    2029: '不定位五星組选二胆',
    2030: '不定位五星組选三胆',

    // 20230309 体彩P3P5新增 五星 前四 後四玩法
    2877: '五星',
    2878: '直选',
    2879: '五星直选',
    2880: '五星直选(单式)',
    2881: '前四',
    2882: '直选',
    2883: 'P5前四直选',
    2884: 'P5前四直选(单式)',
    2885: '后四',
    2886: '直选',
    2887: 'P5后四直选',
    2888: 'P5后四直选(单式)',

    // 娛樂城 快捷
    99999: '快捷',

    // 娛樂城 Menu
    1753: '整合',
    1754: '第一球',
    1764: '第二球',
    1774: '第三球',
    1784: '第四球',
    1794: '第五球',
    1828: '两面盘',
    1841: '龙虎斗',
    1853: '全五中一',

    // 娛樂城 play
    // 娛樂城整合
    1805: '第一球:直选',
    1806: '第一球:大小单双',
    1808: '第二球:直选',
    1809: '第二球:大小单双',
    1811: '第三球:直选',
    1812: '第三球:大小单双',
    1814: '第四球:直选',
    1815: '第四球:大小单双',
    1817: '第五球:直选',
    1818: '第五球:大小单双',
    1826: '总大小单双',
    1820: '前三',
    1822: '中三',
    1824: '后三',


    1843: '第一球vs第二球',
    1844: '第一球vs第三球',
    1845: '第一球vs第四球',
    1827: '第一球vs第五球',
    1847: '第二球vs第三球',
    1848: '第二球vs第四球',
    1849: '第二球vs第五球',
    1850: '第三球vs第四球',
    1851: '第三球vs第五球',
    1852: '第四球vs第五球',
    1855: '全五中一:直选',


    // 娛樂城 PK10 menu
    1856: '两面',
    1884: '猜和值',
    1885: '冠亚和值',
    1886: '冠亚季和值',
    1887: '首尾和值',
    1888: '第1-10名',
    1899: '龙虎斗',

    // 娛樂城 PK10 玩法
    1858: '冠亚和:大小单双',
    1860: '冠军:大小单双',
    1861: '冠军vs第十名',
    1863: '亚军:大小单双',
    1864: '亚军vs第九名',
    1866: '季军:大小单双',
    1867: '季军vs第八名',
    1869: '第四名:大小单双',
    1870: '第四名vs第七名',
    1872: '第五名:大小单双',
    1873: '第五名vs第六名',
    1875: '第六名:大小单双',
    1877: '第七名:大小单双',
    1879: '第八名:大小单双',
    1881: '第九名:大小单双',
    1883: '第十名:大小单双',

    1889: '冠军',
    1890: '亚军',
    1891: '季军',
    1892: '第四名',
    1893: '第五名',
    1894: '第六名',
    1895: '第七名',
    1896: '第八名',
    1897: '第九名',
    1898: '第十名',
    9999: '第六-十名',
    1905: '整合',
    1906: '和值',
    1907: '和值',
    1908: '两面',
    1909: '大小单双',
    1910: '组合大小单双',
    2163: '大小单双',
    2164: '组合大小单双',
    2165: '大小单双',
    2166: '组合大小单双',
    2167: '大小单双',
    2168: '组合大小单双',
    1911: '极值',
    1912: '趣味',
    1913: '色波',
    1914: '豹子',
    1915: '特码包三',

    1916: '和值',
    1917: '和值',
    1918: '三同号',
    1919: '三同号单选',
    1920: '三同号通选',
    1921: '三不同号',
    1922: '三不同号',
    1923: '三连号',
    1924: '三连号通选',
    1925: '二同号',
    1926: '二同号单选',
    1927: '二同号复选',
    1928: '二不同号',
    1929: '二不同号',
    1930: '趣味',
    1931: '和值大小单双',
    2236: '和值组合大小单双',
    2239: '单挑一骰',
    2271: '梭哈',
    2272: '豹子',
    2273: '全顺',
    2274: '对子',
    2275: '半顺',
    2276: '杂三',
    2277: '二同号通选',
    2278: '三不同号通选',

    1932: '整合',
    1933: '和值',
    1934: '和值',
    1935: '和值大小单双',
    1936: '和值大小单双',
    2237: '和值组合大小单双',
    2238: '和值组合大小单双',
    2240: '猜必出',
    2241: '猜必不出',
    1937: '两连',
    1938: '两连',
    1939: '独胆',
    1940: '独胆',
    1941: '豹子',
    1942: '豹子',
    1943: '豹子',
    1944: '对子',
    1945: '对子',
    2242: '不出胆',
    2243: '不出胆',

    // 娛樂城 PK10 番摊
    2541: '番摊',
    2542: '番',
    2543: '番摊-番',
    2544: '角',
    2545: '番摊-角',
    2546: '念',
    2547: '番摊-念',
    2548: '大小单双',
    2549: '番摊-大小单双',

    // 11x5 ENT
    1946: '两面',
    1948: '总和',
    1950: '第一球:大小单双',
    1952: '第二球:大小单双',
    1954: '第三球:大小单双',
    1956: '第四球:大小单双',
    1958: '第五球:大小单双',
    1959: '第一球',
    1961: '第一球',
    1964: '第二球',
    1966: '第二球',
    1969: '第三球',
    1971: '第三球',
    1974: '第四球',
    1976: '第四球',
    1979: '第五球',
    1981: '第五球',
    1984: '任选',
    1986: '一中一',
    1987: '二中二',
    1988: '三中三',
    1989: '四中四',
    1990: '五中五',
    1991: '六中五',
    1992: '七中五',
    1993: '八中五',
    1994: '组选',
    1996: '前二组选 (娱乐)',
    1997: '前三组选 (娱乐)',
    1998: '直选',
    2000: '前二直选 (娱乐)',
    2001: '前三直选 (娱乐)',
    2002: '龙虎斗',
    2004: '第一球vs第二球',
    2005: '第一球vs第三球',
    2006: '第一球vs第四球',
    2007: '第一球vs第五球',
    2008: '第二球vs第三球',
    2009: '第二球vs第四球',
    2010: '第二球vs第五球',
    2011: '第三球vs第四球',
    2012: '第三球vs第五球',
    2013: '第四球vs第五球',
    ...lhcPlayId,

    2014: '定位胆',
    2015: '定位胆', // （千百十个）
    2016: '定位胆', // （百十个）
    2017: '定位胆', // （十个）
    2018: '定位胆', // （个）

    2019: '牛牛',
    2021: '牛牛牌型',
    2023: '牛牛有牛无牛',
    2025: '牛牛大小单双',
    2026: '梭哈',
    2028: '梭哈牌型',

    // 五星 和值大小單雙
    2070: '和值',
    2071: '和值大小单双',
    2072: '和值组合大小单双',

    // ENT K3 豹子通殺特仕版
    // 前台不會把豹子通殺秀出來, 看起來跟原本的玩法只有賠率差異
    2053: '和值',
    2054: '和值-大小单双',

    // VTX
    2675: '越式大小',
    2676: '大小',

    // VXD
    2677: '色碟',
    2678: '大小',
    2679: '单双',
    2680: '全红',
    2681: '全白',
    2682: '3白+1红',
    2683: '3红+1白',

    // VBC 魚蝦蟹
    2733: '鱼虾蟹',
    2734: '鱼虾蟹',

    // CLR
    3058: 'Color',
    3059: 'Color',

    // SEA SEA V2 TL(天龍)

    // 一級選單

    // TL2D
    2735: '一星', // SEA TL2D 一星
    2741: '二星', // SEA TL2D 二星
    2746: '趣味', // SEA TL2D 趣味

    // TL3D

    2684: '二星', // SEA TL3D 二数
    2689: '三星', // SEA TL3D 三数
    2694: '一星', // SEA TL3D 跑数
    2750: '趣味', // SEA TL3D 趣味

    // TL4D

    2697: '二星', // SEA TL4D 二数
    2702: '三星', // SEA TL4D 三数
    2707: '四星', // SEA TL4D 四数
    2712: '一星', // SEA TL4D 跑数
    2755: '趣味', // SEA TL4D 趣味

    // TL6D

    2715: '二星', // SEA TL6D 二数
    2720: '三星', // SEA TL6D 三数
    2725: '四星', // SEA TL6D 四数
    2730: '一星', // SEA TL6D 跑数
    2761: '趣味', // SEA TL6D 趣味

    // TL642

    2894: '3 Digits', // SEA TL642 Lucky Pick
    2901: '2 Digits', // SEA TL642 3D
    2908: '1 Digit', // SEA TL642 2D
    3034: '幸运', // SEA TL642 1D

    // TL645

    2918: '幸运', // SEA TL645 Lucky Pick
    2923: '3 Digits', // SEA TL645 3D
    2930: '2 Digits', // SEA TL645 2D
    2937: '1 Digit', // SEA TL645 1D

    // TL649

    2947: '幸运', // SEA TL649 Lucky Pick
    2952: '3 Digits', // SEA TL649 3D
    2959: '2 Digits', // SEA TL649 2D
    2966: '1 Digit', // SEA TL649 1D

    // TL655

    2976: '幸运', // SEA TL655 Lucky Pick
    2981: '3 Digits', // SEA TL655 3D
    2988: '2 Digits', // SEA TL655 2D
    2995: '1 Digit', // SEA TL655 1D

    // TL658

    3005: '幸运', // SEA TL658 Lucky Pick
    3010: '3 Digits', // SEA TL658 3D
    3017: '2 Digits', // SEA TL658 2D
    3024: '1 Digit', // SEA TL658 1D

    // TL2D37

    3039: '一星', // SEA TL2D37 一星
    3045: '二星', // SEA TL2D37 二星
    3050: '趣味', // SEA TL2D37 趣味

    // 二級選單

    // TL2D

    2736: '定位胆', // SEA TL2D 定位胆
    2739: '任选', // SEA TL2D 任选
    2742: '直选', // SEA TL2D 二星直选
    2744: '组选', // SEA TL2D 二星组选
    2747: '两面', // SEA TL2D 大小单双

    // TL3D

    2685: '直选', // SEA TL3D 后二直选
    2687: '组选', // SEA TL3D 后二组选
    2690: '直选', // SEA TL3D 后三直选
    2692: '组选', // SEA TL3D 后三组选
    2695: '组选', // SEA TL3D 后二不定位
    2751: '两面', // SEA TL3D 大小单双
    2776: '定位胆', // SEA TL3D 定位胆

    // TL4D

    2698: '直选', // SEA TL4D 后二直选
    2700: '组选', // SEA TL4D 后二组选
    2703: '直选', // SEA TL4D 后三直选
    2705: '组选', // SEA TL4D 后三组选
    2708: '直选', // SEA TL4D 后四直选
    2710: '组选', // SEA TL4D 后四组选
    2713: '组选', // SEA TL4D 后二不定位
    2756: '两面', // SEA TL4D 大小单双
    2780: '定位胆', // SEA TL4D 定位胆

    // TL6D

    2716: '直选', // SEA TL6D 后二直选
    2718: '组选', // SEA TL6D 后二组选
    2721: '直选', // SEA TL6D 后三直选
    2723: '组选', // SEA TL6D 后三组选
    2726: '直选', // SEA TL6D 后四直选
    2728: '组选', // SEA TL6D 后四组选
    2731: '组选', // SEA TL6D 后二不定位
    2762: '两面', // SEA TL6D 大小单双
    2785: '定位胆', // SEA TL6D 定位胆

    // TL642

    2895: '直选', // SEA TL642 Lucky Pick 3
    2898: '组选', // SEA TL642 Lucky Pick 12
    2902: '直选', // SEA TL642 Straight
    2905: '组选', // SEA TL642 Any
    2909: '定位胆', // SEA TL642 Straight
    2916: '任选', // SEA TL642 Any
    3035: '幸运3', // SEA TL642 Fixed Position
    3037: '幸运12', // SEA TL642 Any

    // TL645

    2919: '幸运3', // SEA TL645 Lucky Pick 3
    2921: '幸运12', // SEA TL645 Lucky Pick 12
    2924: '直选', // SEA TL645 Straight
    2927: '组选', // SEA TL645 Any
    2931: '直选', // SEA TL645 Straight
    2934: '组选', // SEA TL645 Any
    2938: '定位胆', // SEA TL645 Fixed Position
    2945: '任选', // SEA TL645 Any

    // TL649

    2948: '幸运3', // SEA TL649 Lucky Pick 3
    2950: '幸运12', // SEA TL649 Lucky Pick 12
    2953: '直选', // SEA TL649 Straight
    2956: '组选', // SEA TL649 Any
    2960: '直选', // SEA TL649 Straight
    2963: '组选', // SEA TL649 Any
    2967: '定位胆', // SEA TL649 Fixed Position
    2974: '任选', // SEA TL649 Any

    // TL655

    2977: '幸运3', // SEA TL655 Lucky Pick 3
    2979: '幸运12', // SEA TL655 Lucky Pick 12
    2982: '直选', // SEA TL655 Straight
    2985: '组选', // SEA TL655 Any
    2989: '直选', // SEA TL655 Straight
    2992: '组选', // SEA TL655 Any
    2996: '定位胆', // SEA TL655 Fixed Position
    3003: '任选', // SEA TL655 Any

    // TL658

    3006: '幸运3', // SEA TL658 Lucky Pick 3
    3008: '幸运12', // SEA TL658 Lucky Pick 12
    3011: '直选', // SEA TL658 Straight
    3014: '组选', // SEA TL658 Any
    3018: '直选', // SEA TL658 Straight
    3021: '组选', // SEA TL658 Any
    3025: '定位胆', // SEA TL658 Fixed Position
    3032: '任选', // SEA TL658 Any

    // TL2D37

    3040: '定位胆', // SEA TL2D37 定位胆
    3043: '任选', // SEA TL2D37 任选
    3046: '直选', // SEA TL2D37 二星直选
    3048: '组选', // SEA TL2D37 二星组选
    3051: '两面', // SEA TL2D37 大小单双

    // 三級選單

    // TL2D

    2737: '定位胆 1st', // SEA TL2D 第一球
    2738: '定位胆 2nd', // SEA TL2D 第二球
    2740: '任选', // SEA TL2D 任选一
    2743: '二星直选', // SEA TL2D 二星直选
    2745: '二星组选', // SEA TL2D 二星组选
    2748: '两面 1st', // SEA TL2D 第一球
    2749: '两面 2nd', // SEA TL2D 第二球

    // TL3D

    2686: '后二直选', // SEA TL3D 上正二位数
    2688: '后二组选', // SEA TL3D 上反二位数
    2691: '三星直选', // SEA TL3D 上正三位数
    2693: '三星组选', // SEA TL3D 上反三位数
    2696: '后二不定位一码', // SEA TL3D 上跑两位数
    2752: '两面 1st', // SEA TL3D 第一球
    2753: '两面 2nd', // SEA TL3D 第二球
    2754: '两面 3rd', // SEA TL3D 第三球
    2777: '定位胆 1st', // SEA TL3D 第一位
    2778: '定位胆 2nd', // SEA TL3D 第二位
    2779: '定位胆 3rd', // SEA TL3D 第三位
    2863: '三星组三', // SEA TL3D 三星組3
    2864: '三星组六', // SEA TL3D 三星組6

    // TL4D

    2699: '后二直选', // SEA TL4D 上正二位数
    2701: '后二组选', // SEA TL4D 上反二位数
    2704: '后三直选', // SEA TL4D 上正三位数
    2706: '后三组选', // SEA TL4D 上反三位数
    2709: '四星直选', // SEA TL4D 上正四位数
    2711: '四星組选', // SEA TL4D 上反四位数
    2714: '后二不定位一码', // SEA TL4D 上跑两位数
    2757: '两面 1st', // SEA TL4D 第一球
    2758: '两面 2nd', // SEA TL4D 第二球
    2759: '两面 3rd', // SEA TL4D 第三球
    2760: '两面 4th', // SEA TL4D 第四球
    2781: '定位胆 1st', // SEA TL4D 第一位
    2782: '定位胆 2nd', // SEA TL4D 第二位
    2783: '定位胆 3rd', // SEA TL4D 第三位
    2784: '定位胆 4th', // SEA TL4D 第四位
    2865: '后三组三', // SEA TL4D 三星組3
    2866: '后三组六', // SEA TL4D 三星組6
    2869: '四星組选4', // SEA TL4D 四星組選4
    2870: '四星組选6', // SEA TL4D 四星組選6
    2871: '四星組选12', // SEA TL4D 四星組選12
    2872: '四星組选24', // SEA TL4D 四星組選24

    // TL6D

    2717: '后二直选', // SEA TL6D 上正二位数
    2719: '后二组选', // SEA TL6D 上反二位数
    2722: '后三直选', // SEA TL6D 上正三位数
    2724: '后三组选', // SEA TL6D 上反三位数
    2727: '后四直选', // SEA TL6D 上正四位数
    2729: '后四組选', // SEA TL6D 上反四位数
    2732: '后二不定位一码', // SEA TL6D 上跑两位数
    2763: '两面 1st', // SEA TL6D 第一球
    2764: '两面 2nd', // SEA TL6D 第二球
    2765: '两面 3rd', // SEA TL6D 第三球
    2766: '两面 4th', // SEA TL6D 第四球
    2767: '两面 5th', // SEA TL6D 第五球
    2768: '两面 6th', // SEA TL6D 第六球
    2786: '定位胆 1st', // SEA TL6D 第一位
    2787: '定位胆 2nd', // SEA TL6D 第二位
    2788: '定位胆 3rd', // SEA TL6D 第三位
    2789: '定位胆 4th', // SEA TL6D 第四位
    2790: '定位胆 5th', // SEA TL6D 第五位
    2791: '定位胆 6th', // SEA TL6D 第六位
    2867: '后三组三', // SEA TL6D 三星組3
    2868: '后三组六', // SEA TL6D 三星組6
    2873: '后四組选4', // SEA TL6D 四星組選4
    2874: '后四組选6', // SEA TL6D 四星組選6
    2875: '后四組选12', // SEA TL6D 四星組選12
    2876: '后四組选24', // SEA TL6D 四星組選24

    // TL642

    2896: '前三直选', // SEA TL642 Lucky Pick 3
    2897: '后三直选', // SEA TL642 Lucky Pick 12
    2899: '前三组选', // SEA TL642 First 3 Straight
    2900: '后三组选', // SEA TL642 Last 3 Straight
    2903: '前二直选', // SEA TL642 First 3 Any
    2904: '后二直选', // SEA TL642 Last 3 Any
    2906: '前二组选', // SEA TL642 First 2 Straight
    2907: '后二组选', // SEA TL642 Last 2 Straight
    2910: '定位胆 1st', // SEA TL642 First 2 Any
    2911: '定位胆 2nd', // SEA TL642 Last 2 Any
    2912: '定位胆 3rd', // SEA TL642 1st
    2913: '定位胆 4th', // SEA TL642 2nd
    2914: '定位胆 5th', // SEA TL642 3rd
    2915: '定位胆 6th', // SEA TL642 4th
    2917: '任选', // SEA TL642 5th
    3036: '幸运3', // SEA TL642 6th
    3038: '幸运12', // SEA TL642 Any

    // TL645

    2920: '幸运3', // SEA TL645 Lucky Pick 3
    2922: '幸运12', // SEA TL645 Lucky Pick 12
    2925: '前三直选', // SEA TL645 First 3 Straight
    2926: '后三直选', // SEA TL645 Last 3 Straight
    2928: '前三组选', // SEA TL645 First 3 Any
    2929: '后三组选', // SEA TL645 Last 3 Any
    2932: '前二直选', // SEA TL645 First 2 Straight
    2933: '后二直选', // SEA TL645 Last 2 Straight
    2935: '前二组选', // SEA TL645 First 2 Any
    2936: '后二组选', // SEA TL645 Last 2 Any
    2939: '定位胆 1st', // SEA TL645 1st
    2940: '定位胆 2nd', // SEA TL645 2nd
    2941: '定位胆 3rd', // SEA TL645 3rd
    2942: '定位胆 4th', // SEA TL645 4th
    2943: '定位胆 5th', // SEA TL645 5th
    2944: '定位胆 6th', // SEA TL645 6th
    2946: '任选', // SEA TL645 Any

    // TL649

    2949: '幸运3', // SEA TL649 Lucky Pick 3
    2951: '幸运12', // SEA TL649 Lucky Pick 12
    2954: '前三直选', // SEA TL649 First 3 Straight
    2955: '后三直选', // SEA TL649 Last 3 Straight
    2957: '前三组选', // SEA TL649 First 3 Any
    2958: '后三组选', // SEA TL649 Last 3 Any
    2961: '前二直选', // SEA TL649 First 2 Straight
    2962: '后二直选', // SEA TL649 Last 2 Straight
    2964: '前二组选', // SEA TL649 First 2 Any
    2965: '后二组选', // SEA TL649 Last 2 Any
    2968: '定位胆 1st', // SEA TL649 1st
    2969: '定位胆 2nd', // SEA TL649 2nd
    2970: '定位胆 3rd', // SEA TL649 3rd
    2971: '定位胆 4th', // SEA TL649 4th
    2972: '定位胆 5th', // SEA TL649 5th
    2973: '定位胆 6th', // SEA TL649 6th
    2975: '任选', // SEA TL649 Any

    // TL655

    2978: '幸运3', // SEA TL655 Lucky Pick 3
    2980: '幸运12', // SEA TL655 Lucky Pick 12
    2983: '前三直选', // SEA TL655 First 3 Straight
    2984: '后三直选', // SEA TL655 Last 3 Straight
    2986: '前三组选', // SEA TL655 First 3 Any
    2987: '后三组选', // SEA TL655 Last 3 Any
    2990: '前二直选', // SEA TL655 First 2 Straight
    2991: '后二直选', // SEA TL655 Last 2 Straight
    2993: '前二组选', // SEA TL655 First 2 Any
    2994: '后二组选', // SEA TL655 Last 2 Any
    2997: '定位胆 1st', // SEA TL655 1st
    2998: '定位胆 2nd', // SEA TL655 2nd
    2999: '定位胆 3rd', // SEA TL655 3rd
    3000: '定位胆 4th', // SEA TL655 4th
    3001: '定位胆 5th', // SEA TL655 5th
    3002: '定位胆 6th', // SEA TL655 6th
    3004: '任选', // SEA TL655 Any

    // TL658

    3007: '幸运3', // SEA TL658 Lucky Pick 3
    3009: '幸运12', // SEA TL658 Lucky Pick 12
    3012: '前三直选', // SEA TL658 First 3 Straight
    3013: '后三直选', // SEA TL658 Last 3 Straight
    3015: '前三组选', // SEA TL658 First 3 Any
    3016: '后三组选', // SEA TL658 Last 3 Any
    3019: '前二直选', // SEA TL658 First 2 Straight
    3020: '后二直选', // SEA TL658 Last 2 Straight
    3022: '前二组选', // SEA TL658 First 2 Any
    3023: '后二组选', // SEA TL658 Last 2 Any
    3026: '定位胆 1st', // SEA TL658 1st
    3027: '定位胆 2nd', // SEA TL658 2nd
    3028: '定位胆 3rd', // SEA TL658 3rd
    3029: '定位胆 4th', // SEA TL658 4th
    3030: '定位胆 5th', // SEA TL658 5th
    3031: '定位胆 6th', // SEA TL658 6th
    3033: '任选', // SEA TL658 Any

    // TL2D37

    3041: '定位胆 1st', // SEA TL2D37 第一球
    3042: '定位胆 2nd', // SEA TL2D37 第二球
    3044: '任选', // SEA TL2D37 任选一
    3047: '二星直选', // SEA TL2D37 二星直选
    3049: '二星组选', // SEA TL2D37 二星组选
    3052: '两面 1st', // SEA TL2D37 第一球
    3053: '两面 2nd', // SEA TL2D37 第二球

    // Thai

    // 一級選單

    2060: '二数',
    2055: '三数',
    2067: '跑数',
    2297: '鱼虾蟹', // 魚蝦蟹
    2497: '番摊', // 番摊

    // 二級選單

    2056: '上正',
    2058: '上反',
    2061: '上正',
    2063: '上反',
    2643: '二等', // 三数 二等
    2644: '二特', // 三数 二特
    2065: '直选加开',
    2068: '后三不定位',

    2298: '鱼虾蟹', // 魚蝦蟹

    2498: '番',
    2500: '角',
    2502: '念',
    2504: '大小单双',

    // 三級選單

    2062: '上正二位数',
    2064: '上反二位数',
    2066: '下正二位数',
    2480: '下正二位数（复式）',
    2481: '下正二位数（单式）',
    2482: '上反二位数（复式）',
    2483: '上正二位数（复式）',
    2484: '上正二位数（单式）',

    2057: '上正三位数',
    2059: '上反三位数',
    2645: '二等三位数',
    2646: '二特三位数',
    2069: '上跑三位数',
    2485: '上正三位数（复式）',
    2486: '上正三位数（单式）',
    2487: '上反三位数（复式）',

    2299: '鱼虾蟹', // 魚蝦蟹

    2499: '番',
    2501: '角',
    2503: '念',
    2505: '大小单双',

    // vnc 越南彩

    // 一級選單

    2090: '四数', // 四数
    2095: '三数', // 三数
    2100: '二数', // 二数
    2105: '跑数', // 跑数

    2515: '包胆', // 包膽 北部
    2528: '包胆', // 包膽 中南部

    2550: '逆向', // 北部 逆向 - 一級選單
    2560: '逆向', // 中南部 逆向 - 一級選單

    2598: '串组', // 北部 串组 - 一級選單
    2608: '串组', // 中南部 串组 - 一級選單

    2300: '鱼虾蟹', // 魚蝦蟹
    2488: '番摊', // 番摊

    2618: '骰寶快三', // 骰寶快三

    2624: '第1-10名排名', // 极速PK10-第1-10名排名
    2627: '冠亚和值', // 极速PK10-冠亚和值
    2630: '龙虎斗', // 极速PK10-龙虎斗

    // 二級選單

    2091: '上正', // 四数 上正
    2093: '上反', // 四数 上反
    2096: '上正', // 三数 上正
    2098: '上反', // 三数 上反
    2101: '上正', // 二数 上正
    2103: '下正', // 二数 下正

    2301: '鱼虾蟹', // 魚蝦蟹

    2489: '番', // 番
    2491: '角', // 角
    2493: '念', // 念
    2495: '大小单双', // 大小单双

    2619: '单骰', // 骰寶快三 - 单骰
    2620: '和值', // 骰寶快三 - 和值
    2621: '围骰', // 骰寶快三 - 围骰
    2622: '全围', // 骰寶快三 - 全围
    2623: '大小单双', // 骰寶快三 - 大小单双

    2625: '第1-10名排名', // 极速PK10 - 第1-10名排名 - 二級選單
    2626: '第1-10名大小单双', // 极速PK10 - 第1-10名 - 大小单双
    2628: '冠亚和值', // 极速PK10 - 冠亚和值 - 二級選單
    2629: '冠亚和大小单双', // 极速PK10 - 冠亚和值 - 大小单双
    2631: '龙虎斗', // 极速PK10 - 龙虎斗 - 二級選單

    2516: '后二包胆', // 北部 后二包胆
    2520: '后三包胆', // 北部 后三包胆
    2524: '后四包胆', // 北部 后四包胆
    3054: '前二包胆', // 北部 - 前二包胆
    3055: '前二包胆 1K', // 北部 - 前二包胆1K

    2551: '四位逆向', // 北部 - 四不中 - 二級選單
    2554: '八位逆向', // 北部 - 八不中 - 二級選單
    2557: '十位逆向', // 北部 - 十不中 - 二級選單

    2599: '串2组', // 北部 - 串2组 - 二級選單
    2602: '串3组', // 北部 - 串3组 - 二級選單
    2605: '串4组', // 北部 - 串4组 - 二級選單

    2584: '二数头尾', // 北部 - 二数头尾 - 二級選單

    2529: '后二包胆', // 中南部 后二包胆
    2533: '后三包胆', // 中南部 后三包胆
    2537: '后四包胆', // 中南部 后四包胆
    3056: '前二包胆', // 中南部 - 前二包胆
    3057: '前二包胆 1K', // 中南部 - 前二包胆1K

    2561: '四位逆向', // 中南部 - 四不中 - 二級選單
    2564: '八位逆向', // 中南部 - 八不中 - 二級選單
    2567: '十位逆向', // 中南部 - 十不中 - 二級選單

    2609: '串2组', // 中南部 - 串2组 - 二級選單
    2612: '串3组', // 中南部 - 串3组 - 二級選單
    2615: '串4组', // 中南部 - 串4组 - 二級選單

    2591: '二数头尾', // 中南部 - 二数头尾 - 二級選單

    2106: '不定位', // 跑數二級選單
    2108: '不定位', // 跑數二級選單

    2579: '不定位', // 特等一等 - 十位個位 - 跑數 - 二級選單

    // 以下在東南亞彩是屬於三級選單直選，在越南彩才是屬於二級選單
    2092: '上正四位数', // 上正四位数 Last_4_Straight_1st_VNC
    2094: '上反四位数', // 上反四位数 Last_4_Combine_1st_VNC
    2097: '上正三位数', // 上正三位数 Last_3_Straight_1st_VNC
    2099: '上反三位数', // 上反三位数 Last_3_Combine_1st_VNC
    2102: '上正二位数', // 上正二位数 Last_2_Straight_1st_VNC
    2104: '一等奖后二位', // 下正二位数 Last_2_Straight_2nd_VNC
    2107: '上跑两位数', // 上跑两位数 Last_2_Any_1st_VNC
    2109: '下跑两位数', // 下跑两位数 Last_2_Any_2nd_VNC

    2601: '串2组', // 北部 串2组 Bunch_2_North_VNC
    2604: '串3组', // 北部 串3组 Bunch_3_North_VNC
    2607: '串4组', // 北部 串4组 Bunch_4_North_VNC
    2611: '串2组', // 中南部 串2组 Bunch_2_South_VNC
    2614: '串3组', // 中南部 串3组 Bunch_3_South_VNC
    2617: '串4组', // 中南部 串4组 Bunch_4_South_VNC

    2552: '四不中', // 北部 - 四不中
    2555: '八不中', // 北部 - 八不中
    2558: '十不中', // 北部 - 十不中
    2562: '四不中', // 中南部 - 四不中
    2565: '八不中', // 中南部 - 八不中
    2568: '十不中', // 中南部 - 十不中

    2517: '后二包胆', // 北部 后二包胆
    2521: '后三包胆', // 北部 后三包胆
    2525: '后四包胆', // 北部 后四包胆
    2530: '后二包胆', // 中南部 后二包胆
    2534: '后三包胆', // 中南部 后三包胆
    2538: '后四包胆', // 中南部 后四包胆

    2641: '后二包胆1K', // 北部 后二包胆 1K
    2642: '后二包胆1K', // 中南部 后二包胆 1K

    2586: '二数头尾', // 北部 二数头尾 Last_2_1st_7th_North_VNC
    2589: '二数头', // 北部 二数头 Last_2_7th_North_VNC
    2593: '二数头尾', // 中南部 二数头尾 Last_2_1st_8th_South_VNC
    2596: '二数头', // 中南部 二数头 Last_2_8th_South_VNC

    2580: '特等十位', // 特等十位 Ten_Digit_1st_VNC
    2581: '特等个位', // 特等个位 Unit_Digit_1st_VNC
    2582: '一等十位', // 一等十位 Ten_Digit_2nd_VNC
    2583: '一等个位', // 一等个位 Unit_Digit_2nd_VNC

    2302: '鱼虾蟹', // 魚蝦蟹

    2490: '番', // 番
    2492: '角', // 角
    2494: '念', // 念
    2496: '大小单双', // 大小单双

    263700: '一数', // VNC 4D 一数 Fixed_Place_4D_VNC

    // 三級選單

    // 北部
    2518: '后二包胆（复式）', // 北部 后二包胆（复式）
    2519: '后二包胆（单式）', // 北部 后二包胆（单式）
    2522: '后三包胆（复式）', // 北部 后三包胆（复式）
    2523: '后三包胆（单式）', // 北部 后三包胆（单式）
    2526: '后四包胆(复式)', // 北部 后四包胆（复式）
    2527: '后四包胆(单式)', // 北部 后四包胆（单式）

    2553: '四不中(单式)', // 北部 - 四不中(单式) - 三級選單
    2556: '八不中(单式)', // 北部 - 八不中(单式) - 三級選單
    2559: '十不中(单式)', // 北部 - 十不中(单式) - 三級選單

    2587: '二数头尾（复式)', // 北部 二数头尾（复式) Last_2_1st_7th_North_VNC_Multi
    2590: '二数头（复式)', // 北部 二数头（复式) Last_2_7th_North_VNC_Multi

    // 中南部
    2531: '后二包胆（复式）', // 中南部 后二包胆（复式）
    2532: '后二包胆（单式）', // 中南部 后二包胆（单式）
    2535: '后三包胆（复式）', // 中南部 后三包胆（复式）
    2536: '后三包胆（单式）', // 中南部 后三包胆（单式）
    2539: '后四包胆(复式)', // 中南部 后四包胆（复式）
    2540: '后四包胆(单式)', // 中南部 后四包胆（单式）

    2563: '四不中(单式)', // 中南部 - 四不中(单式) - 三級選單
    2566: '八不中(单式)', // 中南部 - 八不中(单式) - 三級選單
    2569: '十不中(单式)', // 中南部 - 十不中(单式) - 三級選單

    2594: '二数头尾 (复式)', // 中南部 二数头尾（复式) Last_2_1st_8th_South_VNC_Multi
    2597: '二数头 (复式)', // 中南部 二数头(复式) Last_2_8th_South_VNC_Multi

    // 以下不分南北部
    2286: '上正四位数（复式）', // 上正四位数（复式）Last_4_Straight_1st_VNC_Multi
    2287: '上正四位数（单式）', // 上正四位数（单式）Last_4_Straight_1st_VNC_Single

    2284: '上正三位数（复式）', // 上正三位数（复式）Last_3_Straight_1st_VNC_Multi
    2285: '上正三位数（单式）', // 上正三位数（单式）Last_3_Straight_1st_VNC_Single
    2283: '上反三位数（复式）', // 上反三位数（复式）Last_3_Combine_1st_VNC_Multi

    2279: '上正二位数（复式）', // 上正二位数(复式) Last_2_Straight_1st_VNC_Multi
    2280: '上正二位数（单式）', // 上正二位数（单式）Last_2_Straight_1st_VNC_Single
    2281: '一等奖后二位（复式）', // 下正二位数（复式）Last_2_Straight_2nd_VNC_Multi
    2282: '一等奖后二位（单式）', // 下正二位数（单式）Last_2_Straight_2nd_VNC_Single

    // 一數為特例(不算三級又像三級選單)
    2637: '一数 (个位)', // VNC 4D 一数 (個位) Fixed_Place_4D_Unit_VNC
    2638: '一数 (十位)', // VNC 4D 一数 (十位) Fixed_Place_4D_Ten_VNC
    2639: '一数 (百位)', // VNC 4D 一数 (百位) Fixed_Place_4D_hundred_VNC
    2640: '一数 (千位)', // VNC 4D 一数 (千位) Fixed_Place_4D_Thousand_VNC

    2863: '三星组三', // 三星組3
    2864: '三星组六', // 三星組6
    2865: '后三组三', // 三星組3
    2866: '后三组六', // 三星組6
    2867: '后三组三', // 三星組3
    2868: '后三组六', // 三星組6
    // LAO 老挝彩

    // 一級選單

    2127: '四数',
    2132: '三数',
    2137: '二数',
    2142: '跑数',

    2303: '鱼虾蟹', // 魚蝦蟹

    2506: '番摊', // 番摊

    // 二級選單

    2128: '上正',
    2130: '上反',
    2133: '上正',
    2135: '上反',
    2138: '上正',
    2140: '下正',
    2143: '后二不定位',
    2145: '前二不定位',
    2129: '上正四位数', // Last_4_Straight_LAO
    2131: '上反四位数', // Last_4_Combine_LAO
    2134: '上正三位数', // Last_3_Straight_LAO
    2136: '上反三位数', // Last_3_Combine_LAO
    2139: '上正二位数', // Last_2_Straight_LAO
    2141: '下正二位数', // First_2_Straight_LAO
    2144: '上跑两位数', // Last_2_Any_LAO
    2146: '下跑两位数', // First_2_Any_LAO

    2304: '鱼虾蟹', // 魚蝦蟹

    2507: '番',
    2509: '角',
    2511: '念',
    2513: '大小单双',

    2632: '一数', // SEA 4D 一数 Fixed_Place_4D

    // 三級選單

    // 一數為特例(不算三級又像三級選單)
    2633: '一数 (个位)', // SEA 4D 一数 (個位) Fixed_Place_4D_Unit
    2634: '一数 (十位)', // SEA 4D 一数 (十位) Fixed_Place_4D_Ten
    2635: '一数 (百位)', // SEA 4D 一数 (百位) Fixed_Place_4D_hundred
    2636: '一数 (千位)', // SEA 4D 一数 (千位) Fixed_Place_4D_Thousand

    2288: '上正二位数（复式）', // Last_2_Straight_LAO_Multi
    2289: '上正二位数（单式）', // Last_2_Straight_LAO_Single
    2290: '下正二位数（复式）', // First_2_Straight_LAO_Multi
    2291: '下正二位数（单式）', // First_2_Straight_LAO_Single
    2292: '上反三位数（复式）', // Last_3_Combine_LAO_Multi
    2293: '上正三位数（复式）', // Last_3_Straight_LAO_Multi
    2294: '上正三位数（单式）', // Last_3_Straight_LAO_Single
    2295: '上正四位数（复式）', // Last_4_Straight_LAO_Multi
    2296: '上正四位数（单式）', // Last_4_Straight_LAO_Single

    2305: '鱼虾蟹', // 魚蝦蟹

    2508: '番',
    2510: '角',
    2512: '念',
    2514: '大小单双',

    // 包胆
    2073: '前二包胆',
    2074: '后二包胆',
    2075: '前三包胆',
    2076: '中三包胆',
    2077: '后三包胆',

    // 跨度
    2078: '前二跨度',
    2079: '后二跨度',
    2080: '前三跨度',
    2081: '中三跨度',
    2082: '后三跨度',

    // 不定位
    2083: '不定位前四组选一胆', // First4Choose1Any_SSC
    2084: '不定位前四组选二胆', // First4Choose2Any_SSC
    2085: '不定位后四组选一胆', // Last4Choose1Any_SSC
    2086: '不定位后四组选二胆', // Last4Choose2Any_SSC
    2087: '不定位前三组选二胆', // First3Choose2Any_SSC
    2088: '不定位中三组选二胆', // Mid3Choose2Any_SSC
    2089: '不定位后三组选二胆', // Last3Choose2Any_SSC

    // 特殊號, 跟豹子通殺一樣, 前台名稱不會標註 全跟三的差異
    2110: '趣味',
    2111: '趣味',
    2112: '趣味',
    2113: '前三特殊号', // (全) First3_Special_SSC
    2114: '前三特殊号', // (三) First3_Special_3_SSC
    2115: '中三特殊号', // (全) Middle3_Special_SSC
    2116: '中三特殊号', // (三) Middle3_Special_3_SSC
    2117: '后三特殊号', // (全) Last3_Special_SSC
    2118: '后三特殊号', // (三) Last3_Special_3_SSC

    // bacc
    2119: '百家乐',
    2120: '百家乐',
    2121: '百家乐',
    2122: '百家乐(无对子)',
    2123: '百家乐',
    2125: '百家乐',
    2126: '百家乐(无对子)',
    // LF3D ent
    2169: '一字定位',
    2170: '百定位',
    2171: '百定位',
    2172: '大小单双(百定位)',
    2173: '质合数(百定位)',
    2174: '十定位',
    2175: '十定位',
    2176: '大小单双(十定位)',
    2177: '质合数(十定位)',
    2178: '个定位',
    2179: '个定位',
    2180: '大小单双(个定位)',
    2181: '质合数(个定位)',
    2182: '一字組合',
    2183: '一字組合',
    2184: '一字組合',
    2185: '二字定位',
    2186: '百十定位',
    2187: '百十定位',
    2188: '百个定位',
    2189: '百个定位',
    2190: '十个定位',
    2191: '十个定位',
    2192: '二字組合',
    2193: '二字組合',
    2194: '二字組合',
    2195: '二字和数',
    2196: '百十和数',
    2197: '百十和数',
    2198: '百十和数尾数',
    2199: '百个和数',
    2200: '百个和数',
    2201: '百个和数尾数',
    2202: '十个和数',
    2203: '十个和数',
    2204: '十个和数尾数',
    2205: '三字定位',
    2206: '百十个定位',
    2207: '百十个定位',
    2208: '三字组合',
    2209: '三字组合',
    2210: '三字组合',
    2211: '三字和数',
    2212: '百十个和数',
    2213: '百十个和数',
    2214: '百十个和数尾数',
    2215: '组选三',
    2216: '组选三',
    2217: '组选三',
    2218: '组选六',
    2219: '组选六',
    2220: '组选六',
    2221: '跨度',
    2222: '跨度',
    2223: '百十个跨度',
    2224: '百十跨度',
    2225: '百个跨度',
    2226: '十个跨度',

    // LF4D
    2244: '一字定位',
    2245: '定位胆',
    2246: '定位胆',

    2247: '二字定位',
    2248: '直选',
    2249: '任二直选',
    2250: '任二直选（单式）',

    2251: '三字定位',
    2252: '直选',
    2253: '任三直选',
    2254: '任三直选（单式）',

    2255: '四字定位',
    2256: '直选',
    2257: '任四直选',
    2258: '任四直选（单式）',

    2259: '二字现',
    2260: '不定位',
    2261: '二字现不定位',

    2262: '三字现',
    2263: '不定位',
    2264: '三字现不定位',

    // K3紅黑組合
    2227: '红黑组合',
    2228: '红黑码',
    2229: '红码组合',
    2230: '黑码组合',
    2269: '红码大小单双',
    2270: '黑码大小单双',
    // K3 ENT
    2231: '龙虎和',
    2232: '龙虎和',
    2233: '第一球 vs 第二球',
    2234: '第一球 vs 第三球',
    2235: '第二球 vs 第三球',
    // K3 Span
    2265: '跨度',
    2266: '跨度',
    2267: '跨度',
    2268: '跨度',

    // 11x5 膽拖
    2570: '任选胆拖',
    2571: '任选胆拖',
    2572: '任选二中二',
    2573: '任选三中三',
    2574: '任选四中四',
    2575: '任选五中五',
    2576: '任选六中五',
    2577: '任选七中五',
    2578: '任选八中五',

    // Keno

    // 一級選單

    2647: '任选', // Any_KENO
    2656: '趣味', // Fun_KENO

    // 二級選單

    2648: '任选', // Any_L2_KENO
    2657: '总和大小', // Total_Sum_BST_KENO
    2658: '总和单双', // Total_Sum_OE_KENO
    2659: '总和过关', // Total_Sum_PASS_KENO
    2660: '上下盘', // UpDown_KENO
    2661: '奇偶盘', // OddEven_KENO
    2662: '五行', // WuXing_KENO

    // 三級選單

    2649: '任选一', // Any1_KENO
    2650: '任选二', // Any2_KENO
    2651: '任选三', // Any3_KENO
    2652: '任选四', // Any4_KENO
    2653: '任选五', // Any5_KENO
    2654: '任选六', // Any6_KENO
    2655: '任选七', // Any7_KENO

    // 牛牛百人

    // 一級選單
    2769: '平倍',
    2771: '翻倍',

    // 二級選單
    2770: '平倍',
    2772: '翻倍',

    // BCR
    2889: '百家乐',
    2890: '庄 & 闲 & 和',
    2891: '庄对',
    2892: '闲对',
    2893: '超级六',

    // Wingo-Level:1

    3060: '跑数', // SEA Wingo 跑数

    // Wingo-Level:2

    3061: '猜大小', // SEA Wingo 大小
    3063: '猜数字', // SEA Wingo 数字
    3065: '猜颜色', // SEA Wingo 顔色

    // Wingo-Level:3

    3062: '猜大小', // SEA Wingo 大小
    3064: '猜数字', // SEA Wingo 猜数字
    3066: '猜颜色', // SEA Wingo 猜紅色
    3067: '猜颜色', // SEA Wingo 猜綠色
    3068: '猜颜色', // SEA Wingo 猜紫色

    // 5D-Level:1

    3069: '整合', // SEA 5D 整合
    3077: '跑数', // SEA 5D 跑數

    // 5D-Level:2

    3070: '直选大小单双', // SEA 5D 大小单双
    3078: '选号', // SEA 5D 直选
    
    // 5D-Level:3
    
    3071: '和值大小单双', // SEA 5D 和值
    3072: 'A位置大小单双', // SEA 5D 第一球
    3073: 'B位置大小单双', // SEA 5D 第二球
    3074: 'C位置大小单双', // SEA 5D 第三球
    3075: 'D位置大小单双', // SEA 5D 第四球
    3076: 'E位置大小单双', // SEA 5D 第五球
    3079: 'A位置选号', // SEA 5D 第一球
    3080: 'B位置选号', // SEA 5D 第二球
    3081: 'C位置选号', // SEA 5D 第三球
    3082: 'D位置选号', // SEA 5D 第四球
    3083: 'E位置选号', // SEA 5D 第五球

    // SEAK3-Level:1

    3084: '整合', // SEA SEAK3 整合

    // SEAK3-Level:2

    3085: '和值', // SEA SEAK3 和值
    3088: '2骰子', // SEA SEAK3 2骰子
    3091: '3骰子', // SEA SEAK3 3骰子
    3094: '不同骰', // SEA SEAK3 不同骰

    // SEAK3-Level:3

    3086: '和值', // SEA SEAK3 和值
    3087: '和值大小单双', // SEA SEAK3 大小單雙
    3089: '2同号单选', // SEA SEAK3 2同号单选
    3090: '2同号复选', // SEA SEAK3 2同号复选
    3092: '3同号单选', // SEA SEAK3 3同号单选
    3093: '3同号通选', // SEA SEAK3 3同号通选
    3095: '全顺', // SEA SEAK3 全順
    3096: '3不同', // SEA SEAK3 3不同
    3097: '2不同', // SEA SEAK3 2不同

    null: ' ',

  },
  playKey: {
    ...lhcPlayKey,
    // 下面開始是娛樂城的，總和大小單雙上面有就不新增了
    zero: '0',
    one: '1',
    two: '2',
    three: '3',
    four: '4',
    five: '5',
    six: '6',
    seven: '7',
    eight: '8',
    nine: '9',
    ten: '10',
    eleven: '11',
    zeroZero: '00',
    zeroOne: '01',
    zeroTwo: '02',
    zeroThree: '03',
    zeroFour: '04',
    zeroFive: '05',
    zeroSix: '06',
    zeroSeven: '07',
    zeroEight: '08',
    zeroNine: '09',
    comZeroOne: '01',
    comZeroTwo: '02',
    comZeroThree: '03',
    comZeroFour: '04',
    comZeroFive: '05',
    comZeroSix: '06',
    comZeroSeven: '07',
    comZeroEight: '08',
    comZeroNine: '09',
    comTen: '10',
    comEleven: '11',
    big: '大',
    small: '小',
    odd: '单',
    even: '双',
    prime: '质数',
    composite: '合数',
    fcprime: '质数',
    fccomposite: '合数',
    baozi: '豹子',
    pair: '对子',
    straight: '顺子',
    straightK3: '全顺',
    halfStraight: '半顺',
    za3: '杂三',
    zu6: '杂六',
    First3: '前三',
    Middle3: '中三',
    Last3: '后三',
    dragon: '龙',
    tiger: '虎',
    sum: '和',
    smallOdd: '小单',
    smallEven: '小双',
    bigOdd: '大单',
    bigEven: '大双',
    NNOne: '牛一',
    NNTwo: '牛二',
    NNThree: '牛三',
    NNFour: '牛四',
    NNFive: '牛五',
    NNSix: '牛六',
    NNSeven: '牛七',
    NNEight: '牛八',
    NNNine: '牛九',
    NNNN: '牛牛',
    NNBig: '牛大',
    NNSmall: '牛小',
    NNOdd: '牛单',
    NNEven: '牛双',
    NNNoHave: '无牛',
    NNHave: '有牛',
    FiveOfAKind: '五条',
    FourOfAKind: '四条',
    FullHouse: '葫芦',
    Straight: '顺子',
    ThreeOfAKind: '三条',
    TwoPairs: '两对',
    OnePair: '一对',
    HighCard: '高牌',
    Dragon_Tiger_Tie_5_4_ENT: '万千 第一球vs第二球',
    Dragon_Tiger_Tie_5_3_ENT: '万百 第一球vs第三球',
    Dragon_Tiger_Tie_5_2_ENT: '万十 第一球vs第四球',
    Dragon_Tiger_Tie_5_1_ENT: '万个 第一球vs第五球',
    Dragon_Tiger_Tie_4_3_ENT: '千百 第二球vs第三球',
    Dragon_Tiger_Tie_4_2_ENT: '千十 第二球vs第四球',
    Dragon_Tiger_Tie_4_1_ENT: '千个 第二球vs第五球',
    Dragon_Tiger_Tie_3_2_ENT: '百十 第三球vs第四球',
    Dragon_Tiger_Tie_3_1_ENT: '百个 第三球vs第五球',
    Dragon_Tiger_Tie_2_1_ENT: '十个 第四球vs第五球',
    PK10dragon: '龙',
    PK10tiger: '虎',
    PK10dragon1861: '1v10:龙',
    PK10tiger1861: '1v10:虎',
    PK10dragon1864: '2v9:龙',
    PK10tiger1864: '2v9:虎',
    PK10dragon1867: '3v8:龙',
    PK10tiger1867: '3v8:虎',
    PK10dragon1870: '4v7:龙',
    PK10tiger1870: '4v7:虎',
    PK10dragon1873: '5v6:龙',
    PK10tiger1873: '5v6:虎',
    twoSum3: '3',
    twoSum4: '4',
    twoSum5: '5',
    twoSum6: '6',
    twoSum7: '7',
    twoSum8: '8',
    twoSum9: '9',
    twoSum10: '10',
    twoSum11: '11',
    twoSum12: '12',
    twoSum13: '13',
    twoSum14: '14',
    twoSum15: '15',
    twoSum16: '16',
    twoSum17: '17',
    twoSum18: '18',
    twoSum19: '19',
    threeSum6: '6',
    threeSum7: '7',
    threeSum8: '8',
    threeSum9: '9',
    threeSum10: '10',
    threeSum11: '11',
    threeSum12: '12',
    threeSum13: '13',
    threeSum14: '14',
    threeSum15: '15',
    threeSum16: '16',
    threeSum17: '17',
    threeSum18: '18',
    threeSum19: '19',
    threeSum20: '20',
    threeSum21: '21',
    threeSum22: '22',
    threeSum23: '23',
    threeSum24: '24',
    threeSum25: '25',
    threeSum26: '26',
    threeSum27: '27',
    Dragon_Tiger_1_VS_10_PK10: '冠军vs第十名',
    Dragon_Tiger_2_VS_9_PK10: '亚军vs第九名',
    Dragon_Tiger_3_VS_8_PK10: '季军vs第八名',
    Dragon_Tiger_4_VS_7_PK10: '第四名vs第七名',
    Dragon_Tiger_5_VS_6_PK10: '第五名vs第六名',
    extremumBig: '极大',
    extremumSmall: '极小',
    specialCom3: '特码包三',

    // k3
    different_2_12: '1,2',
    different_2_13: '1,3',
    different_2_14: '1,4',
    different_2_15: '1,5',
    different_2_16: '1,6',
    different_2_23: '2,3',
    different_2_24: '2,4',
    different_2_25: '2,5',
    different_2_26: '2,6',
    different_2_34: '3,4',
    different_2_35: '3,5',
    different_2_36: '3,6',
    different_2_45: '4,5',
    different_2_46: '4,6',
    different_2_56: '5,6',
    single_same_1: '1',
    single_same_2: '2',
    single_same_3: '3',
    single_same_4: '4',
    single_same_5: '5',
    single_same_6: '6',
    any_code_not_win_1: '1',
    any_code_not_win_2: '2',
    any_code_not_win_3: '3',
    any_code_not_win_4: '4',
    any_code_not_win_5: '5',
    any_code_not_win_6: '6',
    boazi_1: '1,1,1',
    boazi_2: '2,2,2',
    boazi_3: '3,3,3',
    boazi_4: '4,4,4',
    boazi_5: '5,5,5',
    boazi_6: '6,6,6',
    any_baozi: '任意豹子',
    single_same_2_1: '1,1',
    single_same_2_2: '2,2',
    single_same_2_3: '3,3',
    single_same_2_4: '4,4',
    single_same_2_5: '5,5',
    single_same_2_6: '6,6',
    num_combine0: '红码',
    num_combine1: '黑码',
    red_num_bsoe_0: '红大',
    red_num_bsoe_1: '红小',
    red_num_bsoe_2: '红单',
    red_num_bsoe_3: '红双',
    black_num_bsoe_0: '黑大',
    black_num_bsoe_1: '黑小',
    black_num_bsoe_2: '黑单',
    black_num_bsoe_3: '黑双',
    red_num_com_1: '1',
    red_num_com_2: '2',
    red_num_com_3: '3',
    red_num_com_4: '4',
    red_num_com_5: '5',
    red_num_com_6: '6',
    black_num_com_1: '1',
    black_num_com_2: '2',
    black_num_com_3: '3',
    black_num_com_4: '4',
    black_num_com_5: '5',
    black_num_com_6: '6',

    dragon_tiger_1v2_0: '虎',
    dragon_tiger_1v2_1: '龙',
    dragon_tiger_1v2_2: '和',
    dragon_tiger_1v3_0: '虎',
    dragon_tiger_1v3_1: '龙',
    dragon_tiger_1v3_2: '和',
    dragon_tiger_2v3_0: '虎',
    dragon_tiger_2v3_1: '龙',
    dragon_tiger_2v3_2: '和',

    // K3 Span
    span_0: '0',
    span_1: '1',
    span_2: '2',
    span_3: '3',
    span_4: '4',
    span_5: '5',

    // 11X5 ENT
    twoSideSumGroupBig: '和大',
    twoSideSumGroupSmall: '和小',
    twoSideSumGroupOdd: '和单',
    twoSideSumGroupEven: '和双',
    twoSideSumGroupTailBig: '尾大',
    twoSideSumGroupTailSmall: '尾小',
    nn1: '牛ㄧ',
    nn2: '牛二',
    nn3: '牛三',
    nn4: '牛四',
    nn5: '牛五',
    nn6: '牛六',
    nn7: '牛七',
    nn8: '牛八',
    nn9: '牛九',
    nn10: '牛牛',
    nnHas0: '无牛',
    nnHas1: '有牛',
    fiveOfAKind: '五条',
    fourOfAKind: '四条',
    fullHouse: '葫芦',
    treeOfAKind: '三条',
    twoPair: '两对',
    onePair: '一对',
    highCard: '高牌',
    HK5_SSC_ENT: '百家乐',
    banker: '庄',
    player: '闲',
    tie: '和',
    bankerPair: '庄对',
    playerPair: '闲对',
    Banker: '庄',
    Player: '闲',
    Tie: '和',
    BankerPair: '庄对',
    PlayerPair: '闲对',

    // KENO
    keno_big: '大',
    keno_small: '小',
    keno_sumOdd: '单',
    keno_sumEven: '双',
    keno_sum: '和',
    keno_bigSumOdd: '大单',
    keno_bigSumEven: '大双',
    keno_smallSumOdd: '小单',
    keno_smallSumEven: '小双',
    keno_up: '上',
    keno_down: '下',
    keno_middle: '中',
    keno_ballOdd: '奇',
    keno_ballEven: '偶',
    keno_equal: '和',
    keno_gold: '金',
    keno_wood: '木',
    keno_water: '水',
    keno_fire: '火',
    keno_earth: '土',
    keno_big_full: '大(811-1410)',
    keno_sum_full: '和(810)',
    keno_small_full: '小(210-809)',
  },
  playRemark: {
    ...playRemark,
  },
  bothSideRank: {
    ...lhcBothSideRank,
    ...sscBothSideRank,
    ...pcbBothSideRank,
    ...k3BothSideRank,
  },
  // 娛樂城
  entertainmentBetContent: {
    ...entertainmentPlayMenu,
  },
  // 長龍投注特殊玩法名稱
  longDragonSpecialPlayId: {
    1695: '正码一',
    1665: '正码一',
    1667: '正码一',
    1698: '正码二',
    1669: '正码二',
    1671: '正码二',
    1701: '正码三',
    1673: '正码三',
    1675: '正码三',
    1704: '正码四',
    1677: '正码四',
    1679: '正码四',
    1707: '正码五',
    1681: '正码五',
    1683: '正码五',
    1710: '正码六',
    1685: '正码六',
    1687: '正码六',
    1843: '1 vs 2',
    1844: '1 vs 3',
    1845: '1 vs 4',
    1827: '1 vs 5',
    1847: '2 vs 3',
    1848: '2 vs 4',
    1849: '2 vs 5',
    1850: '3 vs 4',
    1851: '3 vs 5',
    1852: '4 vs 5',
    1858: '冠亚和',
    1860: '冠军',
    1863: '亚军',
    1866: '季军',
    1869: '第四名',
    1872: '第五名',
    1875: '第六名',
    1877: '第七名',
    1879: '第八名',
    1881: '第九名',
    1883: '第十名',
    1861: '1 vs 10',
    1864: '2 vs 9',
    1867: '3 vs 8',
    1870: '4 vs 7',
    1873: '5 vs 6',
    2004: '1 vs 2',
    2005: '1 vs 3',
    2006: '1 vs 4',
    2007: '1 vs 5',
    2008: '2 vs 3',
    2009: '2 vs 4',
    2010: '2 vs 5',
    2011: '3 vs 4',
    2012: '3 vs 5',
    2013: '4 vs 5',
  },
};

export default PlayMenu;
