const PlayMenu = {
  playId: {
    // Keno

    // 一級選單

    2647: 'कोई भी चुनें', // 任選 - 一級選單 Any_KENO
    2656: 'मजेदार', // 趣味 - 一級選單 Fun_KENO

    // 二級選單

    2648: 'कोई भी चुनें', // 任選 - 二級選單 Any_L2_KENO
    2657: 'बड़ा, सटीक स्कोर, छोटा', // 趣味 - 總和大小 Total_Sum_BST_KENO
    2658: 'विषम, सम', // 趣味 - 總和單雙 Total_Sum_OE_KENO
    2659: 'परले बड़ा छोटा, विषम सम', // 趣味 - 總和過關 Total_Sum_PASS_KENO
    2660: 'शीर्ष, टाई, निचला', // 趣味 - 上下盤 UpDown_KENO
    2661: 'विषमताएं, टाई, समानताएं', // 趣味 - 奇偶盤 OddEven_KENO
    2662: 'पांच तत्व', // 趣味 - 五行 WuXing_KENO

    // 三級選單

    2649: 'कोई भी चुनें  1', // 任選一 Any1_KENO
    2650: 'कोई भी चुनें  2', // 任選二 Any2_KENO
    2651: 'कोई भी चुनें  3', // 任選三 Any3_KENO
    2652: 'कोई भी चुनें  4', // 任選四 Any4_KENO
    2653: 'कोई भी चुनें  5', // 任選五 Any5_KENO
    2654: 'कोई भी चुनें  6', // 任選六 Any6_KENO
    2655: 'कोई भी चुनें  7', // 任選七 Any7_KENO

    // Wingo-Level:1

    3060: 'रनिंग नंबर', // SEA Wingo 跑数

    // Wingo-Level:2

    3061: 'बड़ा या छोटा का अनुमान', // SEA Wingo 大小
    3063: 'संख्या का अनुमान', // SEA Wingo 数字
    3065: 'रंग का अनुमान', // SEA Wingo 顔色

    // Wingo-Level:3

    3062: 'बड़ा या छोटा का अनुमान', // SEA Wingo 大小
    3064: 'संख्या का अनुमान', // SEA Wingo 猜数字
    3066: 'रंग का अनुमान', // SEA Wingo 猜紅色
    3067: 'रंग का अनुमान', // SEA Wingo 猜綠色
    3068: 'रंग का अनुमान', // SEA Wingo 猜紫色

    // 5D-Level:1

    3069: 'एकीकरण (Ekīkaraṇ)', // SEA 5D 整合
    3077: 'रनिंग नंबर', // SEA 5D 跑數

    // 5D-Level:2

    3070: 'सीधा चयन बड़ा छोटा विषम सम', // SEA 5D 大小单双
    3078: 'नंबर चयन', // SEA 5D 直选
    
    // 5D-Level:3
    
    3071: 'संयोजन आकार बड़ा छोटा विषम सम', // SEA 5D 和值
    3072: 'स्थिति A आकार विषम सम', // SEA 5D 第一球
    3073: 'स्थिति B आकार विषम सम', // SEA 5D 第二球
    3074: 'स्थिति C आकार विषम सम', // SEA 5D 第三球
    3075: 'स्थिति D आकार विषम सम', // SEA 5D 第四球
    3076: 'स्थिति E आकार विषम सम', // SEA 5D 第五球
    3079: 'स्थिति A संख्या चयन', // SEA 5D 第一球
    3080: 'स्थिति B संख्या चयन', // SEA 5D 第二球
    3081: 'स्थिति C संख्या चयन', // SEA 5D 第三球
    3082: 'स्थिति D संख्या चयन', // SEA 5D 第四球
    3083: 'स्थिति E संख्या चयन', // SEA 5D 第五球

    // SEAK3-Level:1

    3084: 'एकीकरण (Ekīkaraṇ)', // SEA SEAK3 整合

    // SEAK3-Level:2

    3085: 'SUM', // SEA SEAK3 和值
    3088: '2 Same', // SEA SEAK3 2骰子
    3091: '3 Same', // SEA SEAK3 3骰子
    3094: 'Different', // SEA SEAK3 不同骰

    // SEAK3-Level:3

    3086: 'समग्र मान', // SEA SEAK3 和值
    3087: 'संयोजन आकार बड़ा छोटा विषम सम', // SEA SEAK3 大小單雙
    3089: 'अद्वितीय संख्याओं की एक जोड़ी', // SEA SEAK3 2同号单选
    3090: '2 मिलान संख्या', // SEA SEAK3 2同号复选
    3092: 'एक ही संख्या के 3', // SEA SEAK3 3同号单选
    3093: 'एक ही संख्या में से कोई भी', // SEA SEAK3 3同号通选
    3095: '3 निरंतर संख्या', // SEA SEAK3 全順
    3096: '3 अलग -अलग संख्या', // SEA SEAK3 3不同
    3097: '2 अलग -अलग संख्या', // SEA SEAK3 2不同
  },
};

export default PlayMenu;
