const PlayMenu = {
    playId: {
        // Thai
        2056: 'ការបោះដោយផ្ទាល់',
        2058: 'ការជ្រើសរើសក្រុម',
        2061: 'ការបោះដោយផ្ទាល់',
        2063: 'ការជ្រើសរើសក្រុម',
        2065: 'ការបោះឆ្នោតដោយផ្ទាល់',
        2068: 'បីចុងក្រោយមិនត្រូវបានដាក់',
        2055: 'លេខ3', // 三数
        2057: 'តួលេខបីខ្ទង់',
        2059: 'លេខបីខ្ទង់លើ',
        2060: 'លេខ2', // 二数
        2062: 'តួលេខពីខ្ទង់',
        2064: 'លេខពីរខ្ទង់លើ',
        2066: 'អវិជ្ជមានលេខពីរខ្ទង់',
        2067: 'ចំនួនរត់', // 跑数
        2069: 'រត់បីខ្ទង់',
        // vnc 越南彩
        2090: 'លេខ4', // 四数
        2095: 'លេខ3', // 三数
        2100: 'លេខ2', // 二数
        2105: 'ចំនួនរត់', // 跑数

        2092: 'តួលេខពបួនខ្ទង់', // 上正四位数 Last_4_Straight_1st_VNC
        2094: 'លេខបួនខ្ទង់លើ', // 上反四位数 Last_4_Combine_1st_VNC
        2097: 'តួលេខបីខ្ទង់', // 上正三位数 Last_3_Straight_1st_VNC
        2099: 'លេខបីខ្ទង់លើ', // 上反三位数 Last_3_Combine_1st_VNC
        2102: 'តួលេខពីរខ្ទង់', // 上正二位数 Last_2_Straight_1st_VNC
        2104: 'អវិជ្ជមានលេខពីរខ្ទង់', // 下正二位数 Last_2_Straight_2nd_VNC
        2107: 'រត់ពីរខ្ទង់', // 上跑两位数 Last_2_Any_1st_VNC
        2109: 'រត់ពីរខ្ទង់ខាងក្រោម', // 下跑两位数 Last_2_Any_2nd_VNC

        // LAO 老挝彩
        2127: 'លេខ4', // 四数
        2132: 'លេខ3', // 三数
        2137: 'លេខ2', // 二数
        2142: 'ចំនួនរត់', // 跑数

        2129: 'តួលេខពបួនខ្ទង់', // 上正四位数 Last_4_Straight_LAO
        2131: 'លេខបួនខ្ទង់លើ', // 上反四位数 Last_4_Combine_LAO
        2134: 'តួលេខបីខ្ទង់', // 上正三位数 Last_3_Straight_LAO
        2136: 'លេខបីខ្ទង់លើ', // 上反三位数 Last_3_Combine_LAO
        2139: 'តួលេខពីខ្ទង់', // 上正二位数 Last_2_Straight_LAO
        2141: 'លេខពីរខ្ទង់ក្រោម', // 下正二位数 First_2_Straight_LAO
        2144: 'រត់ពីរខ្ទង់ខាងលើ', // 上跑两位数 Last_2_Any_LAO
        2146: 'រត់ពីរខ្ទង់ខាងក្រោម', // 下跑两位数 First_2_Any_LAO
    },
};

export default PlayMenu;
