const PlayMenu = {
  playId: {
    // Thai
    2056: 'เหมือนกัน', // 上正
    2058: 'ตองใดๆ', // 上反
    2061: 'เหมือนกัน',  // 上正
    2063: 'ตองใดๆ', // 上反
    2065: 'ล่าง',
    2068: 'บน',
    2055: 'สามตัว', // 三数
    2057: 'สามตัวบน',
    2059: 'สามตัวโต๊ด',
    2060: 'สองตัว', // 二数
    2062: 'สองตัวบน',
    2064: 'สองตัวโต๊ด',
    2066: 'สองตัวล่าง',
    2067: 'เลขวิ่ง', // 跑数
    2069: 'วิ่ง 3 ตัวบน',
    2480: 'บรรทัดฐาน สองตัวล่าง',
    2481: 'ป้อนด้วยตนเอง สองตัวล่าง',
    2482: 'บรรทัดฐาน สองตัวบนโต๊ด',
    2483: 'บรรทัดฐาน  สองตัวบน',
    2484: 'ป้อนด้วยตนเอง  สองตัวบน',
    2485: 'บรรทัดฐาน สามตัวบน',
    2486: 'ป้อนด้วยตนเอง สามตัวบน',
    2487: 'บรรทัดฐาน สามตัวโต้ด',

    2297: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2298: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2299: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2497: 'ซุปเปอร์กำถั่ว', // 番摊
    2498: 'Fan',
    2499: 'Fan',
    2500: 'Kwok',
    2501: 'Kwok',
    2502: 'Nim',
    2503: 'Nim',
    2504: 'ใหญ่เล็กคี่คู่',
    2505: 'ใหญ่เล็กคี่คู่',

    // vnc 越南彩

    // 一級選單

    2090: 'สี่ตัว', // 四数
    2095: 'สามตัว', // 三数
    2100: 'สองตัว', // 二数
    2105: 'เลขวิ่ง', // 跑数

    2515: 'ทุกรางวัล', // 包膽 北部
    2528: 'ทุกรางวัล', // 包膽 中南部

    2550: 'ตัวไม่ตรง', // 北部 逆向 - 一級選單
    2560: 'ตัวไม่ตรง', // 中南部 逆向 - 一級選單

    2598: 'พาร์เลย์', // 北部 串组 - 一級選單
    2608: 'พาร์เลย์', // 中南部 串组 - 一級選單

    2300: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2488: 'ซุปเปอร์กำถั่ว', // 番摊

    // 二級選單

    2091: 'เหมือนกัน', // 四数 上正
    2093: 'ตองใดๆ', // 四数 上反
    2096: 'เหมือนกัน', // 三数 上正
    2098: 'ตองใดๆ', // 三数 上反
    2101: 'เหมือนกัน', // 二数 上正
    2103: 'เหมือนกัน', // 二数 下正

    2301: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2489: 'Fan', // 番
    2491: 'Kwok', // 角
    2493: 'Nim', // 念
    2495: 'ใหญ่เล็กคี่คู่', // 大小单双

    2516: 'เลขท้าย2ตัว', // 北部 后二包胆
    2520: 'เลขท้าย3ตัว', // 北部 后三包胆
    2524: 'เลขท้าย4ตัว', // 北部 后四包胆

    2551: 'ไม่ตรงทั้ง4ตัว', // 北部 - 四不中 - 二級選單
    2554: 'ไม่ตรงทั้ง8ตัว', // 北部 - 八不中 - 二級選單
    2557: 'ไม่ตรงทั้ง10ตัว', // 北部 - 十不中 - 二級選單

    2599: 'พาร์เลย์ 2', // 北部 - 串2组 - 二級選單
    2602: 'พาร์เลย์ 3', // 北部 - 串3组 - 二級選單
    2605: 'พาร์เลย์ 4', // 北部 - 串4组 - 二級選單

    2584: '2D รางวัลที่ และพิเศษ', // 北部 - 二数头尾 - 二級選單

    2529: 'เลขท้าย2ตัว', // 中南部 后二包胆
    2533: 'เลขท้าย3ตัว', // 中南部 后三包胆
    2537: 'เลขท้าย4ตัว', // 中南部 后四包胆

    2561: 'ไม่ตรงทั้ง4ตัว',  // 中南部 - 四不中 - 二級選單
    2564: 'ไม่ตรงทั้ง8ตัว',  // 中南部 - 八不中 - 二級選單
    2567: 'ไม่ตรงทั้ง10ตัว',  // 中南部 - 十不中 - 二級選單

    2609: 'พาร์เลย์ 2', // 中南部 - 串2组 - 二級選單
    2612: 'พาร์เลย์ 3', // 中南部 - 串3组 - 二級選單
    2615: 'พาร์เลย์ 4', // 中南部 - 串4组 - 二級選單

    2591: '2D รางวัลที่ และพิเศษ', // 中南部 - 二数头尾 - 二級選單

    // 跑數二級選單目前不會使用到
    2106: '一等二星不定位', // 跑數二級選單
    2108: '二等二星不定位', // 跑數二級選單

    2579: '特等二星不定位', // 特等一等 - 十位個位 - 跑數 - 二級選單

    // 以下在東南亞彩是屬於三級選單直選，在越南彩才是屬於二級選單
    2092: '4 ตัวบน', // 上正四位数 Last_4_Straight_1st_VNC
    2094: '4 ตัวบนโต๊ด', // 上反四位数 Last_4_Combine_1st_VNC
    2097: 'สามตัวบน', // 上正三位数 Last_3_Straight_1st_VNC
    2099: 'สามตัวโต๊ด', // 上反三位数 Last_3_Combine_1st_VNC
    2102: 'สองตัวบน', // 上正二位数 Last_2_Straight_1st_VNC
    2104: 'สองตัวล่าง', // 下正二位数 Last_2_Straight_2nd_VNC
    2107: 'วิ่งบน', // 上跑两位数 Last_2_Any_1st_VNC
    2109: 'วิ่งล่าง', // 下跑两位数 Last_2_Any_2nd_VNC

    2601: 'พาร์เลย์ 2', // 北部 串2组 Bunch_2_North_VNC
    2604: 'พาร์เลย์ 3', // 北部 串3组 Bunch_3_North_VNC
    2607: 'พาร์เลย์ 4', // 北部 串4组 Bunch_4_North_VNC
    2611: 'พาร์เลย์ 2', // 中南部 串2组 Bunch_2_South_VNC
    2614: 'พาร์เลย์ 3', // 中南部 串3组 Bunch_3_South_VNC
    2617: 'พาร์เลย์ 4', // 中南部 串4组 Bunch_4_South_VNC

    2552: 'ไม่ตรงทั้ง4ตัว', // 北部 - 四不中
    2555: 'ไม่ตรงทั้ง8ตัว', // 北部 - 八不中
    2558: 'ไม่ตรงทั้ง10ตัว', // 北部 - 十不中
    2562: 'ไม่ตรงทั้ง4ตัว', // 中南部 - 四不中
    2565: 'ไม่ตรงทั้ง8ตัว', // 中南部 - 八不中
    2568: 'ไม่ตรงทั้ง10ตัว', // 中南部 - 十不中

    2517: 'เลขท้าย2ตัว', // 北部 后二包胆
    2521: 'เลขท้าย3ตัว', // 北部 后三包胆
    2525: 'เลขท้าย4ตัว', // 北部 后四包胆
    2530: 'เลขท้าย2ตัว', // 中南部 后二包胆
    2534: 'เลขท้าย3ตัว', // 中南部 后三包胆
    2538: 'เลขท้าย4ตัว', // 中南部 后四包胆

    2586: '2D รางวัลที่ และพิเศษ', // 北部 二数头尾 Last_2_1st_7th_North_VNC
    2589: 'พิเศษเลขท้าย2ตัว', // 北部 二数头 Last_2_7th_North_VNC
    2593: '2D รางวัลที่ และพิเศษ', // 中南部 二数头尾 Last_2_1st_8th_South_VNC
    2596: 'พิเศษเลขท้าย2ตัว', // 中南部 二数头 Last_2_8th_South_VNC

    2580: 'เลขวิ่ง หลักสิบ', // 特等十位 Ten_Digit_1st_VNC
    2581: 'เลขวิ่ง หลักหน่วย', // 特等个位 Unit_Digit_1st_VNC
    2582: 'รางวัลที่1 หลักสิบ', // 一等十位 Ten_Digit_2nd_VNC
    2583: 'รางวัลที่1 หลักหน่วย', // 一等个位 Unit_Digit_2nd_VNC

    2302: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2490: 'Fan', // 番
    2492: 'Kwok', // 角
    2494: 'Nim', // 念
    2496: 'ใหญ่เล็กคี่คู่', // 大小单双

    // 三級選單

    // 北部
    2518: 'เลขท้าย2ตัว บรรทัดฐาน', // 北部 后二包胆(复式)
    2519: 'เลขท้าย2ตัว ป้อนด้วยตนเอง', // 北部 后二包胆(单式)
    2522: 'เลขท้าย3ตัว บรรทัดฐาน', // 北部 后三包胆（复式）
    2523: 'เลขท้าย3ตัว ป้อนด้วยตนเอง', // 北部 后三包胆（单式）
    2526: 'เลขท้าย4ตัว บรรทัดฐาน', // 北部 后四包胆（复式）
    2527: 'เลขท้าย4ตัว ป้อนด้วยตนเอง', // 北部 后四包胆（单式）

    2553: 'ไม่ตรงทั้ง4ตัว ป้อนด้วยตนเอง', // 北部 - 四不中(单式) - 三級選單
    2556: 'ไม่ตรงทั้ง8ตัว ป้อนด้วยตนเอง', // 北部 - 八不中(单式) - 三級選單
    2559: 'ไม่ตรงทั้ง10ตัว ป้อนด้วยตนเอง', // 北部 - 十不中(单式) - 三級選單

    2587: 'บรรทัดฐาน 2D รางวัลที่ และพิเศษ', // 北部 二数头尾（复式) Last_2_1st_7th_North_VNC_Multi
    2590: 'บรรทัดฐาน พิเศษเลขท้าย2ตัว', // 北部 二数头（复式) Last_2_7th_North_VNC_Multi

    // 中南部
    2531: 'เลขท้าย2ตัว บรรทัดฐาน', // 中南部 后二包胆(复式)
    2532: 'เลขท้าย2ตัว ป้อนด้วยตนเอง', // 中南部 后二包胆(单式)
    2535: 'เลขท้าย3ตัว บรรทัดฐาน', // 中南部 后三包胆（复式）
    2536: 'เลขท้าย3ตัว ป้อนด้วยตนเอง', // 中南部 后三包胆（单式）
    2539: 'เลขท้าย4ตัว บรรทัดฐาน', // 中南部 后四包胆（复式）
    2540: 'เลขท้าย4ตัว ป้อนด้วยตนเอง', // 中南部 后四包胆（单式）

    2563: 'ไม่ตรงทั้ง4ตัว ป้อนด้วยตนเอง', // 中南部 - 四不中(单式) - 三級選單
    2566: 'ไม่ตรงทั้ง8ตัว ป้อนด้วยตนเอง', // 中南部 - 八不中(单式) - 三級選單
    2569: 'ไม่ตรงทั้ง10ตัว ป้อนด้วยตนเอง', // 中南部 - 十不中(单式) - 三級選單

    2594: 'บรรทัดฐาน 2D รางวัลที่ และพิเศษ', // 中南部 二数头尾（复式) Last_2_1st_8th_South_VNC_Multi
    2597: 'บรรทัดฐาน พิเศษเลขท้าย2ตัว', // 中南部 二数头(复式) Last_2_8th_South_VNC_Multi

    // 以下不分南北部
    2286: 'บรรทัดฐาน 4 ตัวบน', // 上正四位数（复式）Last_4_Straight_1st_VNC_Multi
    2287: 'ป้อนด้วยตนเอง 4 ตัวบน', // 上正四位数（单式）Last_4_Straight_1st_VNC_Single

    2284: 'บรรทัดฐาน สามตัวบน', // 上正三位数（复式）Last_3_Straight_1st_VNC_Multi
    2285: 'ป้อนด้วยตนเอง สามตัวบน', // 上正三位数（单式）Last_3_Straight_1st_VNC_Single
    2283: 'บรรทัดฐาน สามตัวโต้ด', // Last_3_Combine_1st_VNC_Multi

    2279: 'บรรทัดฐาน สองตัวบน', // 上正二位数(复式) Last_2_Straight_1st_VNC_Multi
    2280: 'ป้อนด้วยตนเอง สองตัวบน', // 上正二位数（单式）Last_2_Straight_1st_VNC_Single
    2281: 'บรรทัดฐาน สองตัวล่าง', // 下正二位数（复式）Last_2_Straight_2nd_VNC_Multi
    2282: 'ป้อนด้วยตนเอง สองตัวล่าง', // 下正二位数（单式）Last_2_Straight_2nd_VNC_Single

    // LAO 老挝彩
    2127: 'สี่ตัว', // 四数
    2132: 'สามตัว', // 三数
    2137: 'สองตัว', // 二数
    2142: 'เลขวิ่ง', // 跑数

    2128: 'เหมือนกัน', // 上正
    2130: 'ตองใดๆ', // 上反
    2133: 'เหมือนกัน', // 上正
    2135: 'ตองใดๆ', // 上反
    2138: 'เหมือนกัน', // 上正
    2140: 'เหมือนกัน', // 下正

    2129: ' 4 ตัวบน', // 上正四位数 Last_4_Straight_LAO
    2131: ' 4 ตัวบนโต๊ด', // 上反四位数 Last_4_Combine_LAO
    2134: 'สามตัวบน', // 上正三位数 Last_3_Straight_LAO
    2136: 'สามตัวโต๊ด', // 上反三位数 Last_3_Combine_LAO
    2139: 'สองตัวบน', // 上正二位数 Last_2_Straight_LAO
    2141: 'สองตัวล่าง', // 下正二位数 First_2_Straight_LAO
    2144: 'วิ่งบน', // 上跑两位数 Last_2_Any_LAO
    2146: 'วิ่งล่าง', // 下跑两位数 First_2_Any_LAO

    2288: 'บรรทัดฐาน สองตัวบน', // Last_2_Straight_LAO_Multi
    2289: 'ป้อนด้วยตนเอง สองตัวบน', // Last_2_Straight_LAO_Single
    2290: 'บรรทัดฐาน สองตัวล่าง', // First_2_Straight_LAO_Multi
    2291: 'ป้อนด้วยตนเอง สองตัวล่าง', // First_2_Straight_LAO_Single
    2292: 'บรรทัดฐาน สามตัวโต้ด', // Last_3_Combine_LAO_Multi
    2293: 'บรรทัดฐาน สามตัวบน', // Last_3_Straight_LAO_Multi
    2294: 'ป้อนด้วยตนเอง สามตัวบน', // Last_3_Straight_LAO_Single
    2295: 'บรรทัดฐาน 4 ตัวบน', // Last_4_Straight_LAO_Multi
    2296: 'ป้อนด้วยตนเอง 4 ตัวบน', // Last_4_Straight_LAO_Single

    2303: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2304: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2305: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2506: 'ซุปเปอร์กำถั่ว', // 番摊
    2507: 'Fan',
    2508: 'Fan',
    2509: 'Kwok',
    2510: 'Kwok',
    2511: 'Nim',
    2512: 'Nim',
    2513: 'ใหญ่เล็กคี่คู่',
    2514: 'ใหญ่เล็กคี่คู่',
  },
};

export default PlayMenu;
