const PlayMenu = {
  playId: {
    // Thai
    2056: 'เหมือนกัน', // 上正
    2058: 'ตองใดๆ', // 上反
    2061: 'เหมือนกัน',  // 上正
    2063: 'ตองใดๆ', // 上反
    2065: 'ล่าง',
    2068: 'บน',
    2055: 'สามตัว', // 三数
    2057: 'สามตัวบน',
    2059: 'สามตัวโต๊ด',
    2060: 'สองตัว', // 二数
    2062: 'สองตัวบน',
    2064: 'สองตัวโต๊ด',
    2066: 'สองตัวล่าง',
    2067: 'เลขวิ่ง', // 跑数
    2069: 'วิ่ง 3 ตัวบน',
    2480: 'บรรทัดฐาน สองตัวล่าง',
    2481: 'ป้อนด้วยตนเอง สองตัวล่าง',
    2482: 'บรรทัดฐาน สองตัวบนโต๊ด',
    2483: 'บรรทัดฐาน  สองตัวบน',
    2484: 'ป้อนด้วยตนเอง  สองตัวบน',
    2485: 'บรรทัดฐาน สามตัวบน',
    2486: 'ป้อนด้วยตนเอง สามตัวบน',
    2487: 'บรรทัดฐาน สามตัวโต้ด',

    2297: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2298: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2299: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2497: 'ซุปเปอร์กำถั่ว', //番摊
    2498: 'Fan',
    2499: 'Fan',
    2500: 'Kwok',
    2501: 'Kwok',
    2502: 'Nim',
    2503: 'Nim',
    2504: 'ใหญ่เล็กคี่คู่',
    2505: 'ใหญ่เล็กคี่คู่',

    // vnc 越南彩
    2090: 'สี่ตัว', // 四数
    2095: 'สามตัว', // 三数
    2100: 'สองตัว', // 二数
    2105: 'เลขวิ่ง', // 跑数

    2091: 'เหมือนกัน', // 上正
    2093: 'ตองใดๆ', // 上反
    2096: 'เหมือนกัน', // 上正
    2098: 'ตองใดๆ', // 上反
    2101: 'เหมือนกัน', // 上正
    2103: 'เหมือนกัน', // 下正

    2092: ' 4 ตัวบน', // 上正四位数 Last_4_Straight_1st_VNC
    2094: ' 4 ตัวบนโต๊ด', // 上反四位数 Last_4_Combine_1st_VNC
    2097: 'สามตัวบน', // 上正三位数 Last_3_Straight_1st_VNC
    2099: 'สามตัวโต๊ด', // 上反三位数 Last_3_Combine_1st_VNC
    2102: 'สองตัวบน', // 上正二位数 Last_2_Straight_1st_VNC
    2104: 'สองตัวล่าง', // 下正二位数 Last_2_Straight_2nd_VNC
    2107: 'วิ่งบน', // 上跑两位数 Last_2_Any_1st_VNC
    2109: 'วิ่งล่าง', // 下跑两位数 Last_2_Any_2nd_VNC

    2286: 'บรรทัดฐาน 4 ตัวบน', // Last_4_Straight_1st_VNC_Multi
    2287: 'ป้อนด้วยตนเอง 4 ตัวบน', // Last_4_Straight_1st_VNC_Single
    2285: 'ป้อนด้วยตนเอง สามตัวบน', // Last_3_Straight_1st_VNC_Single
    2284: 'บรรทัดฐาน สามตัวบน', // Last_3_Straight_1st_VNC_Multi
    2283: 'บรรทัดฐาน สามตัวโต้ด', // Last_3_Combine_1st_VNC_Multi
    2280: 'ป้อนด้วยตนเอง สองตัวบน', // Last_2_Straight_1st_VNC_Single
    2279: 'บรรทัดฐาน สองตัวบน', // Last_2_Straight_1st_VNC_Multi
    2282: 'ป้อนด้วยตนเอง สองตัวล่าง', // Last_2_Straight_2nd_VNC_Single
    2281: 'บรรทัดฐาน สองตัวล่าง', // Last_2_Straight_2nd_VNC_Multi


    2300: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2301: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2302: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2488: 'ซุปเปอร์กำถั่ว', //番摊
    2489: 'Fan',
    2490: 'Fan',
    2491: 'Kwok',
    2492: 'Kwok',
    2493: 'Nim',
    2494: 'Nim',
    2495: 'ใหญ่เล็กคี่คู่',
    2496: 'ใหญ่เล็กคี่คู่',

    // 北部
    2515: 'ทุกรางวัล', // 包膽
    2516: 'เลขท้าย2ตัว', // 后二包胆
    2517: 'เลขท้าย2ตัว', // 后二包胆
    2518: 'เลขท้าย2ตัว บรรทัดฐาน', // 后二包胆(复式)
    2519: 'เลขท้าย2ตัว ป้อนด้วยตนเอง', // 后二包胆(单式)
    2520: 'เลขท้าย3ตัว', // 后三包胆
    2521: 'เลขท้าย3ตัว', // 后三包胆
    2522: 'เลขท้าย3ตัว บรรทัดฐาน', // 后三包胆（复式）
    2523: 'เลขท้าย3ตัว ป้อนด้วยตนเอง', // 后三包胆（单式）
    2524: 'เลขท้าย4ตัว', // 后四包胆
    2525: 'เลขท้าย4ตัว', // 后四包胆
    2526: 'เลขท้าย4ตัว บรรทัดฐาน', // 后四包胆（复式）
    2527: 'เลขท้าย4ตัว ป้อนด้วยตนเอง', // 后四包胆（单式）
    // 中南部
    2528: 'ทุกรางวัล', // 包膽
    2529: 'เลขท้าย2ตัว', // 后二包胆
    2530: 'เลขท้าย2ตัว', // 后二包胆
    2531: 'เลขท้าย2ตัว บรรทัดฐาน', // 后二包胆(复式)
    2532: 'เลขท้าย2ตัว ป้อนด้วยตนเอง', // 后二包胆(单式)
    2533: 'เลขท้าย3ตัว', // 后三包胆
    2534: 'เลขท้าย3ตัว', // 后三包胆
    2535: 'เลขท้าย3ตัว บรรทัดฐาน', // 后三包胆（复式）
    2536: 'เลขท้าย3ตัว ป้อนด้วยตนเอง', // 后三包胆（单式）
    2537: 'เลขท้าย4ตัว', // 后四包胆
    2538: 'เลขท้าย4ตัว', // 后四包胆
    2539: 'เลขท้าย4ตัว บรรทัดฐาน', // 后四包胆（复式）
    2540: 'เลขท้าย4ตัว ป้อนด้วยตนเอง', // 后四包胆（单式）

    // LAO 老挝彩
    2127: 'สี่ตัว', // 四数
    2132: 'สามตัว', // 三数
    2137: 'สองตัว', // 二数
    2142: 'เลขวิ่ง', // 跑数

    2128: 'เหมือนกัน', // 上正
    2130: 'ตองใดๆ', // 上反
    2133: 'เหมือนกัน', // 上正
    2135: 'ตองใดๆ', // 上反
    2138: 'เหมือนกัน', // 上正
    2140: 'เหมือนกัน', // 下正

    2129: ' 4 ตัวบน', // 上正四位数 Last_4_Straight_LAO
    2131: ' 4 ตัวบนโต๊ด', // 上反四位数 Last_4_Combine_LAO
    2134: 'สามตัวบน', // 上正三位数 Last_3_Straight_LAO
    2136: 'สามตัวโต๊ด', // 上反三位数 Last_3_Combine_LAO
    2139: 'สองตัวบน', // 上正二位数 Last_2_Straight_LAO
    2141: 'สองตัวล่าง', // 下正二位数 First_2_Straight_LAO
    2144: 'วิ่งบน', // 上跑两位数 Last_2_Any_LAO
    2146: 'วิ่งล่าง', // 下跑两位数 First_2_Any_LAO

    2288: 'บรรทัดฐาน สองตัวบน', // Last_2_Straight_LAO_Multi
    2289: 'ป้อนด้วยตนเอง สองตัวบน', // Last_2_Straight_LAO_Single
    2290: 'บรรทัดฐาน สองตัวล่าง', // First_2_Straight_LAO_Multi
    2291: 'ป้อนด้วยตนเอง สองตัวล่าง', // First_2_Straight_LAO_Single
    2292: 'บรรทัดฐาน สามตัวโต้ด', // Last_3_Combine_LAO_Multi
    2293: 'บรรทัดฐาน สามตัวบน', // Last_3_Straight_LAO_Multi
    2294: 'ป้อนด้วยตนเอง สามตัวบน', // Last_3_Straight_LAO_Single
    2295: 'บรรทัดฐาน 4 ตัวบน', // Last_4_Straight_LAO_Multi
    2296: 'ป้อนด้วยตนเอง 4 ตัวบน', // Last_4_Straight_LAO_Single

    2303: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2304: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2305: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2506: 'ซุปเปอร์กำถั่ว', //番摊
    2507: 'Fan',
    2508: 'Fan',
    2509: 'Kwok',
    2510: 'Kwok',
    2511: 'Nim',
    2512: 'Nim',
    2513: 'ใหญ่เล็กคี่คู่',
    2514: 'ใหญ่เล็กคี่คู่',
  },
};

export default PlayMenu;
