const PlayMenu = {
  playId: {
    // VTX
    2675: 'ไฮโลเวียดนาม',
    2676: 'ใหญ่เล็ก',

    // VXD
    2677: 'เหรียญสีนำโชค',
    2678: 'ใหญ่เล็ก',
    2679: 'คี่คู่',
    2680: 'แดงทั้งหมด',
    2681: 'เหรียญขาว',
    2682: 'เหรียญขาว 3+ เหรียญแดง 1',
    2683: 'เหรียญแดง 3+ เหรียญขาว 1',

    // VBC 魚蝦蟹
    2733: 'น้ำเต้าปูปลา',
    2734: 'น้ำเต้าปูปลา',

    // CLR
    3058: 'Color',
    3059: 'Color',

    // SEA SEA V2 TL(天龍)

    // 一級選單

    // TL2D

    2735: 'เลขวิ่ง', // SEA TL2D 一星
    2741: 'สองตัว', // SEA TL2D 二星
    2746: 'การรวมกัน', // SEA TL2D 趣味

    // TL3D

    2684: 'สองตัว', // SEA TL3D 二数
    2689: 'สามตัว', // SEA TL3D 三数
    2694: 'เลขวิ่ง', // SEA TL3D 跑数
    2750: 'การรวมกัน', // SEA TL3D 趣味

    // TL4D

    2697: 'สองตัว', // SEA TL4D 二数
    2702: 'สามตัว', // SEA TL4D 三数
    2707: 'สี่ตัว', // SEA TL4D 四数
    2712: 'เลขวิ่ง', // SEA TL4D 跑数
    2755: 'การรวมกัน', // SEA TL4D 趣味

    // TL6D

    2715: 'สองตัว', // SEA TL6D 二数
    2720: 'สามตัว', // SEA TL6D 三数
    2725: 'สี่ตัว', // SEA TL6D 四数
    2730: 'เลขวิ่ง', // SEA TL6D 跑数
    2761: 'การรวมกัน', // SEA TL6D 趣味

    // TL642

    2894: '3 Digits', // SEA TL642 Lucky Pick
    2901: '2 Digits', // SEA TL642 3D
    2908: '1 Digit', // SEA TL642 2D
    3034: 'โชคดี', // SEA TL642 1D

    // TL645

    2918: 'โชคดี', // SEA TL645 Lucky Pick
    2923: '3 Digits', // SEA TL645 3D
    2930: '2 Digits', // SEA TL645 2D
    2937: '1 Digit', // SEA TL645 1D

    // TL649

    2947: 'โชคดี', // SEA TL649 Lucky Pick
    2952: '3 Digits', // SEA TL649 3D
    2959: '2 Digits', // SEA TL649 2D
    2966: '1 Digit', // SEA TL649 1D

    // TL655

    2976: 'โชคดี', // SEA TL655 Lucky Pick
    2981: '3 Digits', // SEA TL655 3D
    2988: '2 Digits', // SEA TL655 2D
    2995: '1 Digit', // SEA TL655 1D

    // TL658

    3005: 'โชคดี', // SEA TL658 Lucky Pick
    3010: '3 Digits', // SEA TL658 3D
    3017: '2 Digits', // SEA TL658 2D
    3024: '1 Digit', // SEA TL658 1D

    // TL2D37

    3039: 'เลขวิ่ง', // SEA TL2D37 一星
    3045: 'สองตัว', // SEA TL2D37 二星
    3050: 'การรวมกัน', // SEA TL2D37 趣味

    // 二級選單

    // TL2D

    2736: 'EXACT 1D', // SEA TL2D 定位胆
    2739: 'เลือก', // SEA TL2D 任选
    2742: 'ตัวบน', // SEA TL2D 二星直选
    2744: 'ตัวบนโต๊ด', // SEA TL2D 二星组选
    2747: 'BSOE', // SEA TL2D 大小单双

    // TL3D

    2685: 'ตัวบน', // SEA TL3D 后二直选
    2687: 'ตัวบนโต๊ด', // SEA TL3D 后二组选
    2690: 'ตัวบน', // SEA TL3D 后三直选
    2692: 'ตัวบนโต๊ด', // SEA TL3D 后三组选
    2695: 'ตัวบนโต๊ด', // SEA TL3D 后二不定位
    2751: 'BSOE', // SEA TL3D 大小单双
    2776: 'EXACT 1D', // SEA TL3D 定位胆

    // TL4D

    2698: 'ตัวบน', // SEA TL4D 后二直选
    2700: 'ตัวบนโต๊ด', // SEA TL4D 后二组选
    2703: 'ตัวบน', // SEA TL4D 后三直选
    2705: 'ตัวบนโต๊ด', // SEA TL4D 后三组选
    2708: 'ตัวบน', // SEA TL4D 后四直选
    2710: 'ตัวบนโต๊ด', // SEA TL4D 后四组选
    2713: 'ตัวบนโต๊ด', // SEA TL4D 后二不定位
    2756: 'BSOE', // SEA TL4D 大小单双
    2780: 'EXACT 1D', // SEA TL4D 定位胆

    // TL6D

    2716: 'ตัวบน', // SEA TL6D 后二直选
    2718: 'ตัวบนโต๊ด', // SEA TL6D 后二组选
    2721: 'ตัวบน', // SEA TL6D 后三直选
    2723: 'ตัวบนโต๊ด', // SEA TL6D 后三组选
    2726: 'ตัวบน', // SEA TL6D 后四直选
    2728: 'ตัวบนโต๊ด', // SEA TL6D 后四组选
    2731: 'ตัวบนโต๊ด', // SEA TL6D 后二不定位
    2762: 'BSOE', // SEA TL6D 大小单双
    2785: 'EXACT 1D', // SEA TL6D 定位胆

    // TL642

    2895: 'ตรง', // SEA TL642 Lucky Pick 3
    2898: 'ความผสม 3 ตัวท้าย ', // SEA TL642 Lucky Pick 12
    2902: 'ตรง', // SEA TL642 Straight
    2905: 'ความผสม 3 ตัวท้าย ', // SEA TL642 Any
    2909: 'ตำแหน่ง', // SEA TL642 Straight
    2916: 'ใดๆ', // SEA TL642 Any
    3035: 'ลัคกี้ปิ๊ก 3 ตัว', // SEA TL642 Fixed Position
    3037: 'ลัคกี้ปิ๊ก 12 ตัว', // SEA TL642 Any

    // TL645

    2919: 'ลัคกี้ปิ๊ก 3 ตัว', // SEA TL645 Lucky Pick 3
    2921: 'ลัคกี้ปิ๊ก 12 ตัว', // SEA TL645 Lucky Pick 12
    2924: 'ตรง', // SEA TL645 Straight
    2927: 'ความผสม 3 ตัวท้าย ', // SEA TL645 Any
    2931: 'ตรง', // SEA TL645 Straight
    2934: 'ความผสม 3 ตัวท้าย ', // SEA TL645 Any
    2938: 'ตำแหน่ง', // SEA TL645 Fixed Position
    2945: 'ใดๆ', // SEA TL645 Any

    // TL649

    2948: 'ลัคกี้ปิ๊ก 3 ตัว', // SEA TL649 Lucky Pick 3
    2950: 'ลัคกี้ปิ๊ก 12 ตัว', // SEA TL649 Lucky Pick 12
    2953: 'ตรง', // SEA TL649 Straight
    2956: 'ความผสม 3 ตัวท้าย ', // SEA TL649 Any
    2960: 'ตรง', // SEA TL649 Straight
    2963: 'ความผสม 3 ตัวท้าย ', // SEA TL649 Any
    2967: 'ตำแหน่ง', // SEA TL649 Fixed Position
    2974: 'ใดๆ', // SEA TL649 Any

    // TL655

    2977: 'ลัคกี้ปิ๊ก 3 ตัว', // SEA TL655 Lucky Pick 3
    2979: 'ลัคกี้ปิ๊ก 12 ตัว', // SEA TL655 Lucky Pick 12
    2982: 'ตรง', // SEA TL655 Straight
    2985: 'ความผสม 3 ตัวท้าย ', // SEA TL655 Any
    2989: 'ตรง', // SEA TL655 Straight
    2992: 'ความผสม 3 ตัวท้าย ', // SEA TL655 Any
    2996: 'ตำแหน่ง', // SEA TL655 Fixed Position
    3003: 'ใดๆ', // SEA TL655 Any

    // TL658

    3006: 'ลัคกี้ปิ๊ก 3 ตัว', // SEA TL658 Lucky Pick 3
    3008: 'ลัคกี้ปิ๊ก 12 ตัว', // SEA TL658 Lucky Pick 12
    3011: 'ตรง', // SEA TL658 Straight
    3014: 'ความผสม 3 ตัวท้าย ', // SEA TL658 Any
    3018: 'ตรง', // SEA TL658 Straight
    3021: 'ความผสม 3 ตัวท้าย ', // SEA TL658 Any
    3025: 'ตำแหน่ง', // SEA TL658 Fixed Position
    3032: 'ใดๆ', // SEA TL658 Any

    // TL2D37

    3040: 'EXACT 1D', // SEA TL2D37 定位胆
    3043: 'เลือก', // SEA TL2D37 任选
    3046: 'ตัวบน', // SEA TL2D37 二星直选
    3048: 'ตัวบนโต๊ด', // SEA TL2D37 二星组选
    3051: 'BSOE', // SEA TL2D37 大小单双

    // 三級選單

    // TL2D

    2737: 'EXACT 1D 1st', // SEA TL2D 第一球
    2738: 'EXACT 1D 2nd', // SEA TL2D 第二球
    2740: 'เลือก', // SEA TL2D 任选一
    2743: 'EXACT 2D', // SEA TL2D 二星直选
    2745: 'ANY 2D', // SEA TL2D 二星组选
    2748: 'BSOE 1st', // SEA TL2D 第一球
    2749: 'BSOE 2nd', // SEA TL2D 第二球

    // TL3D

    2686: 'EXACT Last 2D', // SEA TL3D 上正二位数
    2688: 'ANY Last 2D', // SEA TL3D 上反二位数
    2691: 'EXACT 3D', // SEA TL3D 上正三位数
    2693: 'ANY 3D', // SEA TL3D 上反三位数
    2696: 'วิ่งบน', // SEA TL3D 上跑两位数
    2752: 'BSOE 1st', // SEA TL3D 第一球
    2753: 'BSOE 2nd', // SEA TL3D 第二球
    2754: 'BSOE 3rd', // SEA TL3D 第三球
    2777: 'EXACT 1D 1st', // SEA TL3D 第一位
    2778: 'EXACT 1D 2nd', // SEA TL3D 第二位
    2779: 'EXACT 1D 3rd', // SEA TL3D 第三位
    2863: 'Rambolito3', // SEA TL3D 三星組3
    2864: 'Rambolito6', // SEA TL3D 三星組6

    // TL4D

    2699: 'EXACT Last 2D', // SEA TL4D 上正二位数
    2701: 'ANY Last 2D', // SEA TL4D 上反二位数
    2704: 'EXACT Last 3D', // SEA TL4D 上正三位数
    2706: 'ANY Last 3D', // SEA TL4D 上反三位数
    2709: 'EXACT 4D', // SEA TL4D 上正四位数
    2711: 'ANY 4D', // SEA TL4D 上反四位数
    2714: 'วิ่งบน', // SEA TL4D 上跑两位数
    2757: 'BSOE 1st', // SEA TL4D 第一球
    2758: 'BSOE 2nd', // SEA TL4D 第二球
    2759: 'BSOE 3rd', // SEA TL4D 第三球
    2760: 'BSOE 4th', // SEA TL4D 第四球
    2781: 'EXACT 1D 1st', // SEA TL4D 第一位
    2782: 'EXACT 1D 2nd', // SEA TL4D 第二位
    2783: 'EXACT 1D 3rd', // SEA TL4D 第三位
    2784: 'EXACT 1D 4th', // SEA TL4D 第四位
    2865: 'Rambolito3 Last 3D', // SEA TL4D 三星組3
    2866: 'Rambolito6 Last 3D', // SEA TL4D 三星組6
    2869: 'PERM4 4D', // SEA TL4D 四星組選4
    2870: 'PERM6 4D', // SEA TL4D 四星組選6
    2871: 'PERM12 4D', // SEA TL4D 四星組選12
    2872: 'PERM24 4D', // SEA TL4D 四星組選24

    // TL6D

    2717: 'EXACT Last 2D', // SEA TL6D 上正二位数
    2719: 'ANY Last 2D', // SEA TL6D 上反二位数
    2722: 'EXACT Last 3D', // SEA TL6D 上正三位数
    2724: 'ANY Last 3D', // SEA TL6D 上反三位数
    2727: 'EXACT Last 4D', // SEA TL6D 上正四位数
    2729: 'ANY Last 4D', // SEA TL6D 上反四位数
    2732: 'วิ่งบน', // SEA TL6D 上跑两位数
    2763: 'BSOE 1st', // SEA TL6D 第一球
    2764: 'BSOE 2nd', // SEA TL6D 第二球
    2765: 'BSOE 3rd', // SEA TL6D 第三球
    2766: 'BSOE 4th', // SEA TL6D 第四球
    2767: 'BSOE 5th', // SEA TL6D 第五球
    2768: 'BSOE 6th', // SEA TL6D 第六球
    2786: 'EXACT 1D 1st', // SEA TL6D 第一位
    2787: 'EXACT 1D 2nd', // SEA TL6D 第二位
    2788: 'EXACT 1D 3rd', // SEA TL6D 第三位
    2789: 'EXACT 1D 4th', // SEA TL6D 第四位
    2790: 'EXACT 1D 5th', // SEA TL6D 第五位
    2791: 'EXACT 1D 6th', // SEA TL6D 第六位
    2867: 'Rambolito3 Last 3D', // SEA TL6D 三星組3
    2868: 'Rambolito6 Last 3D', // SEA TL6D 三星組6
    2873: 'PERM4 Last 4D', // SEA TL6D 四星組選4
    2874: 'PERM6 Last 4D', // SEA TL6D 四星組選6
    2875: 'PERM12 Last 4D', // SEA TL6D 四星組選12
    2876: 'PERM24 Last 4D', // SEA TL6D 四星組選24

    // TL642

    2896: 'เลขทายตรง 3 ตัวแรก ', // SEA TL642 Lucky Pick 3
    2897: 'เลขทายตรง 3 ตัวท้าย ', // SEA TL642 Lucky Pick 12
    2899: 'ความผสม 3 ตัวแรก ', // SEA TL642 First 3 Straight
    2900: 'ความผสม 3 ตัวท้าย ', // SEA TL642 Last 3 Straight
    2903: 'เลขทายตรง 2 ตัวแรก ', // SEA TL642 First 3 Any
    2904: 'เลขทายตรง 2 ตัวท้าย ', // SEA TL642 Last 3 Any
    2906: 'ความผสม 2 ตัวแรก ', // SEA TL642 First 2 Straight
    2907: 'ความผสม 2 ตัวท้าย ', // SEA TL642 Last 2 Straight
    2910: 'ตำแหน่ง 1st', // SEA TL642 First 2 Any
    2911: 'ตำแหน่ง 2nd', // SEA TL642 Last 2 Any
    2912: 'ตำแหน่ง 3rd', // SEA TL642 1st
    2913: 'ตำแหน่ง 4th', // SEA TL642 2nd
    2914: 'ตำแหน่ง 5th', // SEA TL642 3rd
    2915: 'ตำแหน่ง 6th', // SEA TL642 4th
    2917: 'ใดๆ', // SEA TL642 5th
    3036: 'ลัคกี้ปิ๊ก 3 ตัว', // SEA TL642 6th
    3038: 'ลัคกี้ปิ๊ก 12 ตัว', // SEA TL642 Any

    // TL645

    2920: 'ลัคกี้ปิ๊ก 3 ตัว', // SEA TL645 Lucky Pick 3
    2922: 'ลัคกี้ปิ๊ก 12 ตัว', // SEA TL645 Lucky Pick 12
    2925: 'เลขทายตรง 3 ตัวแรก ', // SEA TL645 First 3 Straight
    2926: 'เลขทายตรง 3 ตัวท้าย ', // SEA TL645 Last 3 Straight
    2928: 'ความผสม 3 ตัวแรก ', // SEA TL645 First 3 Any
    2929: 'ความผสม 3 ตัวท้าย ', // SEA TL645 Last 3 Any
    2932: 'เลขทายตรง 2 ตัวแรก ', // SEA TL645 First 2 Straight
    2933: 'เลขทายตรง 2 ตัวท้าย ', // SEA TL645 Last 2 Straight
    2935: 'ความผสม 2 ตัวแรก ', // SEA TL645 First 2 Any
    2936: 'ความผสม 2 ตัวท้าย ', // SEA TL645 Last 2 Any
    2939: 'ตำแหน่ง 1st', // SEA TL645 1st
    2940: 'ตำแหน่ง 2nd', // SEA TL645 2nd
    2941: 'ตำแหน่ง 3rd', // SEA TL645 3rd
    2942: 'ตำแหน่ง 4th', // SEA TL645 4th
    2943: 'ตำแหน่ง 5th', // SEA TL645 5th
    2944: 'ตำแหน่ง 6th', // SEA TL645 6th
    2946: 'ใดๆ', // SEA TL645 Any

    // TL649

    2949: 'ลัคกี้ปิ๊ก 3 ตัว', // SEA TL649 Lucky Pick 3
    2951: 'ลัคกี้ปิ๊ก 12 ตัว', // SEA TL649 Lucky Pick 12
    2954: 'เลขทายตรง 3 ตัวแรก ', // SEA TL649 First 3 Straight
    2955: 'เลขทายตรง 3 ตัวท้าย ', // SEA TL649 Last 3 Straight
    2957: 'ความผสม 3 ตัวแรก ', // SEA TL649 First 3 Any
    2958: 'ความผสม 3 ตัวท้าย ', // SEA TL649 Last 3 Any
    2961: 'เลขทายตรง 2 ตัวแรก ', // SEA TL649 First 2 Straight
    2962: 'เลขทายตรง 2 ตัวท้าย ', // SEA TL649 Last 2 Straight
    2964: 'ความผสม 2 ตัวแรก ', // SEA TL649 First 2 Any
    2965: 'ความผสม 2 ตัวท้าย ', // SEA TL649 Last 2 Any
    2968: 'ตำแหน่ง 1st', // SEA TL649 1st
    2969: 'ตำแหน่ง 2nd', // SEA TL649 2nd
    2970: 'ตำแหน่ง 3rd', // SEA TL649 3rd
    2971: 'ตำแหน่ง 4th', // SEA TL649 4th
    2972: 'ตำแหน่ง 5th', // SEA TL649 5th
    2973: 'ตำแหน่ง 6th', // SEA TL649 6th
    2975: 'ใดๆ', // SEA TL649 Any

    // TL655

    2978: 'ลัคกี้ปิ๊ก 3 ตัว', // SEA TL655 Lucky Pick 3
    2980: 'ลัคกี้ปิ๊ก 12 ตัว', // SEA TL655 Lucky Pick 12
    2983: 'เลขทายตรง 3 ตัวแรก ', // SEA TL655 First 3 Straight
    2984: 'เลขทายตรง 3 ตัวท้าย ', // SEA TL655 Last 3 Straight
    2986: 'ความผสม 3 ตัวแรก ', // SEA TL655 First 3 Any
    2987: 'ความผสม 3 ตัวท้าย ', // SEA TL655 Last 3 Any
    2990: 'เลขทายตรง 2 ตัวแรก ', // SEA TL655 First 2 Straight
    2991: 'เลขทายตรง 2 ตัวท้าย ', // SEA TL655 Last 2 Straight
    2993: 'ความผสม 2 ตัวแรก ', // SEA TL655 First 2 Any
    2994: 'ความผสม 2 ตัวท้าย ', // SEA TL655 Last 2 Any
    2997: 'ตำแหน่ง 1st', // SEA TL655 1st
    2998: 'ตำแหน่ง 2nd', // SEA TL655 2nd
    2999: 'ตำแหน่ง 3rd', // SEA TL655 3rd
    3000: 'ตำแหน่ง 4th', // SEA TL655 4th
    3001: 'ตำแหน่ง 5th', // SEA TL655 5th
    3002: 'ตำแหน่ง 6th', // SEA TL655 6th
    3004: 'ใดๆ', // SEA TL655 Any

    // TL658

    3007: 'ลัคกี้ปิ๊ก 3 ตัว', // SEA TL658 Lucky Pick 3
    3009: 'ลัคกี้ปิ๊ก 12 ตัว', // SEA TL658 Lucky Pick 12
    3012: 'เลขทายตรง 3 ตัวแรก ', // SEA TL658 First 3 Straight
    3013: 'เลขทายตรง 3 ตัวท้าย ', // SEA TL658 Last 3 Straight
    3015: 'ความผสม 3 ตัวแรก ', // SEA TL658 First 3 Any
    3016: 'ความผสม 3 ตัวท้าย ', // SEA TL658 Last 3 Any
    3019: 'เลขทายตรง 2 ตัวแรก ', // SEA TL658 First 2 Straight
    3020: 'เลขทายตรง 2 ตัวท้าย ', // SEA TL658 Last 2 Straight
    3022: 'ความผสม 2 ตัวแรก ', // SEA TL658 First 2 Any
    3023: 'ความผสม 2 ตัวท้าย ', // SEA TL658 Last 2 Any
    3026: 'ตำแหน่ง 1st', // SEA TL658 1st
    3027: 'ตำแหน่ง 2nd', // SEA TL658 2nd
    3028: 'ตำแหน่ง 3rd', // SEA TL658 3rd
    3029: 'ตำแหน่ง 4th', // SEA TL658 4th
    3030: 'ตำแหน่ง 5th', // SEA TL658 5th
    3031: 'ตำแหน่ง 6th', // SEA TL658 6th
    3033: 'ใดๆ', // SEA TL658 Any

    // TL2D37

    3041: 'EXACT 1D 1st', // SEA TL2D37 第一球
    3042: 'EXACT 1D 2nd', // SEA TL2D37 第二球
    3044: 'เลือก', // SEA TL2D37 任选一
    3047: 'EXACT 2D', // SEA TL2D37 二星直选
    3049: 'ANY 2D', // SEA TL2D37 二星组选
    3052: 'BSOE 1st', // SEA TL2D37 第一球
    3053: 'BSOE 2nd', // SEA TL2D37 第二球

    // Thai

    // 一級選單

    2060: 'สองตัว', // 二数
    2055: 'สามตัว', // 三数
    2067: 'เลขวิ่ง', // 跑数
    2297: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2497: 'ซุปเปอร์กำถั่ว', // 番摊

    // 二級選單

    2056: '3 ตัวบน', // 上正 三数
    2058: '3 ตัวโต๊ด', // 上反 三数
    2061: 'บน', // 上正 二数
    2063: '2 ตัวโต๊ด', // 上反 二数
    2643: 'เลขหน้า 3 ตัว', // 三数 二等
    2644: 'รางวัลสามตัวบน', // 三数 二特
    2065: 'เลขท้าย 2 ตัว', // 直选加开
    2068: 'วิ่งเลขท้าย 3 ตัวบน', // 后三不定位

    2298: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2498: 'Fan',
    2500: 'Kwok',
    2502: 'Nim',
    2504: 'ใหญ่เล็กคี่คู่',

    // 三級選單

    2062: 'สองตัวบน-รางวัลที่ 1', // 上正二位数
    2064: '2 ตัวโต๊ด - รางวัลที่ 1', // 上反二位数
    2066: 'สองตัวล่าง', // 下正二位数
    2480: 'บรรทัดฐาน สองตัวล่าง',
    2481: 'ป้อนด้วยตนเอง สองตัวล่าง',
    2482: 'บรรทัดฐาน สองตัวบนโต๊ด',
    2483: 'บรรทัดฐาน  สองตัวบน',
    2484: 'ป้อนด้วยตนเอง  สองตัวบน',

    2057: 'สามตัวบน-รางวัลที่ 1', // 上正三位数
    2059: '3 ตัวโต๊ด - รางวัลที่ 1', // 上反三位数
    2645: 'เลขหน้า 3 ตัว', // 二等三位数
    2646: 'สามตัวบน', // 二特三位数
    2069: 'เลขวิ่ง - รางวัลที่ 1', // 上跑三位数
    2485: 'บรรทัดฐาน สามตัวบน',
    2486: 'ป้อนด้วยตนเอง สามตัวบน',
    2487: 'บรรทัดฐาน สามตัวโต้ด',

    2299: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2499: 'Fan',
    2501: 'Kwok',
    2503: 'Nim',
    2505: 'ใหญ่เล็กคี่คู่',

    // vnc 越南彩

    // 一級選單

    2090: 'สี่ตัว', // 四数
    2095: 'สามตัว', // 三数
    2100: 'สองตัว', // 二数
    2105: 'เลขวิ่ง', // 跑数

    2515: 'ทุกรางวัล', // 包膽 北部
    2528: 'ทุกรางวัล', // 包膽 中南部

    2550: 'ตัวไม่ตรง', // 北部 逆向 - 一級選單
    2560: 'ตัวไม่ตรง', // 中南部 逆向 - 一級選單

    2598: 'พาร์เลย์', // 北部 串组 - 一級選單
    2608: 'พาร์เลย์', // 中南部 串组 - 一級選單

    2300: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2488: 'ซุปเปอร์กำถั่ว', // 番摊

    2618: 'ไฮโล', // 骰寶快三

    2624: 'การจัดอันดับ', // 极速PK10 - 第1-10名排名
    2627: 'ครั้งแรกและครั้งที่สอง', // 极速PK10 - 冠亚和值
    2630: 'เสือมังกร', // 极速PK10 - 龙虎斗

    // 二級選單

    2091: 'ตรง', // 四数 上正
    2093: 'โต๊ด', // 四数 上反
    2096: 'เหมือนกัน', // 三数 上正
    2098: 'ตองใดๆ', // 三数 上反
    2101: 'เหมือนกัน', // 二数 上正
    2103: 'ตองใดๆ', // 二数 下正

    2301: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2489: 'Fan', // 番
    2491: 'Kwok', // 角
    2493: 'Nim', // 念
    2495: 'ใหญ่เล็กคี่คู่', // 大小单双

    2619: 'การแทงเต็งเลข', // 骰寶快三 - 单骰
    2620: 'แทงจำนวนแต้ม', // 骰寶快三 - 和值
    2621: 'แทงลูกตอง', // 骰寶快三 - 围骰
    2622: 'แทงลูกตองรวม', // 骰寶快三 - 全围
    2623: 'ใหญ่เล็กคี่คู่', // 骰寶快三 - 大小单双

    2625: 'การจัดอันดับ', // 极速PK10 - 第1-10名排名-二級選單
    2626: 'สูงต่ำคี่คู่', // 极速PK10 - 第1-10名-大小单双
    2628: 'ครั้งแรกและครั้งที่สอง', // 极速PK10 - 冠亚和值-二級選單
    2629: 'ผลรวมใหญเล็ก', // 极速PK10 - 冠亚和值-大小单双
    2631: 'เสือมังกร', // 极速PK10 - 龙虎斗-二級選單

    2516: 'เลขท้าย2ตัว', // 北部 后二包胆
    2520: 'เลขท้าย3ตัว', // 北部 后三包胆
    2524: 'เลขท้าย4ตัว', // 北部 后四包胆

    3054: '2 หลักแรก', // 北部 - 前二包胆
    3055: '2 หลักแรก1K', // 北部 - 前二包胆1K

    2551: 'ไม่ตรงทั้ง4ตัว', // 北部 - 四不中 - 二級選單
    2554: 'ไม่ตรงทั้ง8ตัว', // 北部 - 八不中 - 二級選單
    2557: 'ไม่ตรงทั้ง10ตัว', // 北部 - 十不中 - 二級選單

    2599: 'พาร์เลย์ 2', // 北部 - 串2组 - 二級選單
    2602: 'พาร์เลย์ 3', // 北部 - 串3组 - 二級選單
    2605: 'พาร์เลย์ 4', // 北部 - 串4组 - 二級選單

    2584: '2D รางวัลที่ และพิเศษ', // 北部 - 二数头尾 - 二級選單

    2529: 'เลขท้าย2ตัว', // 中南部 后二包胆
    2533: 'เลขท้าย3ตัว', // 中南部 后三包胆
    2537: 'เลขท้าย4ตัว', // 中南部 后四包胆

    3056: '2 หลักแรก', // 中南部 - 前二包胆
    3057: '2 หลักแรก1K', // 中南部 - 前二包胆1K

    2561: 'ไม่ตรงทั้ง4ตัว', // 中南部 - 四不中 - 二級選單
    2564: 'ไม่ตรงทั้ง8ตัว', // 中南部 - 八不中 - 二級選單
    2567: 'ไม่ตรงทั้ง10ตัว', // 中南部 - 十不中 - 二級選單

    2609: 'พาร์เลย์ 2', // 中南部 - 串2组 - 二級選單
    2612: 'พาร์เลย์ 3', // 中南部 - 串3组 - 二級選單
    2615: 'พาร์เลย์ 4', // 中南部 - 串4组 - 二級選單

    2591: '2D รางวัลที่ และพิเศษ', // 中南部 - 二数头尾 - 二級選單

    2106: 'สุ่ม', // 跑數二級選單
    2108: 'สุ่ม', // 跑數二級選單

    2579: 'สุ่ม', // 特等一等 - 十位個位 - 跑數 - 二級選單

    // 以下在東南亞彩是屬於三級選單直選，在越南彩才是屬於二級選單
    2092: '4 ตัวบน', // 上正四位数 Last_4_Straight_1st_VNC
    2094: '4 ตัวบนโต๊ด', // 上反四位数 Last_4_Combine_1st_VNC
    2097: 'สามตัวบน', // 上正三位数 Last_3_Straight_1st_VNC
    2099: 'สามตัวโต๊ด', // 上反三位数 Last_3_Combine_1st_VNC
    2102: 'สองตัวบน', // 上正二位数 Last_2_Straight_1st_VNC
    2104: 'สองตัวล่าง', // 下正二位数 Last_2_Straight_2nd_VNC
    2107: 'วิ่งบน', // 上跑两位数 Last_2_Any_1st_VNC
    2109: 'วิ่งล่าง', // 下跑两位数 Last_2_Any_2nd_VNC

    2601: 'พาร์เลย์ 2', // 北部 串2组 Bunch_2_North_VNC
    2604: 'พาร์เลย์ 3', // 北部 串3组 Bunch_3_North_VNC
    2607: 'พาร์เลย์ 4', // 北部 串4组 Bunch_4_North_VNC
    2611: 'พาร์เลย์ 2', // 中南部 串2组 Bunch_2_South_VNC
    2614: 'พาร์เลย์ 3', // 中南部 串3组 Bunch_3_South_VNC
    2617: 'พาร์เลย์ 4', // 中南部 串4组 Bunch_4_South_VNC

    2552: 'ไม่ตรงทั้ง4ตัว', // 北部 - 四不中
    2555: 'ไม่ตรงทั้ง8ตัว', // 北部 - 八不中
    2558: 'ไม่ตรงทั้ง10ตัว', // 北部 - 十不中
    2562: 'ไม่ตรงทั้ง4ตัว', // 中南部 - 四不中
    2565: 'ไม่ตรงทั้ง8ตัว', // 中南部 - 八不中
    2568: 'ไม่ตรงทั้ง10ตัว', // 中南部 - 十不中

    2517: 'เลขท้าย2ตัว', // 北部 后二包胆
    2521: 'เลขท้าย3ตัว', // 北部 后三包胆
    2525: 'เลขท้าย4ตัว', // 北部 后四包胆
    2530: 'เลขท้าย2ตัว', // 中南部 后二包胆
    2534: 'เลขท้าย3ตัว', // 中南部 后三包胆
    2538: 'เลขท้าย4ตัว', // 中南部 后四包胆

    2641: 'เลขท้าย2ตัว1K', // 北部 后二包胆 1K
    2642: 'เลขท้าย2ตัว1K', // 中南部 后二包胆 1K

    2586: '2D รางวัลที่ และพิเศษ', // 北部 二数头尾 Last_2_1st_7th_North_VNC
    2589: 'พิเศษเลขท้าย2ตัว', // 北部 二数头 Last_2_7th_North_VNC
    2593: '2D รางวัลที่ และพิเศษ', // 中南部 二数头尾 Last_2_1st_8th_South_VNC
    2596: 'พิเศษเลขท้าย2ตัว', // 中南部 二数头 Last_2_8th_South_VNC

    2580: 'เลขวิ่ง หลักสิบ', // 特等十位 Ten_Digit_1st_VNC
    2581: 'เลขวิ่ง หลักหน่วย', // 特等个位 Unit_Digit_1st_VNC
    2582: 'รางวัลที่1 หลักสิบ', // 一等十位 Ten_Digit_2nd_VNC
    2583: 'รางวัลที่1 หลักหน่วย', // 一等个位 Unit_Digit_2nd_VNC

    2302: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2490: 'Fan', // 番
    2492: 'Kwok', // 角
    2494: 'Nim', // 念
    2496: 'ใหญ่เล็กคี่คู่', // 大小单双

    263700: 'เลขวิ่ง', // VNC 4D 一数 Fixed_Place_4D_VNC

    // 三級選單

    // 北部
    2518: 'เลขท้าย2ตัว บรรทัดฐาน', // 北部 后二包胆(复式)
    2519: 'เลขท้าย2ตัว ป้อนด้วยตนเอง', // 北部 后二包胆(单式)
    2522: 'เลขท้าย3ตัว บรรทัดฐาน', // 北部 后三包胆（复式）
    2523: 'เลขท้าย3ตัว ป้อนด้วยตนเอง', // 北部 后三包胆（单式）
    2526: 'เลขท้าย4ตัว บรรทัดฐาน', // 北部 后四包胆（复式）
    2527: 'เลขท้าย4ตัว ป้อนด้วยตนเอง', // 北部 后四包胆（单式）

    2553: 'ไม่ตรงทั้ง4ตัว ป้อนด้วยตนเอง', // 北部 - 四不中(单式) - 三級選單
    2556: 'ไม่ตรงทั้ง8ตัว ป้อนด้วยตนเอง', // 北部 - 八不中(单式) - 三級選單
    2559: 'ไม่ตรงทั้ง10ตัว ป้อนด้วยตนเอง', // 北部 - 十不中(单式) - 三級選單

    2587: 'บรรทัดฐาน 2D รางวัลที่ และพิเศษ', // 北部 二数头尾（复式) Last_2_1st_7th_North_VNC_Multi
    2590: 'บรรทัดฐาน พิเศษเลขท้าย2ตัว', // 北部 二数头（复式) Last_2_7th_North_VNC_Multi

    // 中南部
    2531: 'เลขท้าย2ตัว บรรทัดฐาน', // 中南部 后二包胆(复式)
    2532: 'เลขท้าย2ตัว ป้อนด้วยตนเอง', // 中南部 后二包胆(单式)
    2535: 'เลขท้าย3ตัว บรรทัดฐาน', // 中南部 后三包胆（复式）
    2536: 'เลขท้าย3ตัว ป้อนด้วยตนเอง', // 中南部 后三包胆（单式）
    2539: 'เลขท้าย4ตัว บรรทัดฐาน', // 中南部 后四包胆（复式）
    2540: 'เลขท้าย4ตัว ป้อนด้วยตนเอง', // 中南部 后四包胆（单式）

    2563: 'ไม่ตรงทั้ง4ตัว ป้อนด้วยตนเอง', // 中南部 - 四不中(单式) - 三級選單
    2566: 'ไม่ตรงทั้ง8ตัว ป้อนด้วยตนเอง', // 中南部 - 八不中(单式) - 三級選單
    2569: 'ไม่ตรงทั้ง10ตัว ป้อนด้วยตนเอง', // 中南部 - 十不中(单式) - 三級選單

    2594: 'บรรทัดฐาน 2D รางวัลที่ และพิเศษ', // 中南部 二数头尾（复式) Last_2_1st_8th_South_VNC_Multi
    2597: 'บรรทัดฐาน พิเศษเลขท้าย2ตัว', // 中南部 二数头(复式) Last_2_8th_South_VNC_Multi

    // 以下不分南北部
    2286: 'บรรทัดฐาน 4 ตัวบน', // 上正四位数（复式）Last_4_Straight_1st_VNC_Multi
    2287: 'ป้อนด้วยตนเอง 4 ตัวบน', // 上正四位数（单式）Last_4_Straight_1st_VNC_Single

    2284: 'บรรทัดฐาน สามตัวบน', // 上正三位数（复式）Last_3_Straight_1st_VNC_Multi
    2285: 'ป้อนด้วยตนเอง สามตัวบน', // 上正三位数（单式）Last_3_Straight_1st_VNC_Single
    2283: 'บรรทัดฐาน สามตัวโต้ด', // Last_3_Combine_1st_VNC_Multi

    2279: 'บรรทัดฐาน สองตัวบน', // 上正二位数(复式) Last_2_Straight_1st_VNC_Multi
    2280: 'ป้อนด้วยตนเอง สองตัวบน', // 上正二位数（单式）Last_2_Straight_1st_VNC_Single
    2281: 'บรรทัดฐาน สองตัวล่าง', // 下正二位数（复式）Last_2_Straight_2nd_VNC_Multi
    2282: 'ป้อนด้วยตนเอง สองตัวล่าง', // 下正二位数（单式）Last_2_Straight_2nd_VNC_Single

    // 一數為特例(不算三級又像三級選單)
    2637: 'เลขวิ่ง (หลักหน่วย)', // VNC 4D 一数 (個位) Fixed_Place_4D_Unit_VNC
    2638: 'เลขวิ่ง (หลักสิบ)', // VNC 4D 一数 (十位) Fixed_Place_4D_Ten_VNC
    2639: 'เลขวิ่ง (หลักร้อย)', // VNC 4D 一数 (百位) Fixed_Place_4D_hundred_VNC
    2640: 'เลขวิ่ง (หลักพัน)', // VNC 4D 一数 (千位) Fixed_Place_4D_Thousand_VNC

    2863: 'Rambolito3', // 三星組3
    2864: 'Rambolito6', // 三星組6
    2865: 'Rambolito3 Last 3D', // 三星組3
    2866: 'Rambolito6 Last 3D', // 三星組6
    2867: 'Rambolito3 Last 3D', // 三星組3
    2868: 'Rambolito6 Last 3D', // 三星組6
    // LAO 老挝彩

    // 一級選單

    2127: 'สี่ตัว', // 四数
    2132: 'สามตัว', // 三数
    2137: 'สองตัว', // 二数
    2142: 'เลขวิ่ง', // 跑数

    2303: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2506: 'ซุปเปอร์กำถั่ว', // 番摊

    // 二級選單

    2128: 'ตรง', // 上正
    2130: 'โต๊ด', // 上反
    2133: 'เหมือนกัน', // 上正
    2135: 'ตองใดๆ', // 上反
    2138: 'เหมือนกัน', // 上正
    2140: 'ตองใดๆ', // 下正
    2129: 'สี่ตัวตรง', // 上正四位数 Last_4_Straight_LAO
    2131: 'สี่ตัวโต๊ด', // 上反四位数 Last_4_Combine_LAO
    2134: 'สามตัวตรง', // 上正三位数 Last_3_Straight_LAO
    2136: 'สามตัวโต๊ด', // 上反三位数 Last_3_Combine_LAO
    2139: 'สองตัวท้าย', // 上正二位数 Last_2_Straight_LAO
    2141: 'สองตัวหน้า', // 下正二位数 First_2_Straight_LAO
    2143: 'สุ่ม', // 跑數二級選單
    2145: 'สุ่ม', // 跑數二級選單

    2304: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2507: 'Fan',
    2509: 'Kwok',
    2511: 'Nim',
    2513: 'ใหญ่เล็กคี่คู่',

    2632: 'เลขวิ่ง', // SEA 4D 一数 Fixed_Place_4D

    // 三級選單

    // 一數為特例(不算三級又像三級選單)
    2633: 'เลขวิ่ง (หลักหน่วย)', // SEA 4D 一数 (個位) Fixed_Place_4D_Unit
    2634: 'เลขวิ่ง (หลักสิบ)', // SEA 4D 一数 (十位) Fixed_Place_4D_Ten
    2635: 'เลขวิ่ง (หลักร้อย)', // SEA 4D 一数 (百位) Fixed_Place_4D_hundred
    2636: 'เลขวิ่ง (หลักพัน)', // SEA 4D 一数 (千位) Fixed_Place_4D_Thousand

    2288: 'บรรทัดฐาน สองตัวบน', // Last_2_Straight_LAO_Multi
    2289: 'ป้อนด้วยตนเอง สองตัวบน', // Last_2_Straight_LAO_Single
    2290: 'บรรทัดฐาน สองตัวล่าง', // First_2_Straight_LAO_Multi
    2291: 'ป้อนด้วยตนเอง สองตัวล่าง', // First_2_Straight_LAO_Single
    2292: 'บรรทัดฐาน สามตัวโต้ด', // Last_3_Combine_LAO_Multi
    2293: 'บรรทัดฐาน สามตัวบน', // Last_3_Straight_LAO_Multi
    2294: 'ป้อนด้วยตนเอง สามตัวบน', // Last_3_Straight_LAO_Single
    2295: 'บรรทัดฐาน 4 ตัวบน', // Last_4_Straight_LAO_Multi
    2296: 'ป้อนด้วยตนเอง 4 ตัวบน', // Last_4_Straight_LAO_Single
    2144: 'วิ่งบน', // 上跑两位数 Last_2_Any_LAO
    2146: 'วิ่งล่าง', // 下跑两位数 First_2_Any_LAO

    2305: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2508: 'Fan',
    2510: 'Kwok',
    2512: 'Nim',
    2514: 'ใหญ่เล็กคี่คู่',

    // Keno

    // 一級選單

    2647: 'เลือก', // 任選 - 一級選單 Any_KENO
    2656: 'การรวมกัน', // 趣味 - 一級選單 Fun_KENO

    // 二級選單

    2648: 'เลือก', // 任選 - 二級選單 Any_L2_KENO
    2657: 'สูง, คะแนนสะสม, ต่ำ', // 趣味 - 總和大小 Total_Sum_BST_KENO
    2658: 'คี่, คู่', // 趣味 - 總和單雙 Total_Sum_OE_KENO
    2659: 'พาร์เลย์ สูง ต่ำ, คี่ คู่', // 趣味 - 總和過關 Total_Sum_PASS_KENO
    2660: 'บน, เสมอ, ล่าง', // 趣味 - 上下盤 UpDown_KENO
    2661: 'คี่, เสมอ, คู่', // 趣味 - 奇偶盤 OddEven_KENO
    2662: 'ห้าอันดับ', // 趣味 - 五行 WuXing_KENO

    // 三級選單

    2649: 'เลือก 1', // 任選一 Any1_KENO
    2650: 'เลือก 2', // 任選二 Any2_KENO
    2651: 'เลือก 3', // 任選三 Any3_KENO
    2652: 'เลือก 4', // 任選四 Any4_KENO
    2653: 'เลือก 5', // 任選五 Any5_KENO
    2654: 'เลือก 6', // 任選六 Any6_KENO
    2655: 'เลือก 7', // 任選七 Any7_KENO

    // BCR
    2889: 'บาคาร่า',
    2890: 'เจ้ามือ & ผู้เล่น & เสมอ',
    2891: 'คู่เจ้ามือ',
    2892: 'คู่ผู้เล่น',
    2893: 'ซุปเปอร์ 6',

    // BCB
    3098: 'BCB',
    3099: 'BCB',

    // Wingo-Level:1

    3060: 'วิ่งเลข', // SEA Wingo 跑数

    // Wingo-Level:2

    3061: 'เดาขนาด', // SEA Wingo 大小
    3063: 'เดาตัวเลข', // SEA Wingo 数字
    3065: 'เดาสี', // SEA Wingo 顔色

    // Wingo-Level:3

    3062: 'เดาขนาด', // SEA Wingo 大小
    3064: 'เดาตัวเลข', // SEA Wingo 猜数字
    3066: 'เดาสี', // SEA Wingo 猜紅色
    3067: 'เดาสี', // SEA Wingo 猜綠色
    3068: 'เดาสี', // SEA Wingo 猜紫色

    // 5D-Level:1

    3069: 'การผสมรวม', // SEA 5D 整合
    3077: 'วิ่งเลข', // SEA 5D 跑數

    // 5D-Level:2

    3070: 'เลือกตรง ใหญ่ เล็ก คี่ คู่', // SEA 5D 大小单双
    3078: 'เลือกหมายเลข', // SEA 5D 直选

    // 5D-Level:3

    3071: 'ผลรวมขนาดคี่คู่', // SEA 5D 和值
    3072: 'ขนาดตำแหน่ง A คี่คู่', // SEA 5D 第一球
    3073: 'ขนาดตำแหน่ง B คี่คู่', // SEA 5D 第二球
    3074: 'ขนาดตำแหน่ง C คี่คู่', // SEA 5D 第三球
    3075: 'ขนาดตำแหน่ง D คี่คู่', // SEA 5D 第四球
    3076: 'ขนาดตำแหน่ง E คี่คู่', // SEA 5D 第五球
    3079: 'การเลือกหมายเลขตำแหน่ง A', // SEA 5D 第一球
    3080: 'การเลือกหมายเลขตำแหน่ง B', // SEA 5D 第二球
    3081: 'การเลือกหมายเลขตำแหน่ง C', // SEA 5D 第三球
    3082: 'การเลือกหมายเลขตำแหน่ง D', // SEA 5D 第四球
    3083: 'การเลือกหมายเลขตำแหน่ง E', // SEA 5D 第五球

    // SEAK3-Level:1

    3084: 'การผสมรวม', // SEA SEAK3 整合

    // SEAK3-Level:2

    3085: 'SUM', // SEA SEAK3 和值
    3088: '2 Same', // SEA SEAK3 2骰子
    3091: '3 Same', // SEA SEAK3 3骰子
    3094: 'Different', // SEA SEAK3 不同骰

    // SEAK3-Level:3

    3086: 'Total', // SEA SEAK3 和值
    3087: 'ผลรวมขนาดคี่คู่', // SEA SEAK3 大小單雙
    3089: '2 เลือกเลขเดียว', // SEA SEAK3 2同号单选
    3090: '2 การเลือกซ้ำที่มีตัวเลขเดียวกัน', // SEA SEAK3 2同号复选
    3092: '3 เลือกตัวเลือกเลขเดียวกัน', // SEA SEAK3 3同号单选
    3093: '3เลขเดียวเลือกทั้งหมด', // SEA SEAK3 3同号通选
    3095: 'ต่อเนื่อง', // SEA SEAK3 全順
    3096: '3 ไม่เหมือนกัน', // SEA SEAK3 3不同
    3097: '2 ที่แตกต่างกัน', // SEA SEAK3 2不同

    // SEAPK10-Level:1

    3100: 'การจัดอันดับ', // SEA SEAPK10 第1-10名排名
    3101: '1-10 สูงต่ำ', // SEA SEAPK10 第1-10名大小
    3102: '1-10 คี่คู่', // SEA SEAPK10 第1-10名單雙

    // SEAPK10-Level:2

    3103: 'การจัดอันดับ', // SEA SEAPK10 第1-10名排名
    3104: '1-10 สูงต่ำ', // SEA SEAPK10 第1-10名大小
    3105: '1-10 คี่คู่', // SEA SEAPK10 第1-10名單雙

    // SEAPK10-Level:3

    3106: 'การจัดอันดับ', // SEA SEAPK10 排名
    3107: 'สูง/ต่ำ', // SEA SEAPK10 大小
    3108: 'คี่/คู่', // SEA SEAPK10 單雙
  },
};

export default PlayMenu;
