const PlayMenu = {
  playId: {
    // VTX
    2675: 'ไฮโลเวียดนาม',
    2676: 'ใหญ่เล็ก',

    // VXD
    2677: 'เหรียญสีนำโชค',
    2678: 'ใหญ่เล็ก',
    2679: 'คี่คู่',
    2680: 'แดงทั้งหมด',
    2681: 'เหรียญขาว',
    2682: 'เหรียญขาว 3+ เหรียญแดง 1',
    2683: 'เหรียญแดง 3+ เหรียญขาว 1',

    // VBC 魚蝦蟹
    2733: 'น้ำเต้าปูปลา',
    2734: 'น้ำเต้าปูปลา',

    // SEA SEA V2 TL(天龍)

    // 一級選單

    // TL2D

    2735: 'เลขวิ่ง', // sea tl2d 一星
    2741: 'สองตัว', // SEA TL2D 二星
    2746: 'การรวมกัน', // SEA TL2D 趣味

    // TL3D

    2684: 'สองตัว', // SEA TL3D 二數
    2689: 'สามตัว', // SEA TL3D 三數
    2694: 'เลขวิ่ง', // SEA TL3D 跑數
    2750: 'การรวมกัน', // SEA TL3D 趣味

    // TL4D

    2697: 'สองตัว', // SEA TL4D 二數
    2702: 'สามตัว', // SEA TL4D 三數
    2707: 'สี่ตัว', // SEA TL4D 四數
    2712: 'เลขวิ่ง', // SEA TL4D 跑數
    2755: 'การรวมกัน', // SEA TL4D 趣味

    // TL6D

    2715: 'สองตัว', // SEA TL6D 二數
    2720: 'สามตัว', // SEA TL6D 三數
    2725: 'สี่ตัว', // SEA TL6D 四數
    2730: 'เลขวิ่ง', // SEA TL6D 跑數
    2761: 'การรวมกัน', // SEA TL6D 趣味

    // 二級選單

    // TL2D

    2736: 'EXACT 1D', // SEA TL2D 定位胆
    2739: 'เลือก', // SEA TL2D 任选
    2742: 'สองตัวบน', // SEA TL2D 二星直选
    2744: 'สองตัวบนโต๊ด',  // SEA TL2D 二星组选
    2747: 'BSOE' ,// SEA TL2D 大小单双

    // TL3D

    2685: 'ตัวบน', // SEA TL3D 後二直選(上正 二數)
    2687: 'ตัวบนโต๊ด', // SEA TL3D 後二組選(上反 二數)
    2690: 'ตัวบน', // SEA TL3D 後三直選(上正 三數)
    2692: 'ตัวบนโต๊ด', // SEA TL3D 後三組選(上反 三數)
    2695: 'สุ่ม', // SEA TL3D 后二不定位
    2751: 'BSOE' ,// SEA TL3D 大小单双

    // TL4D

    2698: 'ตัวบน', // SEA TL4D 後二直選(上正 二數)
    2700: 'ตัวบนโต๊ด', // SEA TL4D 後二組選(上反 二數)
    2703: 'ตัวบน', // SEA TL4D 後三直選(上正 三數)
    2705: 'ตัวบนโต๊ด', // SEA TL4D 後三組選(上反 三數)
    2708: 'ตัวบน', // SEA TL4D 後四直選(上正 四數)
    2710: 'ตัวบนโต๊ด', // SEA TL4D 後四組選(上反 四數)
    2713: 'สุ่ม', // SEA TL4D 后二不定位
    2756: 'BSOE' ,// SEA TL4D 大小单双

    // TL6D

    2716: 'ตัวบน', // SEA TL6D 後二直選(上正 二數)
    2718: 'ตัวบนโต๊ด', // SEA TL6D 後二組選(上反 二數)
    2721: 'ตัวบน', // SEA TL6D 後三直選(上正 三數)
    2723: 'ตัวบนโต๊ด', // SEA TL6D 後三組選(上反 三數)
    2726: 'ตัวบน', // SEA TL6D 後四直選(上正 四數)
    2728: 'ตัวบนโต๊ด', // SEA TL6D 後四組選(上反 四數)
    2731: 'สุ่ม', // SEA TL6D 后二不定位
    2762: 'BSOE' ,// SEA TL6D 大小单双

    // 三級選單

    // TL2D

    2737: 'เลขวิ่ง 1st', // SEA TL2D 定位胆第一球
    2738: 'เลขวิ่ง 2nd',  // SEA TL2D 定位胆第二球
    2740: 'เลือก', // SEA TL2D 任选一

    2743: 'สองตัวบน', // SEA TL2D 二星直选
    2745: 'สองตัวบนโต๊ด',  // SEA TL2D 二星组选

    2748: 'BSOE 1st', // SEA TL2D BSOE第一球
    2749: 'BSOE 2nd', // SEA TL2D BSOE第二球

    // TL3D

    2686: 'สองตัวบน', // SEA TL3D 上正二位数
    2688: 'สองตัวโต๊ด', // SEA TL3D 上反二位数
    2691: 'EXACT 3D', // SEA TL3D 上正三位数
    2693: '3D ใดๆ', // SEA TL3D 上反三位数
    2696: 'วิ่งบน', // SEA TL3D 上跑两位数

    2752: 'BSOE 1st', // SEA TL3D BSOE第一球
    2753: 'BSOE 2nd', // SEA TL3D BSOE第二球
    2754: 'BSOE 3rd', // SEA TL3D BSOE第三球

    // TL4D

    2699: 'สองตัวบน', // SEA TL4D 上正二位数
    2701: 'สองตัวโต๊ด', // SEA TL4D 上反二位数
    2704: 'EXACT 3D', // SEA TL4D 上正三位数
    2706: '3D ใดๆ', // SEA TL4D 上反三位数
    2709: 'EXACT 4D', // SEA TL4D 上正四位数
    2711: '4D ใดๆ', // SEA TL4D 上反四位数
    2714: 'วิ่งบน', // SEA TL4D 上跑两位数

    2757: 'BSOE 1st', // SEA TL3D BSOE第一球
    2758: 'BSOE 2nd', // SEA TL3D BSOE第二球
    2759: 'BSOE 3rd', // SEA TL3D BSOE第三球
    2760: 'BSOE 4th', // SEA TL3D BSOE第4球

    // TL6D

    2717: 'สองตัวบน', // SEA TL6D 上正二位数
    2719: 'สองตัวโต๊ด', // SEA TL6D 上反二位数
    2722: 'EXACT 3D', // SEA TL6D 上正三位数
    2724: '3D ใดๆ', // SEA TL6D 上反三位数
    2727: 'EXACT 4D', // SEA TL6D 上正四位数
    2729: '4D ใดๆ', // SEA TL6D 上反四位数
    2732: 'วิ่งบน', // SEA TL6D 上跑两位数

    2763: 'BSOE 1st', // SEA TL3D BSOE第一球
    2764: 'BSOE 2nd', // SEA TL3D BSOE第二球
    2765: 'BSOE 3rd', // SEA TL3D BSOE第三球
    2766: 'BSOE 4th', // SEA TL3D BSOE第4球
    2767: 'BSOE 5th', // SEA TL3D BSOE第5球
    2768: 'BSOE 6th', // SEA TL3D BSOE第6球

    // Thai

    // 一級選單

    2060: 'สองตัว', // 二数
    2055: 'สามตัว', // 三数
    2067: 'เลขวิ่ง', // 跑数
    2297: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2497: 'ซุปเปอร์กำถั่ว', // 番摊

    // 二級選單

    2056: 'เหมือนกัน', // 上正
    2058: 'ตองใดๆ', // 上反
    2061: 'เหมือนกัน', // 上正
    2063: 'ตองใดๆ', // 上反
    2643: 'เลขหน้า 3 ตัว', // 三数 二等
    2644: 'เลขท้าย 3 ตัว', // 三数 二特
    2065: 'ล่าง', // 直选加开
    2068: 'บน', // 后三不定位

    2298: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2498: 'Fan',
    2500: 'Kwok',
    2502: 'Nim',
    2504: 'ใหญ่เล็กคี่คู่',

    // 三級選單

    2062: 'สองตัวบน', // 上正二位数
    2064: 'สองตัวโต๊ด', // 上反二位数
    2066: 'สองตัวล่าง', // 下正二位数
    2480: 'บรรทัดฐาน สองตัวล่าง',
    2481: 'ป้อนด้วยตนเอง สองตัวล่าง',
    2482: 'บรรทัดฐาน สองตัวบนโต๊ด',
    2483: 'บรรทัดฐาน  สองตัวบน',
    2484: 'ป้อนด้วยตนเอง  สองตัวบน',

    2057: 'สามตัวบน', // 上正三位数
    2059: 'สามตัวโต๊ด', // 上反三位数
    2645: 'เลขหน้า 3 ตัว', // 二等三位数
    2646: 'เลขท้าย 3 ตัว', // 二特三位数
    2069: 'วิ่ง 3 ตัวบน', // 上跑三位数
    2485: 'บรรทัดฐาน สามตัวบน',
    2486: 'ป้อนด้วยตนเอง สามตัวบน',
    2487: 'บรรทัดฐาน สามตัวโต้ด',

    2299: 'น้ำเต้าปูปลา', // 魚蝦蟹
    
    2499: 'Fan',
    2501: 'Kwok',
    2503: 'Nim',
    2505: 'ใหญ่เล็กคี่คู่',

    // vnc 越南彩

    // 一級選單

    2090: 'สี่ตัว', // 四数
    2095: 'สามตัว', // 三数
    2100: 'สองตัว', // 二数
    2105: 'เลขวิ่ง', // 跑数

    2515: 'ทุกรางวัล', // 包膽 北部
    2528: 'ทุกรางวัล', // 包膽 中南部

    2550: 'ตัวไม่ตรง', // 北部 逆向 - 一級選單
    2560: 'ตัวไม่ตรง', // 中南部 逆向 - 一級選單

    2598: 'พาร์เลย์', // 北部 串组 - 一級選單
    2608: 'พาร์เลย์', // 中南部 串组 - 一級選單

    2300: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2488: 'ซุปเปอร์กำถั่ว', // 番摊

    2618: 'ไฮโล', // 骰寶快三

    2624: 'การจัดอันดับ', // 极速PK10 - 第1-10名排名
    2627: 'ครั้งแรกและครั้งที่สอง', // 极速PK10 - 冠亚和值
    2630: 'เสือมังกร', // 极速PK10 - 龙虎斗

    // 二級選單

    2091: 'เหมือนกัน', // 四数 上正
    2093: 'ตองใดๆ', // 四数 上反
    2096: 'เหมือนกัน', // 三数 上正
    2098: 'ตองใดๆ', // 三数 上反
    2101: 'เหมือนกัน', // 二数 上正
    2103: 'เหมือนกัน', // 二数 下正

    2301: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2489: 'Fan', // 番
    2491: 'Kwok', // 角
    2493: 'Nim', // 念
    2495: 'ใหญ่เล็กคี่คู่', // 大小单双

    2619: 'การแทงเต็งเลข', // 骰寶快三 - 单骰
    2620: 'แทงจำนวนแต้ม', // 骰寶快三 - 和值
    2621: 'แทงลูกตอง', // 骰寶快三 - 围骰
    2622: 'แทงลูกตองรวม', // 骰寶快三 - 全围
    2623: 'ใหญ่เล็กคี่คู่', // 骰寶快三 - 大小单双

    2625: 'การจัดอันดับ', // 极速PK10 - 第1-10名排名-二級選單
    2626: 'สูงต่ำคี่คู่', // 极速PK10 - 第1-10名-大小单双
    2628: 'ครั้งแรกและครั้งที่สอง', // 极速PK10 - 冠亚和值-二級選單
    2629: 'ผลรวมใหญเล็ก', // 极速PK10 - 冠亚和值-大小单双
    2631: 'เสือมังกร', // 极速PK10 - 龙虎斗-二級選單

    2516: 'เลขท้าย2ตัว', // 北部 后二包胆
    2520: 'เลขท้าย3ตัว', // 北部 后三包胆
    2524: 'เลขท้าย4ตัว', // 北部 后四包胆

    2551: 'ไม่ตรงทั้ง4ตัว', // 北部 - 四不中 - 二級選單
    2554: 'ไม่ตรงทั้ง8ตัว', // 北部 - 八不中 - 二級選單
    2557: 'ไม่ตรงทั้ง10ตัว', // 北部 - 十不中 - 二級選單

    2599: 'พาร์เลย์ 2', // 北部 - 串2组 - 二級選單
    2602: 'พาร์เลย์ 3', // 北部 - 串3组 - 二級選單
    2605: 'พาร์เลย์ 4', // 北部 - 串4组 - 二級選單

    2584: '2D รางวัลที่ และพิเศษ', // 北部 - 二数头尾 - 二級選單

    2529: 'เลขท้าย2ตัว', // 中南部 后二包胆
    2533: 'เลขท้าย3ตัว', // 中南部 后三包胆
    2537: 'เลขท้าย4ตัว', // 中南部 后四包胆

    2561: 'ไม่ตรงทั้ง4ตัว', // 中南部 - 四不中 - 二級選單
    2564: 'ไม่ตรงทั้ง8ตัว', // 中南部 - 八不中 - 二級選單
    2567: 'ไม่ตรงทั้ง10ตัว', // 中南部 - 十不中 - 二級選單

    2609: 'พาร์เลย์ 2', // 中南部 - 串2组 - 二級選單
    2612: 'พาร์เลย์ 3', // 中南部 - 串3组 - 二級選單
    2615: 'พาร์เลย์ 4', // 中南部 - 串4组 - 二級選單

    2591: '2D รางวัลที่ และพิเศษ', // 中南部 - 二数头尾 - 二級選單

    2106: 'สุ่ม', // 跑數二級選單
    2108: 'สุ่ม', // 跑數二級選單

    2579: 'สุ่ม', // 特等一等 - 十位個位 - 跑數 - 二級選單

    // 以下在東南亞彩是屬於三級選單直選，在越南彩才是屬於二級選單
    2092: '4 ตัวบน', // 上正四位数 Last_4_Straight_1st_VNC
    2094: '4 ตัวบนโต๊ด', // 上反四位数 Last_4_Combine_1st_VNC
    2097: 'สามตัวบน', // 上正三位数 Last_3_Straight_1st_VNC
    2099: 'สามตัวโต๊ด', // 上反三位数 Last_3_Combine_1st_VNC
    2102: 'สองตัวบน', // 上正二位数 Last_2_Straight_1st_VNC
    2104: 'สองตัวล่าง', // 下正二位数 Last_2_Straight_2nd_VNC
    2107: 'วิ่งบน', // 上跑两位数 Last_2_Any_1st_VNC
    2109: 'วิ่งล่าง', // 下跑两位数 Last_2_Any_2nd_VNC

    2601: 'พาร์เลย์ 2', // 北部 串2组 Bunch_2_North_VNC
    2604: 'พาร์เลย์ 3', // 北部 串3组 Bunch_3_North_VNC
    2607: 'พาร์เลย์ 4', // 北部 串4组 Bunch_4_North_VNC
    2611: 'พาร์เลย์ 2', // 中南部 串2组 Bunch_2_South_VNC
    2614: 'พาร์เลย์ 3', // 中南部 串3组 Bunch_3_South_VNC
    2617: 'พาร์เลย์ 4', // 中南部 串4组 Bunch_4_South_VNC

    2552: 'ไม่ตรงทั้ง4ตัว', // 北部 - 四不中
    2555: 'ไม่ตรงทั้ง8ตัว', // 北部 - 八不中
    2558: 'ไม่ตรงทั้ง10ตัว', // 北部 - 十不中
    2562: 'ไม่ตรงทั้ง4ตัว', // 中南部 - 四不中
    2565: 'ไม่ตรงทั้ง8ตัว', // 中南部 - 八不中
    2568: 'ไม่ตรงทั้ง10ตัว', // 中南部 - 十不中

    2517: 'เลขท้าย2ตัว', // 北部 后二包胆
    2521: 'เลขท้าย3ตัว', // 北部 后三包胆
    2525: 'เลขท้าย4ตัว', // 北部 后四包胆
    2530: 'เลขท้าย2ตัว', // 中南部 后二包胆
    2534: 'เลขท้าย3ตัว', // 中南部 后三包胆
    2538: 'เลขท้าย4ตัว', // 中南部 后四包胆

    2641: 'เลขท้าย2ตัว1K', // 北部 后二包胆 1K
    2642: 'เลขท้าย2ตัว1K', // 中南部 后二包胆 1K

    2586: '2D รางวัลที่ และพิเศษ', // 北部 二数头尾 Last_2_1st_7th_North_VNC
    2589: 'พิเศษเลขท้าย2ตัว', // 北部 二数头 Last_2_7th_North_VNC
    2593: '2D รางวัลที่ และพิเศษ', // 中南部 二数头尾 Last_2_1st_8th_South_VNC
    2596: 'พิเศษเลขท้าย2ตัว', // 中南部 二数头 Last_2_8th_South_VNC

    2580: 'เลขวิ่ง หลักสิบ', // 特等十位 Ten_Digit_1st_VNC
    2581: 'เลขวิ่ง หลักหน่วย', // 特等个位 Unit_Digit_1st_VNC
    2582: 'รางวัลที่1 หลักสิบ', // 一等十位 Ten_Digit_2nd_VNC
    2583: 'รางวัลที่1 หลักหน่วย', // 一等个位 Unit_Digit_2nd_VNC

    2302: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2490: 'Fan', // 番
    2492: 'Kwok', // 角
    2494: 'Nim', // 念
    2496: 'ใหญ่เล็กคี่คู่', // 大小单双

    263700: 'เลขวิ่ง', // VNC 4D 一数 Fixed_Place_4D_VNC

    // 三級選單

    // 北部
    2518: 'เลขท้าย2ตัว บรรทัดฐาน', // 北部 后二包胆(复式)
    2519: 'เลขท้าย2ตัว ป้อนด้วยตนเอง', // 北部 后二包胆(单式)
    2522: 'เลขท้าย3ตัว บรรทัดฐาน', // 北部 后三包胆（复式）
    2523: 'เลขท้าย3ตัว ป้อนด้วยตนเอง', // 北部 后三包胆（单式）
    2526: 'เลขท้าย4ตัว บรรทัดฐาน', // 北部 后四包胆（复式）
    2527: 'เลขท้าย4ตัว ป้อนด้วยตนเอง', // 北部 后四包胆（单式）

    2553: 'ไม่ตรงทั้ง4ตัว ป้อนด้วยตนเอง', // 北部 - 四不中(单式) - 三級選單
    2556: 'ไม่ตรงทั้ง8ตัว ป้อนด้วยตนเอง', // 北部 - 八不中(单式) - 三級選單
    2559: 'ไม่ตรงทั้ง10ตัว ป้อนด้วยตนเอง', // 北部 - 十不中(单式) - 三級選單

    2587: 'บรรทัดฐาน 2D รางวัลที่ และพิเศษ', // 北部 二数头尾（复式) Last_2_1st_7th_North_VNC_Multi
    2590: 'บรรทัดฐาน พิเศษเลขท้าย2ตัว', // 北部 二数头（复式) Last_2_7th_North_VNC_Multi

    // 中南部
    2531: 'เลขท้าย2ตัว บรรทัดฐาน', // 中南部 后二包胆(复式)
    2532: 'เลขท้าย2ตัว ป้อนด้วยตนเอง', // 中南部 后二包胆(单式)
    2535: 'เลขท้าย3ตัว บรรทัดฐาน', // 中南部 后三包胆（复式）
    2536: 'เลขท้าย3ตัว ป้อนด้วยตนเอง', // 中南部 后三包胆（单式）
    2539: 'เลขท้าย4ตัว บรรทัดฐาน', // 中南部 后四包胆（复式）
    2540: 'เลขท้าย4ตัว ป้อนด้วยตนเอง', // 中南部 后四包胆（单式）

    2563: 'ไม่ตรงทั้ง4ตัว ป้อนด้วยตนเอง', // 中南部 - 四不中(单式) - 三級選單
    2566: 'ไม่ตรงทั้ง8ตัว ป้อนด้วยตนเอง', // 中南部 - 八不中(单式) - 三級選單
    2569: 'ไม่ตรงทั้ง10ตัว ป้อนด้วยตนเอง', // 中南部 - 十不中(单式) - 三級選單

    2594: 'บรรทัดฐาน 2D รางวัลที่ และพิเศษ', // 中南部 二数头尾（复式) Last_2_1st_8th_South_VNC_Multi
    2597: 'บรรทัดฐาน พิเศษเลขท้าย2ตัว', // 中南部 二数头(复式) Last_2_8th_South_VNC_Multi

    // 以下不分南北部
    2286: 'บรรทัดฐาน 4 ตัวบน', // 上正四位数（复式）Last_4_Straight_1st_VNC_Multi
    2287: 'ป้อนด้วยตนเอง 4 ตัวบน', // 上正四位数（单式）Last_4_Straight_1st_VNC_Single

    2284: 'บรรทัดฐาน สามตัวบน', // 上正三位数（复式）Last_3_Straight_1st_VNC_Multi
    2285: 'ป้อนด้วยตนเอง สามตัวบน', // 上正三位数（单式）Last_3_Straight_1st_VNC_Single
    2283: 'บรรทัดฐาน สามตัวโต้ด', // Last_3_Combine_1st_VNC_Multi

    2279: 'บรรทัดฐาน สองตัวบน', // 上正二位数(复式) Last_2_Straight_1st_VNC_Multi
    2280: 'ป้อนด้วยตนเอง สองตัวบน', // 上正二位数（单式）Last_2_Straight_1st_VNC_Single
    2281: 'บรรทัดฐาน สองตัวล่าง', // 下正二位数（复式）Last_2_Straight_2nd_VNC_Multi
    2282: 'ป้อนด้วยตนเอง สองตัวล่าง', // 下正二位数（单式）Last_2_Straight_2nd_VNC_Single

    // 一數為特例(不算三級又像三級選單)
    2637: 'เลขวิ่ง (หลักหน่วย)', // VNC 4D 一数 (個位) Fixed_Place_4D_Unit_VNC
    2638: 'เลขวิ่ง (หลักสิบ)', // VNC 4D 一数 (十位) Fixed_Place_4D_Ten_VNC
    2639: 'เลขวิ่ง (หลักร้อย)', // VNC 4D 一数 (百位) Fixed_Place_4D_hundred_VNC
    2640: 'เลขวิ่ง (หลักพัน)', // VNC 4D 一数 (千位) Fixed_Place_4D_Thousand_VNC

    // LAO 老挝彩

    // 一級選單

    2127: 'สี่ตัว', // 四数
    2132: 'สามตัว', // 三数
    2137: 'สองตัว', // 二数
    2142: 'เลขวิ่ง', // 跑数

    2303: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2506: 'ซุปเปอร์กำถั่ว', // 番摊

    // 二級選單

    2128: 'เหมือนกัน', // 上正
    2130: 'ตองใดๆ', // 上反
    2133: 'เหมือนกัน', // 上正
    2135: 'ตองใดๆ', // 上反
    2138: 'เหมือนกัน', // 上正
    2140: 'เหมือนกัน', // 下正
    2129: ' 4 ตัวบน', // 上正四位数 Last_4_Straight_LAO
    2131: ' 4 ตัวบนโต๊ด', // 上反四位数 Last_4_Combine_LAO
    2134: 'สามตัวบน', // 上正三位数 Last_3_Straight_LAO
    2136: 'สามตัวโต๊ด', // 上反三位数 Last_3_Combine_LAO
    2139: 'สองตัวบน', // 上正二位数 Last_2_Straight_LAO
    2141: 'สองตัวล่าง', // 下正二位数 First_2_Straight_LAO
    2143: 'สุ่ม', // 跑數二級選單
    2145: 'สุ่ม', // 跑數二級選單

    2304: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2507: 'Fan',
    2509: 'Kwok',
    2511: 'Nim',
    2513: 'ใหญ่เล็กคี่คู่',

    2632: 'เลขวิ่ง', // SEA 4D 一数 Fixed_Place_4D

    // 三級選單

    // 一數為特例(不算三級又像三級選單)
    2633: 'เลขวิ่ง (หลักหน่วย)', // SEA 4D 一数 (個位) Fixed_Place_4D_Unit
    2634: 'เลขวิ่ง (หลักสิบ)', // SEA 4D 一数 (十位) Fixed_Place_4D_Ten
    2635: 'เลขวิ่ง (หลักร้อย)', // SEA 4D 一数 (百位) Fixed_Place_4D_hundred
    2636: 'เลขวิ่ง (หลักพัน)', // SEA 4D 一数 (千位) Fixed_Place_4D_Thousand

    2288: 'บรรทัดฐาน สองตัวบน', // Last_2_Straight_LAO_Multi
    2289: 'ป้อนด้วยตนเอง สองตัวบน', // Last_2_Straight_LAO_Single
    2290: 'บรรทัดฐาน สองตัวล่าง', // First_2_Straight_LAO_Multi
    2291: 'ป้อนด้วยตนเอง สองตัวล่าง', // First_2_Straight_LAO_Single
    2292: 'บรรทัดฐาน สามตัวโต้ด', // Last_3_Combine_LAO_Multi
    2293: 'บรรทัดฐาน สามตัวบน', // Last_3_Straight_LAO_Multi
    2294: 'ป้อนด้วยตนเอง สามตัวบน', // Last_3_Straight_LAO_Single
    2295: 'บรรทัดฐาน 4 ตัวบน', // Last_4_Straight_LAO_Multi
    2296: 'ป้อนด้วยตนเอง 4 ตัวบน', // Last_4_Straight_LAO_Single
    2144: 'วิ่งบน', // 上跑两位数 Last_2_Any_LAO
    2146: 'วิ่งล่าง', // 下跑两位数 First_2_Any_LAO

    2305: 'น้ำเต้าปูปลา', // 魚蝦蟹

    2508: 'Fan',
    2510: 'Kwok',
    2512: 'Nim',
    2514: 'ใหญ่เล็กคี่คู่',

    // Keno

    // 一級選單

    2647: 'เลือก', // 任選 - 一級選單 Any_KENO 
    2656: 'การรวมกัน', // 趣味 - 一級選單 Fun_KENO

    // 二級選單

    2648: 'เลือก', // 任選 - 二級選單 Any_L2_KENO
    2657: 'สูง, คะแนนสะสม, ต่ำ', // 趣味 - 總和大小 Total_Sum_BST_KENO
    2658: 'คี่, คู่', // 趣味 - 總和單雙 Total_Sum_OE_KENO
    2659: 'พาร์เลย์ สูง ต่ำ, คี่ คู่', // 趣味 - 總和過關 Total_Sum_PASS_KENO
    2660: 'บน, เสมอ, ล่าง', // 趣味 - 上下盤 UpDown_KENO
    2661: 'คี่, เสมอ, คู่', // 趣味 - 奇偶盤 OddEven_KENO
    2662: 'ห้าอันดับ', // 趣味 - 五行 WuXing_KENO

    // 三級選單

    2649: 'เลือก 1', // 任選一 Any1_KENO
    2650: 'เลือก 2', // 任選二 Any2_KENO
    2651: 'เลือก 3', // 任選三 Any3_KENO
    2652: 'เลือก 4', // 任選四 Any4_KENO
    2653: 'เลือก 5', // 任選五 Any5_KENO
    2654: 'เลือก 6', // 任選六 Any6_KENO
    2655: 'เลือก 7', // 任選七 Any7_KENO
  },
};

export default PlayMenu;
