const PlayMenu = {
  playId: {
    // Thai
    2056: 'บน',
    2058: 'โต๊ด',
    2061: 'บน',
    2063: 'โต๊ด',
    2065: 'ล่าง',
    2068: 'บน',
    2055: 'สามตัว', // 三数
    2057: 'สามตัวบน',
    2059: 'สามตัวโต๊ด',
    2060: 'สองตัว', // 二数
    2062: 'สองตัวบน',
    2064: 'สองตัวโต๊ด',
    2066: 'สองตัวล่าง',
    2067: 'เลขวิ่ง', // 跑数
    2069: 'วิ่ง 3 ตัวบน',
    2480: 'บรรทัดฐาน สองตัวล่าง',
    2481: 'ป้อนด้วยตนเอง สองตัวล่าง',
    2482: 'บรรทัดฐาน สองตัวบนโต๊ด',
    2483: 'บรรทัดฐาน  สองตัวบน',
    2484: 'ป้อนด้วยตนเอง  สองตัวบน',
    2485: 'บรรทัดฐาน สามตัวบน',
    2486: 'ป้อนด้วยตนเอง สามตัวบน',
    2487: 'บรรทัดฐาน สามตัวโต้ด',

    2297: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2299: 'น้ำเต้าปูปลา', // 魚蝦蟹

    // vnc 越南彩
    2090: 'สี่ตัว', // 四数
    2095: 'สามตัว', // 三数
    2100: 'สองตัว', // 二数
    2105: 'เลขวิ่ง', // 跑数

    2092: ' 4 ตัวบน', // 上正四位数 Last_4_Straight_1st_VNC
    2094: ' 4 ตัวบนโต๊ด', // 上反四位数 Last_4_Combine_1st_VNC
    2097: 'สามตัวบน', // 上正三位数 Last_3_Straight_1st_VNC
    2099: 'สามตัวโต๊ด', // 上反三位数 Last_3_Combine_1st_VNC
    2102: 'สองตัวบน', // 上正二位数 Last_2_Straight_1st_VNC
    2104: 'สองตัวล่าง', // 下正二位数 Last_2_Straight_2nd_VNC
    2107: 'วิ่งบน', // 上跑两位数 Last_2_Any_1st_VNC
    2109: 'วิ่งล่าง', // 下跑两位数 Last_2_Any_2nd_VNC

    2286: 'บรรทัดฐาน 4 ตัวบน', // Last_4_Straight_1st_VNC_Multi
    2287: 'ป้อนด้วยตนเอง 4 ตัวบน', // Last_4_Straight_1st_VNC_Single
    2285: 'ป้อนด้วยตนเอง สามตัวบน', // Last_3_Straight_1st_VNC_Single
    2284: 'บรรทัดฐาน สามตัวบน', // Last_3_Straight_1st_VNC_Multi
    2283: 'บรรทัดฐาน สามตัวโต้ด', // Last_3_Combine_1st_VNC_Multi
    2280: 'ป้อนด้วยตนเอง สองตัวบน', // Last_2_Straight_1st_VNC_Single
    2279: 'บรรทัดฐาน สองตัวบน', // Last_2_Straight_1st_VNC_Multi
    2282: 'ป้อนด้วยตนเอง สองตัวล่าง', // Last_2_Straight_2nd_VNC_Single
    2281: 'บรรทัดฐาน สองตัวล่าง', // Last_2_Straight_2nd_VNC_Multi


    2300: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2302: 'น้ำเต้าปูปลา', // 魚蝦蟹

    // LAO 老挝彩
    2127: 'สี่ตัว', // 四数
    2132: 'สามตัว', // 三数
    2137: 'สองตัว', // 二数
    2142: 'เลขวิ่ง', // 跑数

    2129: ' 4 ตัวบน', // 上正四位数 Last_4_Straight_LAO
    2131: ' 4 ตัวบนโต๊ด', // 上反四位数 Last_4_Combine_LAO
    2134: 'สามตัวบน', // 上正三位数 Last_3_Straight_LAO
    2136: 'สามตัวโต๊ด', // 上反三位数 Last_3_Combine_LAO
    2139: 'สองตัวบน', // 上正二位数 Last_2_Straight_LAO
    2141: 'สองตัวล่าง', // 下正二位数 First_2_Straight_LAO
    2144: 'วิ่งบน', // 上跑两位数 Last_2_Any_LAO
    2146: 'วิ่งล่าง', // 下跑两位数 First_2_Any_LAO

    2288: 'บรรทัดฐาน สองตัวบน', // Last_2_Straight_LAO_Multi
    2289: 'ป้อนด้วยตนเอง สองตัวบน', // Last_2_Straight_LAO_Single
    2290: 'บรรทัดฐาน สองตัวล่าง', // First_2_Straight_LAO_Multi
    2291: 'ป้อนด้วยตนเอง สองตัวล่าง', // First_2_Straight_LAO_Single
    2292: 'บรรทัดฐาน สามตัวโต้ด', // Last_3_Combine_LAO_Multi
    2293: 'บรรทัดฐาน สามตัวบน', // Last_3_Straight_LAO_Multi
    2294: 'ป้อนด้วยตนเอง สามตัวบน', // Last_3_Straight_LAO_Single
    2295: 'บรรทัดฐาน 4 ตัวบน', // Last_4_Straight_LAO_Multi
    2296: 'ป้อนด้วยตนเอง 4 ตัวบน', // Last_4_Straight_LAO_Single

    2303: 'น้ำเต้าปูปลา', // 魚蝦蟹
    2305: 'น้ำเต้าปูปลา', // 魚蝦蟹
  },
};

export default PlayMenu;
